{"user_name":" Mining Fuzzy Association Rules in A Bank-account Database ","user_timeline":[{"aspect":"abstract","tweet":" Abstract This paper describes how we applied a fuzzy technique to a data-mining task involving a large database that was provided by an international bank with offices in Hong Kong. The database contains the demographic data of over 320,000 customers and their banking transactions, which were collected over a six-month period. By mining the database, the bank would like to be able to discover interesting patterns in the data. The bank expected that the hidden patterns would reveal different characteristics about different customers so that they could better serve and retain them. To help the bank achieve its goal, we developed a fuzzy technique, called FARM II (Fuzzy Association Rule Mining II), which can mine fuzzy association rules. FARM II is able to handle both relational and transactional data. It can also handle fuzzy data. The former type of data allows FARM II to discover multi-dimensional association rules, whereas the latter data allows some of the patterns to be more easily revealed and expressed. To effectively uncover the hidden associations in the bank-account database, FARM II performs several steps. First, it combines the relational and transactional data together by performing data transformations. Second, it identifies fuzzy attributes and performs fuzzification so that linguistic terms can be used to represent the uncovered patterns. Third, it makes use of an efficient rule-search process that is guided by an objective interestingness measure. This measure is defined in terms of fuzzy confidence and support measures, which reflect the differences in the actual and the expected degrees to which a customer is characterized by different linguistic terms. These steps are described in detail in this paper. With FARM II, fuzzy association rules were obtained that were judged by experts from the bank to be very useful. In particular, they discovered that they had identified some interesting characteristics about the customers who had once used the bank‚€™s loan services but then decided later to cease using them. The bank translated what they discovered into actionable items by offering some incentives to retain their existing customers. 1 Index Terms: data mining, fuzzy association rules, linguistic terms, fuzzy sets, transformation functions, relational data, transactional data, rule interestingness measures, customer relationship management, customer retention, customer attrition. "},{"aspect":"expanalysis","tweet":" 6 Fuzzy Association Rules Discovered in the Bank-account Database Instead of applying FARM II to the three original relations in the bank-account database, we performed data mining on the transformed relation (discussed in Section 4). In consultation with the banking officials, we defined appropriate linguistic terms for each attribute in the transformed relation. As an example, two linguistic terms, Small and Large, were defined for the attribute called Loan Balance. The definitions of these linguistic terms are given in Fig. 3. ... 32 Â¡ Â¡ F ps p p p Degree of Membership 1 Small Large 0 0 200000 400000 600000 800000 1000000 Loan Balance Fig. 3. The definitions of the linguistic terms for the attribute called Loan Balance. As another illustration, let us consider the attribute called Customer Age. Four linguistic terms Young, Youth, Middle Aged, and Elderly were defined for Customer Age (see Fig. 4). Degree of Membership 1 Young Youth Middle Aged Elderly 0 0 20 40 60 80 100 Customer Age Fig. 4. The definitions of linguistic terms for the attribute called Customer Age. 33 Using the linguistic terms that were defined by the domain expert, we applied FARM II to the transformed relation. From the discovered fuzzy association rules, we selected 200 rules randomly and presented them to the banking officials whom we consulted on the definition of the linguistic terms. The rules were evaluated according to how useful and how unexpected they were, as judged by the domain expert. The domain expert classified the rules into three categories: very useful, useful, and less useful. The result of the classification of these rules is summarized in Table 2 (below). No. of Rules Percentages Very useful 51 25.5% Useful 132 66.0% Less useful 17 8.5% Table 2. Classification of the fuzzy association rules discovered in the bank-account database. Among the 200 rules, the domain expert found 91.5% of them to be either useful or very useful. We expect that the evaluation of the remaining rules will follow a similar distribution because the 200 evaluated rules were selected randomly. This evaluation is quite high for an automated data-mining tool. The reasons for this are likely to be that our interestingness measure can effectively reveal the interesting associations that are hidden in the data and that the fuzzy association rules, which employ linguistic terms to represent the underlying relationships, are more natural for human users to understand. 34 In the rest of this section, we show some of the discovered fuzzy association rules, which have been identified as very useful by the domain expert. The following rule, regarding the affect that the annual income of a customer and the number of accounts that he/she holds has on the length of the customer relationship, was found to be very useful. Annual Income = Very Large ‚ˆ§ No. of Accounts = Very Small Â† Relationship Length = Very Short [0.71] , where Relationship Length is produced by an arithmetic function, fRelationship Length, which is defined as follows: f Relationship Length ( id) = SYSDATE ‚ˆ’ Ï€ MEMBER_SIN CE ( Ïƒ CUST_ID = id ( CUSTOMER)) , where Ï€ is the PROJECT operation in relational algebra, and SYSDATE returns the current date in Oracle. This rule states that a customer who has a very large annual income and who holds a very small number of accounts will have a very short relationship with the bank. The length of the relationship that the bank has with a customer is important because the bank has a greater opportunity to cross-sell its products and services to a customer if he/she stays with the bank for a longer time. The domain expert found this rule to be useful because it identifies the characteristics of customers who are more likely to have a short-tem relationship with the bank. By providing incentives to these customers, the bank can lengthen the relationships with them and increase its cross-selling opportunities (and hence we hope also improve its profitability). It is important to note that this rule only involves the attributes in the relational data. 35 The following fuzzy association rule, regarding the factors affecting the transaction costs, was also found to be very useful. Sales Cost (Direct) = Large ‚ˆ§ Sales Cost (Branch) = Very Large Â† ATM Transaction Cost = Very Large ‚ˆ§ Branch Transaction Cost = Very Large [5.38] . This rule describes the costs of ATM transactions and branches as being very large if the cost of direct sales is large and the cost of branch sales is also very large. The rule identifies the factors that affect the costs of ATM transactions and branches. Based on this rule, the domain expert suggested that the bank could provide better control of the costs of direct and branch sales so that the costs of ATM transactions and branches could be reduced. It is also important to note that this rule only involves the attributes in the transactional data. Let us consider the fuzzy association rules that involve attributes that are in both the relational and transactional data. Customer Sex = Female Â† Customer Sex = Male Â† Loan Balance = Small [1.23] Loan Balance = Large [0.67] , where Loan Balance is produced by an arithmetic function, fLoan Balance, which is defined as follows: f Loan Balance ( id) = t‚ˆˆÏƒ CUST_ID = id | Ïƒ Â† 36 t[ LOAN_BALANCE] ( ACCOUNT) CUST_ID = id ( ACCOUNT) | The former rule states that female customers are more likely to use small loans, whereas the latter rule describes male customers as being more likely to use large loans. It is important to . note that these rules are concerned with how the demographics of a customer affect his/her transactions. Specifically, they describe the associative relationships between a customer‚€™s gender, which is contained in the relational data, and his/her total loan balances, which are contained in the transactional data. These rules cannot be discovered unless both relational and transactional data are considered together. In addition to these rules, let us also consider the following fuzzy association rule. Customer Sex = Female ‚ˆ§ Marital Status = Widowed Â† Loan Balance = Large [3.62] . This rule states that female customers who are widowed are more likely to use large loans. As discussed above, a female customer is expected to make use of only small loans. However, the fact that these women are widowed, means that they tend to use large loans. Similar to the rules discussed above, this rule associates the demographics (i.e., gender and marital status) of a customer with his/her transactions (i.e., loan balances). This rule can only be revealed if relational and transactional data are considered together. 6.1 Customer Retention On the basis of the fuzzy association rules concerning the loan balance, the domain expert revealed that customers who use small loans could easily settle the loans as compared to those with larger loans. Because of this, customers who use small loans are more likely to stop using the loan services and cease to be a customer. Based on the rules concerning a small loan balance, the bank was able to identify the characteristics of customers that may cease being customers. The bank can retain more of its customers in the future by offering incentives to the 37 customers that have the same characteristics. In this way, FARM II can be used for customer retention or to help reduce the customer attrition rate. Let us consider the fuzzy association rules concerning the affect of the gender of a customer on his/her loan balance. Specifically, they state that female customers are more likely to use small loans, whereas male customers tend to use large loans. Based on these rules, the domain expert also revealed that female customers usually have a significant amount of savings and it is probably because of this reason that they tend to use small loans. This characteristic means that female customers tend to find it easier to settle loans, and hence they are more likely to cease using the loan services as compared to male customers. The attrition of customers is therefore related to gender. This finding was very useful to the domain expert because customers who are likely to cease using the loan services could be identified using these rules. To reduce the attrition rate, the domain expert suggested that incentives, such as lower interest rates, could be offered to female customers. Let us also consider the fuzzy association rule that states that female customers who are widowed are more likely to use large loans. From other rules, we have revealed that female customers are more likely to cease using the loan services. However, the fact that these women are widowed, means that they tend to continue using the loan services. The domain expert found this rule especially useful because it identified a new niche market for promoting the bank‚€™s loan services. 38 "},{"aspect":"expdata","tweet":" 3 The Bank-account Database The bank-account database was provided by a bank in Hong Kong. The bank does not want to be identified in our paper because customer attrition rates are confidential. The bank-account database is stored in an Oracle database, which is one of the most popular relational database management systems [9]. It is composed of 3 relations, namely, CUSTOMER, ACCOUNT, and TRANSACTION. Of these relations, CUSTOMER and ACCOUNT contain relational data, whereas TRANSACTION contains transactional data. Specifically, the bank maintains a tuple in CUSTOMER for each customer (e.g., sex, age, marital status, etc.), a tuple in ACCOUNT for each account owned by a customer (e.g., account type, loan amount limit, etc.), and a tuple in TRANSACTION for each transaction made by a customer on one of his/her accounts (e.g., cash 10 , . deposit, cash withdrawal, etc.). A customer can have one or more accounts and an account can have one or more transactions. Accordingly, a tuple in CUSTOMER is associated with one or more tuples in ACCOUNT, and a tuple in ACCOUNT is associated with one or more tuples in TRANSACTION. Fig. 1 (below) shows the schema of the bank-account database. Since each relation in the bank- account database contains many attributes, we only show a subset of these attributes in Fig. 1. CUSTOMER (CUST_ID, SEX, AGE, MARITAL_STATUS, ‚€¦) ACCOUNT (ACCT_ID, CUST_ID, OVERDRAFT_LIMIT, BALANCE, ‚€¦) TRANSACTION (TID, ACCT_ID, DATE, AMOUNT, ‚€¦) Fig. 1. Schema of the bank-account database. It is important to note that a relation in a relational database may contain relational data or transactional data. The entity that a relation represents is what makes it either relational or transactional. In a relation that contains transactional data, each tuple (transaction record) represents a business transaction. Specifically, a transaction record represents a debit or credit transaction in the bank-account database. A transaction record, therefore, has to store the account involved in the transaction, the date of the transaction, the amount of the transaction, etc. In the bank-account database, CUSTOMER contained data for 320,000 customers. Each customer had opened one or more bank accounts for the purpose of using loan services, such as a mortgage loan, a tax payment loan, etc. In this data, 99.5% of all customers were from Hong Kong and the remaining 0.5% of customers were from other countries (for example, Singapore, 11 Taiwan, France, the United States, etc.). The total loan balance of all customers in the bank- account database was H.K. $11.8 billion in November 1999. The bank-account database was extracted from the time interval of September 1999 through to November 1999. The task was to reveal the interesting associative relationships in the data so as to better serve and retain customers. These relationships are represented in the form of fuzzy association rules. Table 1 (below) gives a summary of the bank-account database. Relation No. of Attributes No. of Tuples CUSTOMER 48 320,000 ACCOUNT 42 558,431 TRANSACTION 37 1,746,996 Table 1. Summary of the bank-account database. 4 Handling of Relational and Transactional Data Together with a domain expert from the bank, we have identified 102 variables, which are associated with each customer, which might affect his/her satisfaction concerning the loan services. Some of these variables can be extracted directly from the bank-account database, whereas some of them are not contained in the original data and they are produced by the transformation functions. To handle the union of both relational and transactional data, we have defined a set of transformation functions to operate on the relations of CUSTOMER, ACCOUNT, and TRANSACTION. The application of these transformation functions to the bank-account database results in a set of transformed data. To manage the data-mining process effectively, the transformed data is stored in a relation in the Oracle database. We refer to this relation as the 12 transformed relation. The use of transformation functions to handle the union of relational and transactional data has been described informally in [6]. More formally, we define the problem formalism below. Let A i1 , Ai 2 , ..., AiK , for i = 1, 2, ‚€¦, I, be the attributes of the real-world entities represented by i the relational tables, Ri, i = 1, 2, ‚€¦, I, respectively. Let the domain of Aik, k = 1, 2, ‚€¦, Ki, be ( 1) ( 2) ( mik ) represented by dom ( A ) = { a , a , ..., a } , i = 1, 2, ‚€¦, I, k = 1, 2, ‚€¦, Ki. In other words, ik ik ik ik R i ‚Š† dom( Ai1 ) Ã— dom( Ai 2 ) Ã— ‚‹…‚‹… ‚‹…Ã— dom( AiK ) . For any Ri, we use i i R A to denote the set of attributes of Ri, that is, A = A , A , ..., A } . The primary key of Ri, which is composed of Ri { i1 i2 iKi one or more attributes and is associated with each tuple in a relation, is represented by K ‚Š† A , A , ..., A } . i { i1 i2 iK i For a database system, a set of transaction records can be denoted by Tj, j = 1, 2, ‚€¦, J, where each Tj is characterized by a set of attributes, which are denoted by A ,..., j1 , Aj 2 AjL , and has a unique transaction identifier TIDj. In other words, j T ‚Š† TID Ã— dom A ) Ã— dom( A ) Ã— ‚‹…‚‹… ‚‹…Ã— dom( A ) . j j ( j1 j 2 jL j The definition of the transaction records, which is used here, follows the idea presented in [23]. It is a generalization of the definition of the transactions used in many of the existing algorithms for mining association rules (e.g., [1], [2], [18], [21]). In these algorithms, a transaction, t, is typically defined as TID, J‚€™, where TID is the transaction identifier of t, J‚€™ ‚Š† J, and J = {item1, ‚€¦, itemn} is a set of items. To store transactions of this kind in a relational database, one can 13 define a relation, T (TID, A1, ‚€¦, An), where TID is a transaction identifier. For any t ‚ˆˆ T, t[Ak] = 1 if t contains itemk; otherwise, t[Ak] = 0, for k = 1, ‚€¦, n. This is a special case of the definition of the transaction records used in this paper. In addition to handling items, our definition can also handle categorical and quantitative attributes. This allows richer semantics to be captured in the transaction records as compared to the definition that is only concerned with items (e.g., [1], [2], [18], [21]). In a database system, there are some one-to-many relationships between the records in Ri, i = 1, 2, ‚€¦, I, and those in Tj, j = 1, 2, ‚€¦, J. For example, the bank-account database contains a set of relational tables (i.e., CUSTOMER and ACCOUNT) that contain background information about each customer and a transactional table (i.e., TRANSACTION) that contains details of each transaction made by a customer. The relational data are related to the transactional data by some one-to-many relationships in such a way that we can find Ki, which is the primary key of Ri, in { j1 j 2 jL j A , A , ..., A } , which can be used as a foreign key to provide a reference to the corresponding tuple in Ri, i = 1, 2, ‚€¦, I. Given Ri and Tj, to deal with both relational and transactional data and to consider additional attributes that were not originally in the database, we propose the concept of using transformation functions that are defined on the original attributes in Ri and Tj. Let f1, f2, ‚€¦, fp be a set of transformation functions, where 14 where rp ‚‰• 1 , and f A p : A Ã— ‚‹…‚‹… ‚‹…Ã— A ‚†’ A‚€² , p = 1, 2, ... , P , ‚ˆˆ p1 Ã— Ap2 Â¤ Â• Â¦ Â¤ I 15 prp pu Ri T j i= 1 j= 1 Â† Â¡ Â¡ Â£ Â¢ Â¤ Â¤ Â• Â¦ Â¡ Â¡ Â£ Â¢ Â† Â† J A A , u = 1, 2, ‚€¦, rp . We can construct a new relation R‚€² that contains both the original attributes in Ri and Tj and the transformed attributes that are obtained by applying appropriate transformation functions. Let R‚€² be composed of attributes, n A A A ‚€² ‚€² ‚€² ..., , , 1 2 , that is, ( 1) ( 2 ) ( n ) A dom A dom A dom R ‚€² Ã— ‚‹… ‚‹… ‚‹… Ã— ‚€² Ã— ‚€² ‚Š† ‚€² , where u A‚€² , u = 1, 2, ‚€¦, n, can be any attribute in Ri, i = 1, 2, ‚€¦, I, or Tj, j = 1, 2, ‚€¦, J, or any A‚€² ‚ˆˆ transformed attribute. In other words, Â§ Â§ Â§ Â¨Â¨ ï¿½ Â© ï¿½ï¿½ï¿½ï¿½ Â¨Â¨ ï¿½ Â© ï¿½ï¿½ï¿½ï¿½ Â¨Â¨ ï¿½ Â© ï¿½ï¿½ï¿½ï¿½ Â§ Â§ I p J A A f ( A ,..., A ) . u Ri T j p p1 prp i= 1 j= 1 p= 1 Instead of performing data mining on the original Ri and Tj, we perform data mining on R‚€² . Given a database, different kinds of transformation functions can be performed. They include logical, arithmetic, substring, and discretization functions. Depending on the type of attribute, one or more of these functions can be applied to the attribute. We provide the definitions of each type of transformation function in the following sections. "},{"aspect":"background","tweet":" 1 Introduction Widespread deregulation, diversification, and globalization have stimulated a dramatic rise in the competition between companies all over the world. To maintain profitability, many companies consider effective Customer Relationship Management (CRM) to be one of the critical factors for success. The central objective of CRM is to maximize the lifetime value of a customer to a company [19]. It has been shown in recent studies (e.g., [12], [20], [22]) that (i) existing customers are more profitable than new customers, (ii) it costs much more to attract a new customer than it does to retain an existing customer, and (iii) retained customers are good candidates for cross selling. It is for these reasons that many companies consider customer retention to be one of their most important business activities. More than 150 international banks, which are headquartered all over the world, have offices set up in Hong Kong. Due to relaxed interest rate controls, the banks in Hong Kong (local or international) have faced fierce competition from each other. To better serve and retain customers, the loans department of a major international bank, with many branches in Hong Kong, decided recently to look at the use of data mining techniques. The bank‚€™s aim was to try to discover hidden patterns in its databases so that it could better understand its customers and design new products to ensure that they are willing to stay with the bank. For the purpose of data mining, the bank decided to look at its bank-account database, which contained data on over 320,000 customers that have used or were using its loan services. More specifically, the bank 2 wanted to look at both the demographic data of the customers and their banking transactions over a period covering the latest 3 months. With these data, the goal was to discover interesting patterns in the data that could provide clues on what incentives it could offer to increase the retention of its customers. <problemdef> The problem of mining association rules was introduced to reveal interesting patterns in data [1]. The mining of association rules was originally defined for transactional data. This was later extended to also handle relational data containing categorical and quantitative data [23]. In its most general form, an association rule is defined for the attributes of a database relation, T. It is an implication of the form X Â† Y, where X and Y are conjunctions of certain conditions. A condition is either Ai = ai, where ai is a value in the domain of the attribute Ai if Ai is categorical, or ai ‚ˆˆ [li, ui], where li and ui are bounding values in the domain of the attribute Ai if Ai is quantitative. The association rule X Â† Y holds in T with a certain support, which is defined as the percentage of tuples that have the characteristics satisfying X and Y, and a certain confidence, which is defined as the percentage of tuples that have the characteristics satisfying Y given that they also satisfy X. An associative relationship is usually considered to be interesting if its support and confidence values are greater than some user-specified minimum [1], [2], [18], [21], [23]. <\/problemdef> An example of an association rule is Marital Status = Single ‚ˆ§ Age ‚ˆˆ [35, 45] ‚ˆ§ Account Balance ‚ˆˆ [1000, 2500] Â† Loan Balance = [10000, 15000] 3 which describes a person who is single, aged between 35 and 45, and with an account balance that is between $1,000 and $2,500, as someone who is likely to use a loan that is between $10,000 and $15,000. An association rule defined over market basket data has a special form. The antecedent and consequent are conjunctions involving Boolean attributes that take on the value of 1. An example of an association rule that is defined over market basket data is: Pizza = 1 ‚ˆ§ Chicken Wings = 1 Â† 4 Coke = 1 ‚ˆ§ Salad = 1. This rule states that a customer who buys pizza and chicken wings also buys coke and salad. Although the existing algorithms for mining association rules (e.g., [23]) can be used to identify interesting characteristics of different types of bank customers, they require the domains of the quantitative attributes to be discretized into intervals. These intervals are often difficult to define. In addition, if too much data lies on the boundaries of the intervals, then this could result in very different discoveries in the data that could be both misleading and meaningless. In addition to the need for discretization, there is a requirement for users to provide the thresholds for minimum support and confidence, and this also makes the existing techniques difficult to use (e.g., [1], [2], [18], [21], [23]). If the thresholds are set too high, a user may miss some useful rules, but if the thresholds are set too low, the user may be overwhelmed by too many irrelevant rules [11]. To handle the problems that were given to us by the banking officials, we developed a fuzzy technique for data mining that is called FARM II (Fuzzy Association Rule Mining II). FARM II employs linguistic terms to represent the revealed regularities and exceptions. This linguistic representation is especially useful when the discovered rules are presented to human experts for examination because of its affinity with human knowledge representation. Since our interpretation of the linguistic terms is based on fuzzy-set theory, the association rules that are expressed in these terms are referred to hereinafter as fuzzy association rules [3]‚€“[6]. An example of a fuzzy association rule is given as follows. where Single is a crisp value, Marital Status = Single ‚ˆ§ Age = Middle ‚ˆ§ Account Balance = Small Â† Loan Balance = Moderate Middle is a linguistic term that is represented by the fuzzy set Â† Â† 40 ‚ˆ’ 50 1 ( x 30) ( 50 ‚ˆ’ x 10 10 + 30 x 40 x 1 ) 1 + x , Small is a linguistic term that is represented by the fuzzy set Â¡ 20000 30000 ‚ˆ’ Â¡ 0 20000 1 ( 30000 ) 10000 x x , and Moderate is a linguistic term that is represented by the fuzzy set Â¢ Â¢ ‚ˆ’ 20000 x ‚ˆ’ 30000 1 10000 1 ( ( 30000 ) 10000 10000 10000) + x 20000 x This rule states that a middle-aged person who is single and has a small balance in his/her bank account is likely to use a loan for a moderate amount. When this rule is compared to the association rule involving discrete intervals, the fuzzy association rule is easier for human users to comprehend. In addition to the linguistic representation, the use of fuzzy techniques hides the boundaries of the adjacent intervals of the quantitative attributes. This makes FARM II resilient 5 x . to noise in the data, such as inaccuracies in the physical measurements of real-life entities. Furthermore, the fact that 0.5 is the fuzziest degree of membership of an element in a fuzzy set provides a new means for FARM II to deal with missing values in databases. Using defuzzification techniques, FARM II allows quantitative values to be inferred when fuzzy association rules are applied to as yet unseen records. To avoid the need for user-specified thresholds, FARM II utilizes an objective interestingness measure, which is defined in terms of a fuzzy support and confidence measure [3]‚€“[7] that reflects the actual and expected degrees to which a tuple is characterized by different linguistic terms. Unlike other data-mining algorithms (e.g., [1], [2], [18], [21], [23]), the use of this interestingness measure has the advantage that it does not require any user-specified thresholds. In addition to dealing with fuzzy data and using an objective interestingness measure, the technique also needs to deal with the problem that is created by the fact that there is more than one database relation. In such a case, the concept of a universal relation needs to be used. A universal relation is an imaginary relation that can be used to represent the data that is constructed by logically joining all of the separate tables of a relational database [24]. The use of a universal relation, therefore, makes it possible for the existing data-mining systems (e.g., [15]) to deal with both transactional and relational data. Unfortunately, the construction of universal relations will very likely lead to the introduction of redundant information, which will mislead the rule-discovery process of many data-mining algorithms. 6 Existing data-mining algorithms (e.g., [1], [2], [18], [21], [23]) can be made more powerful if they can overcome such a problem. They can also be further improved if they can discover rules that involve attributes that were not originally contained in a database. The ability to do so is essential to the mining of interesting patterns in many different application areas. For example, rules regarding consumers‚€™ buying habits at Christmas cannot be discovered if a new attribute of ‚€œholiday‚€ has not been considered. Taking into consideration the need to address these issues, FARM II is equipped with some transformation functions that can be used to deal with both transactional and relational data and the different types of attributes in the databases of a database system so as to construct new relations. To discover the interesting fuzzy association rules that are hidden in these transformed relations, FARM II makes use of an efficient rule-search process that is guided by an objective interestingness measure. This measure is defined in terms of fuzzy confidence and support measures that reflect the differences in the actual and expected degrees to which a customer is characterized by different linguistic terms. The rest of this paper is organized as follows. In Section 2, we provide a description of how the existing algorithms can be used for the mining of association rules and how fuzzy techniques can be applied to the data-mining process. In Section 3, we describe the bank-account database that was provided by the bank. We then introduce a formalism to handle the union of relational and transactional data in Section 4. The details of FARM II are given in Section 5. In this same section, we also present the definition of the linguistic terms and an interestingness measure that can be used for finding the interesting associations that are hidden in databases. In Section 6, we 7 discuss the fuzzy association rules that were discovered by FARM II in the bank-account database. Finally, in Section 7, we conclude this paper with a summary.   2 Related Work To discover association rules, existing data-mining algorithms (e.g., [23]) require the domains of quantitative attributes to be discretized into intervals. The idea has been proposed in [23] to use equi-depth partitioning for optimizing a partial completeness measure so that the intervals are neither too big nor too small with respect to the set of association rules that are discovered by their data-mining algorithm. Regardless of how the values of the quantitative attributes are discretized, the intervals might not be concise and meaningful enough for human users to easily obtain non-trivial knowledge from the discovered association rules. Linguistic summaries, which were introduced in [25], express knowledge using a linguistic representation that is natural for human users to comprehend. An example of a linguistic summary is the statement, ‚€œabout half of the people in the database are middle aged.‚€ Unfortunately, no algorithm was proposed for generating the linguistic summaries in [25]. Recently, the use of an algorithm for mining association rules for the purpose of linguistic summaries has been studied in [14]. This technique extends AprioriTid [2], which is a well-known algorithm for mining association rules, to handle linguistic terms (fuzzy values). An attribute is replaced by a set of artificial attributes (items) so that a tuple supports a specific item to a certain degree, which is in the range 0 to 1. Given two user-specified thresholds, threshold1 and threshold2, an item or an itemset (i.e., a combination of items) is considered interesting if its fuzzy support is greater than threshold1 and it is also less than threshold2. Although this technique is very useful, many users may not be able to set the thresholds appropriately. 8 In addition to the linguistic summaries, an interactive process for the discovery of top-down summaries, which utilizes fuzzy is-a hierarchies as domain knowledge, has been described in [15]. This technique is aimed at discovering a set of generalized tuples, such as technical writer, documentation In contrast to association rules, which involve implications between different attributes, the linguistic summaries and the generalized tuples only provide summarization on different attributes. The idea of implication has not been taken into consideration, and hence these techniques are not developed for the task of rule discovery. Furthermore, the applicability of fuzzy modeling techniques to data mining has been discussed in [13]. Given a relational table, X, and a context variable, A, the context-sensitive fuzzy clustering method is aimed at revealing the structure in X in the context of A. Since this method can only manipulate quantitative attributes, the values of any categorical attributes are first encoded into numeric values. The context-sensitive fuzzy clustering method is then applied to the encoded data to induce clusters in the context of A. Although the encoding technique allows this method to deal with categorical attributes, the distances between the encoded numeric values, which do not possess any meaning in the original categorical attributes, are used to induce the clusters. Therefore, the associations that are concerned with these attributes, which are discovered by the context-sensitive fuzzy clustering method, may be misleading. In addition to the use of intervals to represent the revealed associations that are concerned with quantitative attributes, many existing algorithms (e.g., [1], [2], [18], [21], [23]) are based on 9 using support and confidence measures to discover association rules. Given an association rule, X Â† Y, its support, sup(X Â† Y), and confidence, conf(X Â† Y), are defined as conf Â¢ ( X sup( X Y) = Pr( Â¡ X ‚ˆ§ Y) Pr( X ‚ˆ§ Y ) Y) = Pr( Y | X ) = Pr( X ) Data-mining algorithms, such as [1], [2], [18], [21], [23], are aimed at finding association rules with support and confidence values that are greater than a user-specified minimum support and minimum confidence. Such an approach has a weakness in that many users do not have any idea what values to use for the thresholds. If thresholds are set too high, a user may miss some useful rules, but if they are set too low, the user may be overwhelmed by many irrelevant rules [11]. "},{"aspect":"expintro","tweet":" 4.1 The Logical Functions The logical functions are composed of a combination of logical operators, such as NOT, AND, OR, etc. A logical function can take one or more attributes as arguments. Let f1, f2, ‚€¦, fn be a set of functions so that P f a , a , ..., a ) = ( a = c ) ‚Š• ( a = c ) ‚Š— ‚‹…‚‹… ‚‹…Î˜( a = c ) , j = 1, 2, ‚€¦, n , j ( 1 2 r 1 j1 2 j 2 r jr where ai ‚ˆˆ dom(Ai), cji ‚ˆˆ dom(Ai), Â† Â¡ Â¡ Â£ Â¢ Â¤ Â¤ Â• Â¦ Â¡ Â¡ Â£ Â¢ Â¤ Â¤ Â• Â¦ Â† Â† A ‚ˆˆ i Ri T j i= 1 j= 1 16 I J A A , i = 1, 2, ‚€¦, r , and ‚Š•, ‚Š—, ‚€¦, Î˜ ‚ˆˆ {AND, OR, NOT, XOR, NAND, NOR} . A generic way of utilizing these functions is to construct a logical function, f, defined in terms of f1, f2, ‚€¦, fn, as follows: Â§ Â§ . f ( a1, a2 , ..., ar ) = , . ï¿½ Â§ Â© Â§ A Â§ Â§ Â§ Â¨Â§ 1 2 . n if f ( a , a , ..., a ) = true 1 else if 1 f 2 n 2 else if f ( a , a , ..., a ) = true where ai ‚ˆˆ dom(Ai), ï¿½ ï¿½ï¿½ ï¿½ ï¿½ ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ ï¿½ ï¿½ ï¿½ï¿½ï¿½ï¿½ ï¿½ ï¿½ ‚ˆˆ I i Ri T j i= 1 j= 1 1 ( a , a , ..., a ) = true J 1 2 2 r A A , i = 1, 2, ‚€¦, r . In the case where none of f1, f2, ‚€¦, fn are evaluated as being true, the logical function, f, produces an unknown value as its output. Furthermore, if the value of any attribute, Ai, i = 1, 2, ‚€¦, r, of a tuple is unknown, the logical function, f, also produces an unknown value as its output. 4.2 The Arithmetic Functions The arithmetic functions can involve addition, subtraction, multiplication, and division. An arithmetic function takes a set of attributes as its argument and produces an attribute that has a r r type of real or integer. Let f1, f2, ‚€¦, fr be operations in relational algebra, each of which produces an integer or a real number. The arithmetic function f is defined as follows: f a , a , ..., a ) = f ( a ) ‚Š• f ( a ) ‚Š— ‚‹… ‚‹…‚‹…Î˜f ( a ) , ( 1 2 r 1 1 2 2 r r where ai ‚ˆˆ dom(Ai), A ‚ˆˆ Â¡ Â£ Â¢ Â¤ Â¤ Â• Â¦ Â¡ Â¡ Â£ Â¢ Â¤ Â¤ Â• Â¦ Â¡ Â† Â† Â† I i Ri T j i= 1 j= 1 and ‚Š•, ‚Š—, ‚€¦, Î˜ ‚ˆˆ {+, ‚ˆ’, Ã—, Ã·} . 17 J A A , i = 1, 2, ‚€¦, r , In the case where the value of any attribute, Ai, i = 1, 2, ‚€¦, r, of a tuple is unknown, the arithmetic function, f, produces an unknown value as its output. 4.3 The Substring Functions The substring functions extract a specific portion of a given attribute. Let the given attribute, A, be a string of s characters. For any a ‚ˆˆ dom(A), we use a[i] to denote the i-th character of a. The substring function, f, is defined as follows: f ( a) = a[ l] a[ l + 1]... a[ u] , where a ‚ˆˆ dom(A), A A Â¨ ï¿½ Â© ï¿½ï¿½ï¿½ï¿½ Â¨Â¨ ï¿½ Â© ï¿½ï¿½ï¿½ï¿½ Â¨ Â§ Â§ Â§ and 1 ‚‰¤ l ‚‰¤ u ‚‰¤ s . ‚ˆˆ I i= 1 J A , j= 1 T Ri j In the case where the value of an attribute, A, of a tuple is unknown, the substring function, f, produces an unknown value as its output. 4.4 The Discretization Functions The discretization functions discretize the domain of any numeric attribute into a finite number of intervals. Let f be the discretization function that creates r intervals. We use ui to denote the upper limit of the i-th interval, for i = 1, 2, ‚€¦, r ‚€“ 1. Then, f is defined as follows: Â£ Â†Â†Â† Â¡ Â† 1 2 . r ‚ˆ’1 if a ‚‰¤ u if u 18  a ‚‰¤ u Â† Â† . f ( a) = . , Â† Â¢ Â† r 1 if u r‚ˆ’2 1 if a  u  a ‚‰¤ u r‚ˆ’1 2 r‚ˆ’1 where a ‚ˆˆ dom(A), A ‚ˆˆ A A . ï¿½Â© Â¨Â¨ Â¤ Â¤ I i= 1 Ri T j j= 1 Â• Â§ Â¦ Â¨Â¨Â© ï¿½ Â• Â• Â§ Â¦ Â• Â¤ In the case where the value of an attribute, A, of a tuple is unknown, the discretization function, f, produces an unknown value as its output. The boundaries of the intervals can be specified by users or determined automatically by using various algorithms (e.g., [8]). One of the commonly used algorithms involves discretizing the attribute into equal intervals. Another popular algorithm involves discretizing the attribute into intervals in such a way that the number of tuples in each interval is the same. As a result, each tuple has an equal probability of lying in any interval. J 4.5 The Transformation Functions Defined over the Bank-account Database In this section, we describe how we can construct a transformed relation, R (T_ACCT_TYPE, T_AMOUNT, T_NATIONALITY, ‚€¦), using the transformation functions. To obtain the transformed relation, we (including a domain expert from the bank) have defined 102 transformation functions in total. From the 102 transformation functions, in this section, we present three of them as an illustration. Consider the attribute ACCOUNT[ACCT_ID]. The first digit of this attribute denotes the type of account. Let us suppose that it is a personal account if this digit is 1 and that it is a corporate account if this digit is 2. There exists a transformation function, f1, defined as f1(s) = first_digit_of(s) , where first_digit_of(s) returns the first digit of string s. The transformed attribute T_ACCT_TYPE is produced by applying f1(ACCOUNT[ACCT_ID]) to every tuple in ACCOUNT, which is an example of the substring functions that are defined in Section 4.3. To compute the average amount in the customers‚€™ accounts, we make use of another transformation function, f2, which is defined as follows: f 2 ( id) = | Ïƒ 19 t[ AMOUNT] t‚ˆˆÏƒ CUST_ID = id ( ACCOUNT) CUST_ID = id Â† ( ACCOUNT) | , where Ïƒ denotes the SELECT operation from relational algebra and |S| denotes the cardinality of set S. The function, f2, is an example of the arithmetic functions that are defined in Section 4.2. The transformed attribute, T_AMOUNT, is produced by applying the function f2(CUSTOMER[CUST_ID]) to every tuple in CUSTOMER. The nationality of the customers can be grouped into different geographical regions for the purpose of discovering more meaningful rules. Such a grouping is performed by a transformation function, f3, which is defined as Â£ Asian if n = Chinese or Japanese or ... or Korean f ( n) = European else if n = UK or French or ... or German . 3 Â† Â¢ Â¡ Â† North American else if n = 20 US or Canadian This function, f3, is an example of the logical functions that are defined in Section 4.1. The transformed attribute, T_NATIONALITY, is produced by applying the function f3(CUSTOMER[NATIONALITY]) to every tuple in CUSTOMER. By applying the transformation functions to the bank-account database, we have obtained the required transformed relation. There are 102 attributes in the transformed relation. Among the 102 transformed attributes, 6 are categorical and 96 are quantitative. Instead of performing data mining on the original data, we discover interesting associations from the transformed data. 5 FARM II for Mining Fuzzy Association Rules In this section, we describe a novel algorithm, called FARM II, which makes use of linguistic terms to represent the regularities and exceptions that are discovered in databases. Furthermore, FARM II employs an objective interestingness measure to identify the interesting associations among the attributes of the database. The definition of the linguistic variables and the linguistic terms is presented in Section 5.1. In Section 5.2, we describe how the interesting associations can be identified. The formation of the fuzzy association rules to represent the interesting associations is described in Section 5.3. In this same section, a confidence measure is defined to provide a means for representing the uncertainty that is associated with the fuzzy association rules. In Section 5.4, we provide the details of FARM II. In Section 5.5, we describe how the previously unknown values can be inferred using the fuzzy association rules. "},{"aspect":"problemdef","tweet":" The problem of mining association rules was introduced to reveal interesting patterns in data [1]. The mining of association rules was originally defined for transactional data. This was later extended to also handle relational data containing categorical and quantitative data [23]. In its most general form, an association rule is defined for the attributes of a database relation, T. It is an implication of the form X Â† Y, where X and Y are conjunctions of certain conditions. A condition is either Ai = ai, where ai is a value in the domain of the attribute Ai if Ai is categorical, or ai ‚ˆˆ [li, ui], where li and ui are bounding values in the domain of the attribute Ai if Ai is quantitative. The association rule X Â† Y holds in T with a certain support, which is defined as the percentage of tuples that have the characteristics satisfying X and Y, and a certain confidence, which is defined as the percentage of tuples that have the characteristics satisfying Y given that they also satisfy X. An associative relationship is usually considered to be interesting if its support and confidence values are greater than some user-specified minimum [1], [2], [18], [21], [23]. "},{"aspect":"solution","tweet":""},{"aspect":"expcomparison","tweet":""}]}