{"user_name":"steveholland1","user_timeline":[{"aspect":"self_created","tweet":"\"All in all this was a pretty shameful day for Washington,\" Obama says","date":"Wed Apr 17 15:50:49 MDT 2013"},{"aspect":"self_created","tweet":"In Rose Garden, Obama says there were no coherent arguments for opposing background checks for gun buyers, it came down to politics","date":"Wed Apr 17 15:47:38 MDT 2013"},{"aspect":"self_created","tweet":"RT @MajorCBS: At @whitehouse event for Wounded Warrior Project #SoldierRide, Obama says idea for ride began in a bar, where \"a lot of go ...","date":"Wed Apr 17 14:03:29 MDT 2013"},{"aspect":"self_created","tweet":"Obama is confident Boston bomber will be found, \"it has not even been 48 hours\" since bombings, says Carney.","date":"Wed Apr 17 10:42:31 MDT 2013"},{"aspect":"self_created","tweet":"A letter addressed to Pres Obama containing a suspicious substance was intercepted at a mail screening facility, Secret Service says","date":"Wed Apr 17 09:25:57 MDT 2013"},{"aspect":"self_created","tweet":"DHS' Napolitano says there is no indication to suggest the Boston bombings are indicative of a broader plot","date":"Tue Apr 16 12:54:06 MDT 2013"},{"aspect":"self_created","tweet":"\"We don't have a sense of motive yet,\" says Obama","date":"Tue Apr 16 09:39:32 MDT 2013"},{"aspect":"self_created","tweet":"In just a few minutes Pres Obama will update us on what he knows about the Boston bombing. He was briefed this morn by security aides.","date":"Tue Apr 16 09:23:26 MDT 2013"},{"aspect":"self_created","tweet":"They just lowered the flag to half staff at the White House in honor of the Boston victims","date":"Tue Apr 16 08:52:08 MDT 2013"},{"aspect":"self_created","tweet":"RT @streitfeldcnn: CNN: At least 110 people have been treated at area hospitals after Boston bombings, including 6 in critical condition ...","date":"Mon Apr 15 17:00:56 MDT 2013"},{"aspect":"self_created","tweet":"WH official says Boston explosion being approached as an \"act of terror.\"","date":"Mon Apr 15 16:31:16 MDT 2013"},{"aspect":"self_created","tweet":"\"We will find out who did this,\" says Obama.","date":"Mon Apr 15 16:13:12 MDT 2013"},{"aspect":"self_created","tweet":"\"All Americans stand with the people of Boston,\" Obama says.","date":"Mon Apr 15 16:12:10 MDT 2013"},{"aspect":"self_created","tweet":"Obama to deliver statement on Boston incident at 6:10 pm EDT in the White House briefing room","date":"Mon Apr 15 15:45:04 MDT 2013"},{"aspect":"self_created","tweet":"Obama briefed by FBI Director Mueller and Homeland Security Sec Napolitano about the Boston blasts-WH official.","date":"Mon Apr 15 15:28:59 MDT 2013"},{"aspect":"self_created","tweet":"Obama called the Boston mayor and Mass governor to offer US aid, express concern for injured, WH says","date":"Mon Apr 15 14:29:07 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama has been notified of the \"incident in Boston,\" orders help for Boston authorities to investigate--WH official.","date":"Mon Apr 15 13:58:38 MDT 2013"},{"aspect":"self_created","tweet":"@senjohnmccain just issued statement saying if North Korea launches a missile \"we should shoot it down once it leaves NK airspace.\"","date":"Mon Apr 15 12:21:17 MDT 2013"},{"aspect":"self_created","tweet":"They hand Obama an Bama jersey and Coach Nick Saban tells him they'll meet later to decide how much playing time he'll get next season.","date":"Mon Apr 15 12:11:59 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama tells BCS champs Alabama that they are at the WH so often he thought about having cots set up for them but they're too big.","date":"Mon Apr 15 12:06:20 MDT 2013"},{"aspect":"self_created","tweet":"RT @AntDeRosa: Full story from @ReutersSports: Australia's Scott wins Masters in playoff http://t.co/nscPGyJn9B","date":"Sun Apr 14 18:06:30 MDT 2013"},{"aspect":"self_created","tweet":"RT @DanHicksNBC: Some purists may not like it but @TigerWoods is well within rules here by choosing to play. Onus for different outcome  ...","date":"Sat Apr 13 11:19:26 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama's dinner with Repub senators tonight covered budget, guns and immigration over salad, steak and vegetables, we're told.","date":"Wed Apr 10 19:36:58 MDT 2013"},{"aspect":"self_created","tweet":"WH budget advisers tell reporters Obama would only use chained CPI to reduce entitlement spending if it is part of a broad package","date":"Wed Apr 10 11:26:49 MDT 2013"},{"aspect":"self_created","tweet":"Only in Washington: Crowd chanting \"no chained CPI\" outside White House NW gate","date":"Tue Apr 09 11:25:50 MDT 2013"},{"aspect":"self_created","tweet":"RT @juliemason: My show is moving to 3 - 6 p.m. ET next week, w/a replay at 9 p.m. and always OnDemand. Don't miss a swirl in the CessPo ...","date":"Tue Apr 09 10:28:28 MDT 2013"},{"aspect":"self_created","tweet":"RNC Chair Priebus, previewing Obama's Wednesday night dinner with Repub senators, urges them to eat in to save money, offers to buy pizza","date":"Tue Apr 09 08:07:38 MDT 2013"},{"aspect":"self_created","tweet":"Area spokesman says off the record, no comment cc @Brendan_Buck","date":"Mon Apr 08 12:58:42 MDT 2013"},{"aspect":"self_created","tweet":"RT @dougferguson405: Condi looking rather dapper in green.  http://t.co/QV8cqoc5P2","date":"Sun Apr 07 14:41:21 MDT 2013"},{"aspect":"self_created","tweet":"Jay said Obama admires the job Kamala Harris has done on the mortgage settlement issue","date":"Fri Apr 05 12:10:15 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama called Calif AG Kamala Harris last night to apologize for calling her the best-looking AG etc per Carney","date":"Fri Apr 05 12:05:03 MDT 2013"},{"aspect":"self_created","tweet":"WH's Carney predicts Obama's budget to be revealed next week will be so detailed \"it will blow your mind.\"","date":"Fri Apr 05 11:53:22 MDT 2013"},{"aspect":"self_created","tweet":"WH's Carney tells briefing the US would not be surprised if NKorea were to launch a new missile test.","date":"Fri Apr 05 11:45:38 MDT 2013"},{"aspect":"self_created","tweet":"Obama on Roger Ebert: \"When he didn't like a film, he was honest; when he did, he was effusive\"","date":"Thu Apr 04 14:49:04 MDT 2013"},{"aspect":"self_created","tweet":"WH adviser Dan Pfeiffer tells Politico event after Bob Woodward flareup he, Jay Carney and Gene Sperling had Woodward to lunch at WH mess","date":"Wed Apr 03 06:52:56 MDT 2013"},{"aspect":"self_created","tweet":"\"Does anybody have a score on the Red Sox and Yankees?\" - Jay Carney, about a half hour into his briefing","date":"Mon Apr 01 11:24:42 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama is somewhere in this basketball crowd: http://t.co/21UYoYtbry","date":"Sat Mar 30 15:32:51 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama, after 9 holes of golf with his pals at Andrews AFB, now at Marquette-Syracuse game at Verizon Center","date":"Sat Mar 30 14:46:21 MDT 2013"},{"aspect":"self_created","tweet":"White House on NKorea \"state of war\" vow: http://t.co/yMT5adSrNH","date":"Sat Mar 30 09:53:36 MDT 2013"},{"aspect":"self_created","tweet":"RT @jmartpolitico: Enjoying how Dr Ben Carson is referred to at all times as Dr Ben Carson","date":"Fri Mar 29 17:02:47 MDT 2013"},{"aspect":"self_created","tweet":"WH's Earnest in today's AF1 gaggle said US has capability and willingness to protect Asian allies in face of NKorean threats","date":"Fri Mar 29 11:41:28 MDT 2013"},{"aspect":"self_created","tweet":"Obama's budget will be released on April 10, Josh Earnest announces","date":"Thu Mar 28 10:51:46 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama makes impassioned pleas for gun control measures, \"shame on us if we've forgotten\" Newtown.","date":"Thu Mar 28 10:07:34 MDT 2013"},{"aspect":"self_created","tweet":"During his visit to Costa Rica, President Obama will hold talks with CR President Chinchilla","date":"Wed Mar 27 16:13:12 MDT 2013"},{"aspect":"self_created","tweet":"@stewsays RT @jeffzeleny: Who is more disappointed by @ashleyjudd decision not to run for Senate: Mitch McConnell or the press?","date":"Wed Mar 27 15:18:34 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama's next foreign trip: To Mexico and Costa Rica May 2-4, WH advises","date":"Wed Mar 27 15:10:22 MDT 2013"},{"aspect":"self_created","tweet":"RT @jeffmason1: Obama, asked how he is feeling about his bracket for men's college basketball, says in Oval Office: \"busted!\"","date":"Wed Mar 27 13:25:40 MDT 2013"},{"aspect":"self_created","tweet":"RT @judykeen: Maybe I'm old-fashioned, but I don't think reporters should proclaim their personal views on political issues.","date":"Wed Mar 27 12:17:25 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama to name Julia Pierson to head Secret Service, we hear. She will be first female director.","date":"Tue Mar 26 12:56:29 MDT 2013"},{"aspect":"self_created","tweet":"RT @sppeoples: MT @jmartpolitico: Can't keep him down: @Ron_Kaufman is back, signing w McKenna Long as Wise Man  http://t.co/JGmDWiPXVX","date":"Tue Mar 26 11:56:28 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama just landed at Andrews AFB to return home from Middle East trip","date":"Sat Mar 23 18:10:56 MDT 2013"},{"aspect":"self_created","tweet":"RT @Rick_Gorka: @steveholland1 I learned most of my history from Indiana Jones","date":"Sat Mar 23 06:07:32 MDT 2013"},{"aspect":"self_created","tweet":"@malachybrowne yes","date":"Sat Mar 23 04:38:35 MDT 2013"},{"aspect":"self_created","tweet":"As Pres Obama proceeded with his tour of Petra, WH press pool carted away from the site aboard horse-drawn carriages","date":"Sat Mar 23 04:06:48 MDT 2013"},{"aspect":"self_created","tweet":"After hour-long Marine One flight Pres Obama about to start tour of Petra","date":"Sat Mar 23 02:30:46 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama headed this morn to Jordan's fabled Petra, which according to Hollywood was discovered by Indiana Jones in the 1930s","date":"Sat Mar 23 00:30:35 MDT 2013"},{"aspect":"self_created","tweet":"After an arrival ceremony featuring camels, Obama and Jordan's King Abdullah are now holding talks. Joint newser later.","date":"Fri Mar 22 09:49:32 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama has now landed in Amman for talks with Jordan King Abdullah","date":"Fri Mar 22 08:53:47 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama and Israeli PM Netanyahu having a final meeting at Tel Aviv airport before Obama flies to Amman.","date":"Fri Mar 22 07:49:16 MDT 2013"},{"aspect":"self_created","tweet":"In Bethlehem, Pres Obama entered the Church of the Nativity through the Door of Humility, our @mattspetalnick reports","date":"Fri Mar 22 06:09:20 MDT 2013"},{"aspect":"self_created","tweet":"RT @DanWilliams: Obama tours symbolic Israeli sites on last day of visit http://t.co/sfWpRmqRg6 via @MattSpetalnick","date":"Fri Mar 22 03:15:15 MDT 2013"},{"aspect":"self_created","tweet":"In his speech Obama says there is still time for diplomatic solution with Iran \"but Iran must know this time is not unlimited.\"","date":"Thu Mar 21 08:58:58 MDT 2013"},{"aspect":"self_created","tweet":"Obama in Jerusalem: \"Any drama between me and my friend Bibi over the years was just a plot to create material for Eretz Nehederet.\"","date":"Thu Mar 21 08:41:20 MDT 2013"},{"aspect":"self_created","tweet":"RT @DanWilliams: Obama urges Palestinians to return to peace talks http://t.co/rh5NoHeU83 via @SteveHolland1","date":"Thu Mar 21 08:36:53 MDT 2013"},{"aspect":"self_created","tweet":"WH press pool already been through two security sweeps at King David Hotel and it's just now 830 am","date":"Thu Mar 21 00:32:35 MDT 2013"},{"aspect":"self_created","tweet":"RT @Reuters: Two rockets from Gaza slam into southern Israel during Obama  visit: police #breaking","date":"Thu Mar 21 00:21:18 MDT 2013"},{"aspect":"self_created","tweet":"Obama tells newser it would be a \"game-changer\" if it turns out Syria has used chemical weapons and he orders probe into charges","date":"Wed Mar 20 12:49:03 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says in Jerusalem there is still time for Iran nuclear issue to be dealt with through diplomacy, but all options on table.","date":"Wed Mar 20 12:44:38 MDT 2013"},{"aspect":"self_created","tweet":"At joint newser in Jerusalem, PM Netanyahu makes clear to Pres Obama that Israel reserves right to defend itself against Iran","date":"Wed Mar 20 12:38:54 MDT 2013"},{"aspect":"self_created","tweet":"On the Tel Aviv tarmac, first Obama takes off his suit jacket and slings it over his shoulder, then Netanyahu does the same","date":"Wed Mar 20 05:24:29 MDT 2013"},{"aspect":"self_created","tweet":"In arrival marks, Obama notes Israel's hold on its land goes back 3,000 years and that founding of Israeli state was a rebirth","date":"Wed Mar 20 05:02:01 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama just landed in Tel Aviv to begin trip this week to Israel, West Bank and Jordan. AF1 flew him overnight","date":"Wed Mar 20 04:26:49 MDT 2013"},{"aspect":"self_created","tweet":"RT @dcharlesReuters: I guess sports stars announce relationships on Facebook http://t.co/6F9Z0mt6FN - at least Tiger and Lindsey do","date":"Mon Mar 18 11:39:53 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama tomorrow will nominate Asst Atty General Tom Perez as his next Labor Secretary, we're told","date":"Sun Mar 17 21:27:37 MDT 2013"},{"aspect":"self_created","tweet":"As CPAC meets, our poll on 2016ers: http://t.co/7RA52NAJJ5","date":"Fri Mar 15 15:10:54 MDT 2013"},{"aspect":"self_created","tweet":"Thus begins St. Patrick's Day weekend, when WH reporters try to figure out how to pronounce Taoiseach, Gaelic for Irish prime minister.","date":"Fri Mar 15 14:52:17 MDT 2013"},{"aspect":"self_created","tweet":"Great report by @plantecbs on history of WH news conference, including 1980s cameo:    \n  http://t.co/2lmVNo2qxS","date":"Fri Mar 15 10:55:55 MDT 2013"},{"aspect":"self_created","tweet":"\"Our red line is we will not allow Iran to gain nuclear weapons,\" WH's Ben Rhodes says ahead of Obama's Israel trip next week.","date":"Thu Mar 14 14:30:43 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama spoke today to China's president, Jay Carney reports","date":"Thu Mar 14 11:35:14 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama said tonight his \"charm offensive\" is actually a bid to \"break through some of the gobbledygook of our politics here.\"","date":"Wed Mar 13 18:24:46 MDT 2013"},{"aspect":"self_created","tweet":"RT @AshleyRParker: Four Best POPE Facts: 1) Likes to tango/had a girlfriend 2) Just one lung! 3) NOT a former Hitler Youth 4) Francis.","date":"Wed Mar 13 16:19:53 MDT 2013"},{"aspect":"self_created","tweet":"\"Be careful of making too much of any individual poll,\" Carney says of Obama's drop in approval.","date":"Wed Mar 13 11:21:24 MDT 2013"},{"aspect":"self_created","tweet":"WH's Carney urges reporters to tune into Gene Sperling \"Ask me Anything\" session on Reddit, \"you will not regret it.\"","date":"Wed Mar 13 10:51:04 MDT 2013"},{"aspect":"self_created","tweet":"\"I told the president on Friday I hope he'll invite all of our members down for these [small-group] dinners,\" said Mitch McConnell","date":"Tue Mar 12 13:51:29 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama just wrapping up his first visit to Capitol Hill this week, per our @robertarampton","date":"Tue Mar 12 13:06:27 MDT 2013"},{"aspect":"self_created","tweet":"WH's Carney says Obama budget will come out \"probably the week of April 8\"","date":"Tue Mar 12 11:11:45 MDT 2013"},{"aspect":"self_created","tweet":"On  Tuesday, Pres Obama will welcome His Majesty Sultan Haji Hassanal Bolkiah of Brunei Darussalam to the White House.","date":"Mon Mar 11 16:26:25 MDT 2013"},{"aspect":"self_created","tweet":"No just leave it as is RT @realDonaldTrump: Re my hair-Should I change it? What do you think?","date":"Sun Mar 10 20:55:49 MDT 2013"},{"aspect":"self_created","tweet":"Knows what a paczki is RT @petermaercbs: @jimacostacnn Proudest Michigander I know: @DonGonyea.","date":"Thu Mar 07 15:31:54 MST 2013"},{"aspect":"self_created","tweet":"Lunch for Obama, Ryan, Van Hollen was  Lentil Vegetable soup and Broiled Sea Bass served with a roasted vegetable Ragu.","date":"Thu Mar 07 13:22:58 MST 2013"},{"aspect":"self_created","tweet":"Senate Judiciary Committee voted today,  not familiar with details","date":"Thu Mar 07 12:04:22 MST 2013"},{"aspect":"self_created","tweet":"\"As of now my understanding is that the Easter Egg Roll will go forward,\" says Carney re sequester impact on WH","date":"Thu Mar 07 11:42:06 MST 2013"},{"aspect":"self_created","tweet":"\"I had a nice conversation with Chairman (Paul) Ryan just before coming out,\" WH's Carney tells reporters at daily briefing.","date":"Thu Mar 07 11:28:07 MST 2013"},{"aspect":"self_created","tweet":"RT @PhilipRucker: Obama picked up the $$$ tab at dinner tonight, per White House official.","date":"Wed Mar 06 19:08:37 MST 2013"},{"aspect":"self_created","tweet":"WH reports Obama asked for chance to speak to Dem and Repub caucuses about legislative priorities. Separate meetings planned next week","date":"Wed Mar 06 11:22:47 MST 2013"},{"aspect":"self_created","tweet":"INBOX: U.S. Capitol to Continue Welcoming Visitors for Public Tours","date":"Wed Mar 06 11:15:56 MST 2013"},{"aspect":"self_created","tweet":"Obama's dinner with Republican senators tonight is set for the Jefferson Hotel in downtown DC","date":"Wed Mar 06 09:14:18 MST 2013"},{"aspect":"self_created","tweet":"Still panic RT @capitalweather: Unlikely snow will reach forecast amounts in urban core of DC, Alexandria, Arlington: http://t.co/Cui9SrRoUt","date":"Wed Mar 06 08:34:11 MST 2013"},{"aspect":"self_created","tweet":"Go Zeke! RT @JNSmall: Welcome to TIME @ZekeJMiller I look forward to working with you.","date":"Wed Mar 06 08:08:22 MST 2013"},{"aspect":"self_created","tweet":"\"The president has asked for a meeting with the House GOP and we expect to host him sometime next week,\" said a House GOP aide.","date":"Wed Mar 06 07:35:18 MST 2013"},{"aspect":"self_created","tweet":"Paging Lee Greenwood RT @OKnox: Oh, wow, former NSC spox @TVietor08's profile picture...","date":"Mon Mar 04 18:51:38 MST 2013"},{"aspect":"self_created","tweet":"nope RT @pbsgwen: Does anyone ever rule out running for something when they have a book to sell?","date":"Mon Mar 04 11:58:39 MST 2013"},{"aspect":"self_created","tweet":"Pres Obama's pick for Energy secretary Ernie Moniz has most Einsteinian hair of Obama admin: http://t.co/AbduHhiZSu","date":"Mon Mar 04 08:30:55 MST 2013"},{"aspect":"self_created","tweet":"RT @jeffmason1: Am reporting with @steveholland1 that Obama to announce his choice of Walmart Foundation head Sylvia Mathews Burwell as  ...","date":"Sun Mar 03 13:45:03 MST 2013"},{"aspect":"self_created","tweet":"WH on Rodman: Instead of spending money on staging sporting events, North Korea should focus on the well-being of its own people","date":"Sun Mar 03 12:49:44 MST 2013"},{"aspect":"self_created","tweet":"Romney on Fox Sunday: \"I lost my election because of my campaign, not because of what anyone else did.\" Won't run again.","date":"Sun Mar 03 08:38:19 MST 2013"},{"aspect":"self_created","tweet":"RT @AntDeRosa: The most shared post on Gawker at the moment is a Taylor Swift song remixed with a goat yelling like a human http://t.co/ ...","date":"Sat Mar 02 11:47:14 MST 2013"},{"aspect":"self_created","tweet":"RT @jamiedupree: The Office of English Language Acquisition has $37 million sequestered","date":"Fri Mar 01 19:33:05 MST 2013"},{"aspect":"self_created","tweet":"Pres Obama has now signed the sequestration order putting in place $85 bil in automatic spending cuts.","date":"Fri Mar 01 18:36:35 MST 2013"},{"aspect":"self_created","tweet":"\"If Mitch McConnell has to catch a plane, I can't have the Secret Service block the doorway,\" says Obama","date":"Fri Mar 01 09:59:14 MST 2013"},{"aspect":"self_created","tweet":"Obama tells newser he thinks it'll take two weeks or two months for Republicans to come back to bargaining table over budget cuts","date":"Fri Mar 01 09:54:16 MST 2013"},{"aspect":"self_created","tweet":"Obama to come to briefing room in 15 mins re budget talks to make statement","date":"Fri Mar 01 09:20:09 MST 2013"},{"aspect":"self_created","tweet":"WH talks with congressional leaders now over. No breakthrough","date":"Fri Mar 01 09:16:54 MST 2013"},{"aspect":"self_created","tweet":"Obama and the congressional leaders have begun their WH sequester talks. We don't anticipate a breakthrough.","date":"Fri Mar 01 08:25:06 MST 2013"},{"aspect":"self_created","tweet":"RT @ReutersPolitics: Cosmopolitan Kerry courts Europe, his old stomping ground http://t.co/cgio6BBKDp","date":"Fri Mar 01 06:48:16 MST 2013"},{"aspect":"self_created","tweet":"Sen Repub leader McConnell says ahead of WH sequester meeting there will be be no last second deal to raise taxes","date":"Fri Mar 01 06:13:27 MST 2013"},{"aspect":"self_created","tweet":"Carney says re Sperling-Woodward email exchange, can't come away with impression that \"Gene was threatening anybody.\"","date":"Thu Feb 28 11:22:42 MST 2013"},{"aspect":"self_created","tweet":"WH's Carney in heated exchange with reporters over whether administration hyping sequester impact","date":"Thu Feb 28 11:18:12 MST 2013"},{"aspect":"self_created","tweet":"Jack Lew has been sworn in as treasury secretary in an Oval Office ceremony featuring Obama and Biden","date":"Thu Feb 28 10:50:12 MST 2013"},{"aspect":"self_created","tweet":"Obama to honor Alabama Crimson Tide football champs to White House March 6 cc @cparsons @alanblinder","date":"Thu Feb 28 09:01:10 MST 2013"},{"aspect":"self_created","tweet":"Mayor Bloomberg on sequester battle: \"I find it fascinating that they're trying to blame each other for it. They all voted for it.\"","date":"Wed Feb 27 12:30:35 MST 2013"},{"aspect":"self_created","tweet":"We hear Obama to meet Friday at WH with congressional leaders McConnell, Boehner, Reid and Pelosi to discuss the budget cuts.","date":"Wed Feb 27 07:41:35 MST 2013"},{"aspect":"self_created","tweet":"After their WH meeting, Senators McCain and Graham returned to the Capitol in time to vote no against Chuck Hagel","date":"Tue Feb 26 15:01:19 MST 2013"},{"aspect":"self_created","tweet":"Senators McCain, Graham now at White House for their meeting with Pres Obama on immigration","date":"Tue Feb 26 13:59:20 MST 2013"},{"aspect":"self_created","tweet":"\"I'm not interested in spin, I'm not interested in playing a blame game,\" says Obama.","date":"Tue Feb 26 11:42:48 MST 2013"},{"aspect":"self_created","tweet":"Obama takes dim view of offer by Republicans to give him flexibility on where to make $85 bil in cuts-\"No smart way to do that.\"","date":"Tue Feb 26 11:40:55 MST 2013"},{"aspect":"self_created","tweet":"\"Now that's a pretty bad name, sequester,\" Obama tells shipyard workers in Newport News VA","date":"Tue Feb 26 11:27:16 MST 2013"},{"aspect":"self_created","tweet":"VP Joe Biden announces his new national security adviser will be State Dept's Jake Sullivan. Replaces Tony Blinken who moving to WH","date":"Tue Feb 26 11:03:53 MST 2013"},{"aspect":"self_created","tweet":"+ 1 MT @OKnox: Best of luck to my former White House basement-mate @ZekeJMiller on his next nominally prestigious &  subterranean venture\"","date":"Mon Feb 25 13:20:08 MST 2013"},{"aspect":"self_created","tweet":"Obama quips to govs their WH dinner was low-key but \"I can't speak to Joe's after-party at the Naval Observatory. I heard that was wild.\"","date":"Mon Feb 25 09:29:54 MST 2013"},{"aspect":"self_created","tweet":"\"The American people are tired of being tired,\" VP Biden tells governors","date":"Mon Feb 25 09:22:25 MST 2013"},{"aspect":"self_created","tweet":"@kasie when should we expect a tweet from @pkcapitol","date":"Fri Feb 22 18:45:41 MST 2013"},{"aspect":"self_created","tweet":"RT @jimacostacnn: Nixon Foundation: Rex Scouten, longtime White House Chief Usher who  served ten First Families by end of his career pa ...","date":"Thu Feb 21 19:10:22 MST 2013"},{"aspect":"self_created","tweet":"Pres Obama called Speaker Boehner and Senate Republican leader McConnell to discuss looming sequestration, per WH's Carney","date":"Thu Feb 21 11:41:05 MST 2013"},{"aspect":"self_created","tweet":"Front-page headline in today's Wash Post: \"China has hacked most of Washington, experts say\"","date":"Thu Feb 21 06:27:38 MST 2013"},{"aspect":"self_created","tweet":"Mitt Romney to address CPAC in DC area next month, says he looks forward to saying thanks to those who backed his campaign","date":"Wed Feb 20 13:11:23 MST 2013"},{"aspect":"self_created","tweet":"Wh's Carney facing questions at briefing as to why Biden keeps urging people to buy shotguns","date":"Wed Feb 20 11:27:33 MST 2013"},{"aspect":"self_created","tweet":"WH's Carney begins briefing with riff on sequester, saying if cuts happen it's because \"Republicans made a choice for that to happen.\"","date":"Wed Feb 20 10:52:24 MST 2013"},{"aspect":"self_created","tweet":"RT @edhenryTV: Thrilled to reveal @ConanObrien has agreed to headline White House Correspondents Association's scholarship dinner April  ...","date":"Wed Feb 20 07:10:08 MST 2013"},{"aspect":"self_created","tweet":"\"It was an invitation you certainly don't turn down,\" Tiger tells newser in Ariz  of his round with Pres Obama","date":"Tue Feb 19 21:17:02 MST 2013"},{"aspect":"self_created","tweet":"\"I have two shotguns. They are locked in a case,\" says VP Joe Biden at gun control event","date":"Tue Feb 19 13:58:45 MST 2013"},{"aspect":"self_created","tweet":"RT @mikememoli: Biden recommends use of double-barrel shotgun to deter would-be criminals, rather than assault weapon","date":"Tue Feb 19 13:51:05 MST 2013"},{"aspect":"self_created","tweet":"Pres Obama's motorcade just pulled out of the Floridian to head back to DC","date":"Mon Feb 18 15:02:20 MST 2013"},{"aspect":"self_created","tweet":"Obama's last round of golf before returning to DC includes usual suspects Ron Kirk, Eric Whitaker and Marvin Nicholson, we're told.","date":"Mon Feb 18 11:48:49 MST 2013"},{"aspect":"self_created","tweet":"Happy Birthday @jameshohmann and George Washington","date":"Mon Feb 18 08:11:06 MST 2013"},{"aspect":"self_created","tweet":"\"It's good to see you play well again,\" Obama tells Tiger: http://t.co/HrCtjS0b","date":"Sun Feb 17 15:50:50 MST 2013"},{"aspect":"self_created","tweet":"RT @Reuters: In a first, Obama plays golf with Tiger Woods http://t.co/XkeDBtf3","date":"Sun Feb 17 12:33:34 MST 2013"},{"aspect":"self_created","tweet":"White House just now confirming that Pres Obama playing golf with Tiger Woods in Florida today","date":"Sun Feb 17 11:45:28 MST 2013"},{"aspect":"self_created","tweet":"We would not be able to cover Obama's FL golf outing without @timrosaforte. Thanks Tim","date":"Sun Feb 17 09:59:07 MST 2013"},{"aspect":"self_created","tweet":"RT @TimRosaforte: The President is arriving at The Floridian range. Awaiting is Tiger Woods and club owner Jim Crane. Historic day in go ...","date":"Sun Feb 17 09:56:40 MST 2013"},{"aspect":"self_created","tweet":"Obama also played golf with US Trade Rep Ron Kirk, Dr. Eric Whitaker and Tony Chase","date":"Sat Feb 16 15:06:26 MST 2013"},{"aspect":"self_created","tweet":"Pres Obama played a few instructional holes of golf at Floridian resort today with swing coach Butch Harmon, we're told","date":"Sat Feb 16 15:05:40 MST 2013"},{"aspect":"self_created","tweet":"@jonward11 I'll take a Large cc @OKnox @samyoungman","date":"Fri Feb 15 19:10:49 MST 2013"},{"aspect":"self_created","tweet":"Pres Obama has just landed in Palm Beach FL area for buddies golf weekend","date":"Fri Feb 15 18:29:26 MST 2013"},{"aspect":"self_created","tweet":"Chicago Mayor Rahm Emanuel is on hand to greet Pres Obama on arrival","date":"Fri Feb 15 12:34:36 MST 2013"},{"aspect":"self_created","tweet":"Hillary Clinton is the early favorite for the 2016 presidential primary in New Hamp, WMUR Granite State poll says","date":"Thu Feb 14 17:03:44 MST 2013"},{"aspect":"self_created","tweet":"Pres Obama says he loves Asheville NC for two reasons: \"No. 1 is the people and no. 2 is 12 Bones\" barbecue joint","date":"Wed Feb 13 10:17:01 MST 2013"},{"aspect":"self_created","tweet":"\"My mouth got dry and I had to get some water,\" Marco Rubio tells Fox of televised water bottle moment last night.","date":"Wed Feb 13 08:44:02 MST 2013"},{"aspect":"self_created","tweet":"@jeffeller Banana Joe is an affenpinscher","date":"Tue Feb 12 21:01:16 MST 2013"},{"aspect":"self_created","tweet":"Forget SOTU. A dog named Banana Joe has won best in show at New York's Westminster Dog Show","date":"Tue Feb 12 20:58:34 MST 2013"},{"aspect":"self_created","tweet":"@BenFellerNY @mattspetalnick Did this happen? \"Our goal is to make this new kind of ethanol practical and competitive within six years.\"","date":"Tue Feb 12 15:00:53 MST 2013"},{"aspect":"self_created","tweet":"RT @romenesko: Former New York Times staffer Jim Roberts is named Reuters digital executive editor. http://t.co/y9uUbVi7","date":"Tue Feb 12 12:01:58 MST 2013"},{"aspect":"self_created","tweet":"Pres Obama to announce tonight big drawdown of US troops in Afghan over next year--34,000 of the 66,000 there now, we're told","date":"Tue Feb 12 07:08:17 MST 2013"},{"aspect":"self_created","tweet":"RT @Reuters: United Nations security council diplomat says there has been a nuclear test in North Korea #BREAKING","date":"Mon Feb 11 21:00:36 MST 2013"},{"aspect":"self_created","tweet":"RT @SaraMurray: Today's #Hagel recap: Inhofe threatening a filibuster. SASC vote Tues. GOP walkout idea fizzles. Senate vote Weds/Thurs. ...","date":"Mon Feb 11 15:22:12 MST 2013"},{"aspect":"self_created","tweet":"Emotional Medal of Honor recipient Clint Romesha makes statement to reporters outside White House: http://t.co/Njvv6GWM","date":"Mon Feb 11 12:41:53 MST 2013"},{"aspect":"self_created","tweet":"@senjohnmccain in statement calls for committee vote on Hagel nomination, says he won't take part in any walkout","date":"Mon Feb 11 11:26:07 MST 2013"},{"aspect":"self_created","tweet":"\"We believe firmly that Sen. Hagel will be confirmed as the next secretary of defense,\" says Carney","date":"Mon Feb 11 11:09:31 MST 2013"},{"aspect":"self_created","tweet":"Pres Obama is not open to raising the eligibility age for Medicare, WH's Carney says","date":"Mon Feb 11 10:59:58 MST 2013"},{"aspect":"self_created","tweet":"@kasie holding out hope for Psy @evanvucci @samyoungman @juliehdavis @llerer","date":"Sun Feb 10 19:21:06 MST 2013"},{"aspect":"self_created","tweet":"RT @whpresscorps: VIDEO: @FoxNewsSunday's Power Player of the Week: @markknoller, \"Unofficial record-keeper of the presidency\" http://t. ...","date":"Sun Feb 10 15:21:49 MST 2013"},{"aspect":"self_created","tweet":"RT @malonebarry: Same Reuters photo - by @brian_photog - on front pages of NYT, WSJ, Washington Post and New York Post http://t.co/v87esGHm","date":"Sat Feb 09 11:36:30 MST 2013"},{"aspect":"self_created","tweet":"Condi Rice beans spectator at Pebble Beach Pro-Am golf tourney: http://t.co/OVoFjdlS","date":"Fri Feb 08 13:26:25 MST 2013"},{"aspect":"self_created","tweet":"In the Inbox: \"Statement by the president on the Lunar New Year,\" anwelcomes \"the Year of the Snake\"","date":"Fri Feb 08 11:35:54 MST 2013"},{"aspect":"self_created","tweet":"RT @petermaercbs: Asked if @TheDailyShow is place to discuss sensitive issues(drones), @PressSec says Obama interview was \"more substant ...","date":"Thu Feb 07 08:34:10 MST 2013"},{"aspect":"self_created","tweet":"Happy birthday @mandotar!","date":"Thu Feb 07 06:33:31 MST 2013"},{"aspect":"self_created","tweet":"RT @jeffmason1: Am reporting that OMB deputy director Jeffrey Zients is front runner for US Trade Representative, Penny Pritzker conside ...","date":"Wed Feb 06 16:47:36 MST 2013"},{"aspect":"self_created","tweet":"Good point re Kerry RT @tobyharnden: @steveholland1 You can take the man out of the Senate but you can't take the Senate out of the man","date":"Wed Feb 06 14:48:55 MST 2013"},{"aspect":"self_created","tweet":"Joe Biden's speech introducing Kerry for swearing in at State Dept ran about 7 mins, Kerry's acceptance speech ran 21","date":"Wed Feb 06 14:45:57 MST 2013"},{"aspect":"self_created","tweet":"RT @jeffmason1: Obama says, unlike his Interior secretary nominee, he would never think of wanting to hike in Antarctica","date":"Wed Feb 06 12:15:19 MST 2013"},{"aspect":"self_created","tweet":"No replica Oval Office is being built at OEOB and no plans for Obama to move out of the West Wing for construction, per Carney","date":"Wed Feb 06 10:35:17 MST 2013"},{"aspect":"self_created","tweet":"Pres Obama will not carry with him to Israel a new Middle East peace process proposal when he goes this spring, WH's Carney says","date":"Wed Feb 06 10:16:16 MST 2013"},{"aspect":"self_created","tweet":"Pres Obama as he heads out to Marine One on South Lawn: http://t.co/TrPIbaLT","date":"Wed Feb 06 08:27:57 MST 2013"},{"aspect":"self_created","tweet":"RT @samyoungman: Let's all make sure we get our terminology correct: That was not a \"presser.\" Pressers involve elected officials taking ...","date":"Tue Feb 05 11:44:48 MST 2013"},{"aspect":"self_created","tweet":"RT @streitfeldcnn: Despite sharp criticism, McCain would oppose filibuster on Hagel: http://t.co/2Dzwmi0h","date":"Mon Feb 04 16:04:06 MST 2013"},{"aspect":"self_created","tweet":"Pres Obama is to sit down with various CEOs at the WH tomorrow to talk up his immigration and deficit reduction proposals, we're told","date":"Mon Feb 04 15:38:04 MST 2013"},{"aspect":"self_created","tweet":"Pres Obama, in Minneapolis, says an assault weapons ban (which even some Dems oppose) \"deserves a vote in Congress\"","date":"Mon Feb 04 12:56:27 MST 2013"},{"aspect":"self_created","tweet":"RT @Dharapak: DHK, we can exceed your expectations. MT @kennerly: February 2: \"Join Kennerly's Twitter Feed Day.\" Help me reach 1,000 fo ...","date":"Sat Feb 02 15:10:00 MST 2013"},{"aspect":"self_created","tweet":"RT @DanWilliams: Biden raises possibility of direct U.S.-Iran talks http://t.co/4ZzuHH2M","date":"Sat Feb 02 09:53:50 MST 2013"},{"aspect":"self_created","tweet":"RT @PressSec: POTUS shoots clay targets on the range at Camp David on Aug. 4, 2012. http://t.co/3TqH6tzK","date":"Sat Feb 02 08:31:11 MST 2013"},{"aspect":"self_created","tweet":"RT @JimAngleFox: Barney never leaked to reporters but might have thought about leaking on one or two.","date":"Fri Feb 01 15:24:24 MST 2013"},{"aspect":"self_created","tweet":"GW Bush announces death of Scottish terrier Barney who greeted queens, heads of state and prime ministers and \"never jumped in their laps\"","date":"Fri Feb 01 15:14:39 MST 2013"},{"aspect":"self_created","tweet":"Secret Service Director Mark Sullivan plans to resign, we're told","date":"Fri Feb 01 14:46:50 MST 2013"},{"aspect":"self_created","tweet":"RT @robertarampton: Obama leaning toward choosing Gina McCarthy as next EPA administrator-sources via @jeffmason1 @reuters","date":"Fri Feb 01 13:49:28 MST 2013"},{"aspect":"self_created","tweet":"\"I think Sen Hagel answered the questions appropriately and did a fine job,\" says Carney, denouncing Republicans who pounced on Hagel","date":"Fri Feb 01 10:17:46 MST 2013"},{"aspect":"self_created","tweet":"\"The entire sequester was bad policy,\" says White House spokesman Jay Carney.","date":"Fri Feb 01 10:06:54 MST 2013"},{"aspect":"self_created","tweet":"Sandbags outside White House press briefing room in case it gets gnarly tonight: http://t.co/0kSRy8BE","date":"Wed Jan 30 14:14:19 MST 2013"},{"aspect":"self_created","tweet":"Hillary Clinton to NPR: \"I don't see myself getting back into politics.\"","date":"Tue Jan 29 17:53:14 MST 2013"},{"aspect":"self_created","tweet":"House Speaker Boehner's office responds to Obama speech urging him \"not to drag the debate to the left\" over immigration overhaul.","date":"Tue Jan 29 13:17:41 MST 2013"},{"aspect":"self_created","tweet":"Under Obama's principles, illegals must pass background checks, pay taxes and penalty and learn English before citizenship.","date":"Tue Jan 29 13:15:18 MST 2013"},{"aspect":"self_created","tweet":"Sen John McCain, part of gang of eight on immigration, has long history on this issue, it nearly knocked him out of 08 race","date":"Mon Jan 28 12:46:47 MST 2013"},{"aspect":"self_created","tweet":"Obama pestered by fly by @markfelsenthal http://t.co/y6N9SGSM","date":"Thu Jan 24 16:00:06 MST 2013"},{"aspect":"self_created","tweet":"RT @CarrieNBCNews: Latest from RNC Winter Meeting: Reporters get fresh wave of nostalgia as Newt holds gaggle, mentions Magna Carta with ...","date":"Thu Jan 24 11:56:46 MST 2013"},{"aspect":"self_created","tweet":"Congrats on your new gig @Sarah_Boxer","date":"Wed Jan 23 18:51:50 MST 2013"},{"aspect":"self_created","tweet":"hope it didn't say \"help\" RT @Don_Reuters: RT @reuters: Message in a bottle found after 76 years | Video  http://t.co/6uQrzz3H","date":"Wed Jan 23 13:30:59 MST 2013"},{"aspect":"self_created","tweet":"Re Beyonce, and whether she lip synched, Jay Carney says \"I actually have no idea what's true and what's not\"","date":"Wed Jan 23 11:48:36 MST 2013"},{"aspect":"self_created","tweet":"RT @ReutersPolitics: Obama to proceed with Allen nomination as supreme NATO commander in Europe http://t.co/duQ310or","date":"Wed Jan 23 11:39:57 MST 2013"},{"aspect":"self_created","tweet":"\"I was going to make a lip synch joke later,\" say Jay Carney","date":"Wed Jan 23 11:02:06 MST 2013"},{"aspect":"self_created","tweet":"Overheard over the mic during Obama's surprise greeting of WH tour visitors: \"Hey  Bo, sit,  sit.\"","date":"Tue Jan 22 13:14:40 MST 2013"},{"aspect":"self_created","tweet":"WH's Carney on climate change: Lit's a priority but it's not a singular priority.\"","date":"Tue Jan 22 10:01:58 MST 2013"},{"aspect":"self_created","tweet":"RT @jpaceDC: High-tech first family. Obama caught checking his blackberry in the viewing box, Malia taking pictures on her iphone","date":"Mon Jan 21 14:55:17 MST 2013"},{"aspect":"self_created","tweet":"Sen Chuck Schumer now giving his third speech of the day","date":"Mon Jan 21 11:18:21 MST 2013"},{"aspect":"self_created","tweet":"The Cabinet secretary not attending the inauguration, in case disaster were to strike, is VA Secretary Eric Shinseki.","date":"Mon Jan 21 09:46:09 MST 2013"},{"aspect":"self_created","tweet":"Congressional leaders, including Boehner and McConnell, are at the White House having inaugural day coffee with Pres Obama","date":"Mon Jan 21 07:54:27 MST 2013"},{"aspect":"self_created","tweet":"We're told Michelle Obama wearing a navy Thom Browne coat and dress, belt and shoes by JCrew, Cathy Waterman necklace. cc @maevereston","date":"Mon Jan 21 07:09:11 MST 2013"},{"aspect":"self_created","tweet":"Security in DC today: http://t.co/hoNxt6rW","date":"Mon Jan 21 06:32:49 MST 2013"},{"aspect":"self_created","tweet":"Quote of the day: From Sasha Obama to her father after he cited oath of office: \"You didn't mess up.\"","date":"Sun Jan 20 11:32:56 MST 2013"},{"aspect":"self_created","tweet":"Obama, his arm around Michelle's waist, joins church crowd in singing Happy Birthday to his wife","date":"Sun Jan 20 08:06:37 MST 2013"},{"aspect":"self_created","tweet":"Scene inside Metropolitan AME Church as Obamas arrive for services: http://t.co/QvxhQmVA","date":"Sun Jan 20 07:50:18 MST 2013"},{"aspect":"self_created","tweet":"Obama, Biden lay a wreath at the Tomb of the Unknown at Arlington http://t.co/dV9IuL7Q","date":"Sun Jan 20 07:08:22 MST 2013"},{"aspect":"self_created","tweet":"Pres Obama just now arriving at Arlington cemetery for wreath-laying","date":"Sun Jan 20 06:54:20 MST 2013"},{"aspect":"self_created","tweet":"RT @sampjacobs: New for @Reuters: After fumbled oath, Roberts and Obama hope third, fourth times a charm. http://t.co/qpe7V2sF","date":"Fri Jan 18 13:51:26 MST 2013"},{"aspect":"self_created","tweet":"\"This situation is ongoing and sensitive,\" an administration official says of the Algerian hostage crisis.","date":"Fri Jan 18 08:30:39 MST 2013"},{"aspect":"self_created","tweet":"White House is in constant contact with Algerian government over hostage situation, spokesman says","date":"Fri Jan 18 08:25:58 MST 2013"},{"aspect":"self_created","tweet":"Obama told Cameron the US prefers Britain to remain in a \"strong European Union\"","date":"Thu Jan 17 14:51:31 MST 2013"},{"aspect":"self_created","tweet":"Obama and British PM Cameron spoke about Algerian hostage situation, the White House says.","date":"Thu Jan 17 14:49:57 MST 2013"},{"aspect":"self_created","tweet":"\"This is an ongoing situation, and we are seeking clarity,\" WH's Carney said re Algeria hostage situation.","date":"Thu Jan 17 10:14:17 MST 2013"},{"aspect":"self_created","tweet":"Carney: We are concerned about reports of loss of  life in Algeria, seeking info from Algerian government","date":"Thu Jan 17 10:13:19 MST 2013"},{"aspect":"self_created","tweet":"RT @kherman: Manti to Lance: Got a cell number for Oprah?","date":"Thu Jan 17 07:17:15 MST 2013"},{"aspect":"self_created","tweet":"Obama, Biden, other senior types at Treasury Dept for Tim Geithner farewell party","date":"Wed Jan 16 14:23:35 MST 2013"},{"aspect":"self_created","tweet":"congrats  and #ff to @oknox aka \"the world's first tweeter\" for promotion as chief Washington corro at Yahoo News","date":"Wed Jan 16 12:08:29 MST 2013"},{"aspect":"self_created","tweet":"The White House says the NRA attack ad that mentions Obama's daughters is \"repugnant and cowardly\"","date":"Wed Jan 16 09:36:49 MST 2013"},{"aspect":"self_created","tweet":"Hillary Clinton is leaving the world stage, but for how long: http://t.co/SRrwWdLa","date":"Wed Jan 16 07:38:25 MST 2013"},{"aspect":"self_created","tweet":"If you want to propose that the US build a Death Star, it'll now take 100,000 signatures: http://t.co/TVK9eM5N","date":"Wed Jan 16 06:53:54 MST 2013"},{"aspect":"self_created","tweet":"@jaketapper Tony Snow","date":"Tue Jan 15 09:53:09 MST 2013"},{"aspect":"self_created","tweet":"RT @ReutersPolitics: \"Lonely\" Obama eyes second term strategy with Congress: the schmooze\r http://t.co/Dw9mz0Q4","date":"Mon Jan 14 13:18:30 MST 2013"},{"aspect":"self_created","tweet":"“Mr. Bush has improved to the point that he will not need any special medication when he goes home, but he will continue physical therapy.\"","date":"Mon Jan 14 11:27:44 MST 2013"},{"aspect":"self_created","tweet":"George HW Bush released from Houston hospital after six weeks there","date":"Mon Jan 14 11:26:18 MST 2013"},{"aspect":"self_created","tweet":"\"I'm getting kinda lonely in this big house,\" says Obama, predicting more socializing with Congress in 2nd term.","date":"Mon Jan 14 10:31:18 MST 2013"},{"aspect":"self_created","tweet":"\"I like a good party,\" Obama says","date":"Mon Jan 14 10:27:22 MST 2013"},{"aspect":"self_created","tweet":"Obama said re efforts to reduce gun violence, \"There may be some steps we can take administratively.\"","date":"Mon Jan 14 10:11:40 MST 2013"},{"aspect":"self_created","tweet":"RT @markfelsenthal: At Obama news conference at 11:15 a.m., president expected to focus on debt ceiling and fiscal issues.","date":"Mon Jan 14 08:12:22 MST 2013"},{"aspect":"self_created","tweet":"So much for the $1 trillion platinum coin idea: http://t.co/DMmil1th","date":"Sat Jan 12 15:55:40 MST 2013"},{"aspect":"self_created","tweet":"Best thing about the end of the platinum coin trial balloon is not having to type platinum cause it's hard to do without typos","date":"Sat Jan 12 14:52:54 MST 2013"},{"aspect":"self_created","tweet":"Yeah Ed RT @gretawire: please tweet @edhenryTV and tell him I said he doesn't know football...:)","date":"Sat Jan 12 14:36:40 MST 2013"},{"aspect":"self_created","tweet":"Obama administration opts against building Death Star: http://t.co/08XUeO0P","date":"Sat Jan 12 07:43:57 MST 2013"},{"aspect":"self_created","tweet":"Still sane despite sitting twixt @markknoller and @MajorCBS RT @plantecbs: This is my inaugural tweet. My producer made me do it!","date":"Fri Jan 11 13:38:21 MST 2013"},{"aspect":"self_created","tweet":"RT @AntDeRosa: Whistling guy in the newsroom is getting on my last nerve","date":"Thu Jan 10 16:01:52 MST 2013"},{"aspect":"self_created","tweet":"Obama jokes Jack Lew promised to make at least one letter in his signature legible when he signs US currency as Treasury sec","date":"Thu Jan 10 11:56:33 MST 2013"},{"aspect":"self_created","tweet":"RT @ReutersPolitics: Platinum coin idea has little currency at White House http://t.co/jKH4fASA","date":"Wed Jan 09 16:07:37 MST 2013"},{"aspect":"self_created","tweet":"RT @mattspetalnick: WH's Carney couldnt resist RGIII controversy:\"Sure seemed like as remarkable a player as he is, he wasnt in a positi ...","date":"Wed Jan 09 13:45:26 MST 2013"},{"aspect":"self_created","tweet":"Speculative size of $1 trillion platinum coin: http://t.co/7X5za6er","date":"Wed Jan 09 13:07:34 MST 2013"},{"aspect":"self_created","tweet":"\"I'm not going to get ahead of the president or the vice president,\" says Jay Carney","date":"Wed Jan 09 12:41:09 MST 2013"},{"aspect":"self_created","tweet":"Yay! #ff MT @robertarampton: Honored to announce I have joined @steveholland1 @mattspetalnick @jeffmason1 @markfelsenthal at WH for Reuters","date":"Tue Jan 08 15:22:57 MST 2013"},{"aspect":"self_created","tweet":"Great article about a dear fellow, @markknoller http://t.co/03OmMUad","date":"Tue Jan 08 15:18:09 MST 2013"},{"aspect":"self_created","tweet":"\"Its hard to be more clear,\" says Jay Carney. \"We won't negotiate over raising the debt ceiling.\"","date":"Tue Jan 08 11:43:13 MST 2013"},{"aspect":"self_created","tweet":"Carney opens his briefing with a homage to the late Richard Ben Cramer.","date":"Tue Jan 08 10:56:25 MST 2013"},{"aspect":"self_created","tweet":"Correct that to say Bush still at Houston hospital not Dallas.","date":"Mon Jan 07 14:08:30 MST 2013"},{"aspect":"self_created","tweet":"George HW Bush still at Dallas hospital, no timeline for release. Spox says he watched football wins by Texas A&M and Houston Texans.","date":"Mon Jan 07 14:06:07 MST 2013"},{"aspect":"self_created","tweet":"\"Sen Hagel has been a staunch supporter of Israel,\" says Jay Carney","date":"Mon Jan 07 12:20:31 MST 2013"},{"aspect":"self_created","tweet":"Leon Panetta, departing Defense sec, says he going home to his Calif walnut farm to deal \"with a different set of nuts\"","date":"Mon Jan 07 11:30:05 MST 2013"},{"aspect":"self_created","tweet":"Just saw a full-page ad in Wash Post from Log Cabin Republicans attacking \"Chuck Hagel's record on gay rights.\"","date":"Mon Jan 07 08:37:06 MST 2013"},{"aspect":"self_created","tweet":"RT @Reuters: All signs point to Hagel as pick for defense secretary http://t.co/58h0A4FX","date":"Fri Jan 04 18:16:11 MST 2013"},{"aspect":"self_created","tweet":"@QuinHillyer Thanks!","date":"Fri Jan 04 15:07:00 MST 2013"},{"aspect":"self_created","tweet":"Katie's Frozen Custard RT @OKnox: @judykeen @DanaPerino @steveholland1 @petermaercbs I miss Keen Judy!","date":"Fri Jan 04 14:41:51 MST 2013"},{"aspect":"self_created","tweet":"Yeah and @oknox was in diapers MT @petermaercbs: @steveholland1 @oknox I remember THE FIRST TIME @steveholland1 arrived  on the WH beat.","date":"Fri Jan 04 14:13:34 MST 2013"},{"aspect":"self_created","tweet":"Way to go Julie! RT @Dharapak: Congratulations @jpaceDC! @AP names Julie Pace White House correspondent: http://t.co/3nmC9yuw","date":"Fri Jan 04 12:54:54 MST 2013"},{"aspect":"self_created","tweet":"Ditto RT @OKnox: I'm so old I remember when @BenFellerDC came on the White House beat. Great reporter, great comrade on the road. Cheers!","date":"Fri Jan 04 12:51:55 MST 2013"},{"aspect":"self_created","tweet":"Boehner re-elected House speaker 220-192, not  a squeaker","date":"Thu Jan 03 11:55:58 MST 2013"},{"aspect":"self_created","tweet":"RT @mikememoli: \"It feels like winter out there. 77 is as warm as it's going to get.\" #thingstheysayonhawaiiweatherforecasts","date":"Wed Jan 02 09:36:42 MST 2013"},{"aspect":"self_created","tweet":"RT @markknoller: In written statement, the doctors say Secy Clinton's blood clot \"did not result in a stroke or neurological damage.\"","date":"Mon Dec 31 15:05:25 MST 2012"},{"aspect":"self_created","tweet":"@EdWGillespie no point in rooting for the Wiz it wouldn't help","date":"Sun Dec 30 15:42:56 MST 2012"},{"aspect":"self_created","tweet":"George HW Bush's condition has improved to the point that he is out of intensive care and in a regular hospital room, his office says","date":"Sat Dec 29 13:51:10 MST 2012"},{"aspect":"self_created","tweet":"Former Prez GHW Bush continues to improve, is now singing to docs and nurses, still in ICU, his office says","date":"Fri Dec 28 11:37:42 MST 2012"},{"aspect":"self_created","tweet":"RT @petermaercbs: \"Put the harps back in the closet.\" Jean Becker top aide to GHW Bush says that would be his message to those concerned ...","date":"Thu Dec 27 13:34:48 MST 2012"},{"aspect":"self_created","tweet":"Thrilled for @kasie but we'll miss you in wire world","date":"Thu Dec 27 11:57:04 MST 2012"},{"aspect":"self_created","tweet":"RT @Dharapak: RT @ErikaMasonhall: Congrats & welcome to AP's @Kasie Hunt - joining @NBCNews as off-air political reporter/producer h ...","date":"Thu Dec 27 11:52:27 MST 2012"},{"aspect":"self_created","tweet":"RT @ReutersPolitics: Ex-U.S. President George H.W. Bush in intensive care http://t.co/7Kbx235A","date":"Wed Dec 26 18:14:02 MST 2012"},{"aspect":"self_created","tweet":"RT @Sarah_Boxer: Spokesman for George H.W. Bush tells @CBSNews the former president has not responded to medication designed to lower hi ...","date":"Wed Dec 26 14:20:25 MST 2012"},{"aspect":"self_created","tweet":"RT @bazmaniandevil: It's official: Pres Obama will end his Christmas vacation & depart DC for Washington tomorrow. First Lady &  ...","date":"Tue Dec 25 20:27:59 MST 2012"},{"aspect":"self_created","tweet":"Santa will have no trouble finding this house in Chattanooga TN even in the fog: http://t.co/dFZ97K5m","date":"Mon Dec 24 20:02:24 MST 2012"},{"aspect":"self_created","tweet":"Next year? RT @AlexConant: At what point are we safe declaring the Mayans wrong about the whole end-of-world thing?","date":"Fri Dec 21 18:33:49 MST 2012"},{"aspect":"self_created","tweet":"\"Speaker Boehner will return to Washington following the holiday, ready to find a solution that can pass both houses of Congress\" - aide","date":"Fri Dec 21 16:17:09 MST 2012"},{"aspect":"self_created","tweet":"\"Becasue we didn't get this done I will see you next week,\" Obama tells Whouse reporters.","date":"Fri Dec 21 15:42:59 MST 2012"},{"aspect":"self_created","tweet":"Obama calls for cooling off period during Xmas holiday for lawmakers to set aside grievances, drink egg nog, sing carols","date":"Fri Dec 21 15:40:06 MST 2012"},{"aspect":"self_created","tweet":"Obama is to make a fiscal cliff statement at 5 pm, and we suspect it won't be happy talk","date":"Fri Dec 21 14:23:54 MST 2012"},{"aspect":"self_created","tweet":"Re Kerry RT @TonyZerucha: @steveholland1 He has the hair for it","date":"Fri Dec 21 12:07:44 MST 2012"},{"aspect":"self_created","tweet":"Hillary Clinton, beset with a stomach virus, fell and had concussion last week and has made no public appearances since","date":"Fri Dec 21 11:47:58 MST 2012"},{"aspect":"self_created","tweet":"Kerry played Mitt Romney in mock debates with Obama as the Prez prepared for his 3 encounters with Mitt","date":"Fri Dec 21 11:44:57 MST 2012"},{"aspect":"self_created","tweet":"Kerry became the front-runner for SecState job after embattled Susan Rice withdrew from consideration last week","date":"Fri Dec 21 11:43:29 MST 2012"},{"aspect":"self_created","tweet":"Obama nominates John Kerry as secretary of state to replace Hillary Clinton. O says HRC \"wanted very much to be here\" but still ailing","date":"Fri Dec 21 11:40:44 MST 2012"},{"aspect":"self_created","tweet":"NRA chief Wayne LaPierre, at news conf, goes after a familiar subject of NRA criticism: The news media","date":"Fri Dec 21 09:15:46 MST 2012"},{"aspect":"self_created","tweet":"Looks like Obama will make the Kerry Sec of State announcement  at 1:30pm","date":"Fri Dec 21 09:08:19 MST 2012"},{"aspect":"self_created","tweet":"Pres Obama to nominate Sen John Kerry today to replace Hillary Clinton as Secretary of State, we're told","date":"Fri Dec 21 08:35:40 MST 2012"},{"aspect":"self_created","tweet":"@gretawire Probably pressed as well","date":"Fri Dec 21 07:23:23 MST 2012"},{"aspect":"self_created","tweet":"RT @jennablan: Boehner abandons fiscal cliff plan as Republicans defect http://t.co/yRCtwLvO","date":"Thu Dec 20 19:39:10 MST 2012"},{"aspect":"self_created","tweet":"Congrats to @jaketapper for new CNN anchor gig","date":"Thu Dec 20 14:38:14 MST 2012"},{"aspect":"self_created","tweet":"RT @markfelsenthal: Other famous plans: http://t.co/f1NdfddZ","date":"Thu Dec 20 12:20:07 MST 2012"},{"aspect":"self_created","tweet":"\"I would refer questions about her health to the State Department,\" Carney says to question about concussed Hillary Clinton.","date":"Thu Dec 20 11:36:56 MST 2012"},{"aspect":"self_created","tweet":"RT @KellyO: .@SpeakerBoehner \"I did my part...\" saying he gave on tax rates","date":"Thu Dec 20 11:30:01 MST 2012"},{"aspect":"self_created","tweet":"RT @KellyO: .@SpeakerBoehner \"I did my part...\" saying he gave on tax rates","date":"Thu Dec 20 11:30:01 MST 2012"},{"aspect":"self_created","tweet":"WH's Carney calls Boehner's Plan B \"a multi-day exercise in futility.\"","date":"Thu Dec 20 10:56:00 MST 2012"},{"aspect":"self_created","tweet":"The Rose Garden at night during holiday season: http://t.co/FpRm0RaQ","date":"Wed Dec 19 17:29:48 MST 2012"},{"aspect":"self_created","tweet":"Yes \"@carlquintanilla: Amen MT @nbcnewscrew: @RichardEngel's cameraman is JOHN KOOISTRA, one of the best in biz http://t.co/e91YY1R0\"","date":"Tue Dec 18 14:54:15 MST 2012"},{"aspect":"self_created","tweet":"Obama also seeking two-year extension of debt limit as part of latest offer on fiscal cliff (would get him thru the mid-terms)","date":"Mon Dec 17 18:37:23 MST 2012"},{"aspect":"self_created","tweet":"As part of potential fiscal deal, we hear Obama willing to let those making $400,000 or less to keep tax cuts, raise em on those above","date":"Mon Dec 17 18:14:02 MST 2012"},{"aspect":"self_created","tweet":"We're told Pres Obama met Biden, Holder, two other Cabinet members and senior WH staff to discuss how to respond to Newtown tragedy","date":"Mon Dec 17 16:15:59 MST 2012"},{"aspect":"self_created","tweet":"Eek RT @DaviSusan: Cancel flight plans: Harry Reid says it seems apparent Congress is coming back Dec. 26 to finish work on \"fiscal cliff.\"","date":"Mon Dec 17 12:23:31 MST 2012"},{"aspect":"self_created","tweet":"At his daily briefing, WH's Carney is dancing around questions about whether Obama would back increased gun control","date":"Mon Dec 17 11:30:16 MST 2012"},{"aspect":"self_created","tweet":"RT @mattspetalnick: Obama, in most forceful post-shooting speech yet, vows to use all powers of office to \"engage\" America on issue. Qst ...","date":"Sun Dec 16 19:04:38 MST 2012"},{"aspect":"self_created","tweet":"RT @EmilyABC: Touching makeshift memorial at HS where POTUS will speak tonight http://t.co/mu19t6o9","date":"Sun Dec 16 08:10:00 MST 2012"},{"aspect":"self_created","tweet":"SecState Hillary Clinton, sick with a stomach virus, got dehydrated, fainted and suffered a concussion, now resting at home--State Dept","date":"Sat Dec 15 10:32:42 MST 2012"},{"aspect":"self_created","tweet":"Pres Obama is wiping away tears as he speaks about the tragedy in Connecticut","date":"Fri Dec 14 13:20:02 MST 2012"},{"aspect":"self_created","tweet":"Pres Obama has ordered flags at White House and other public buildings flown at half-staff in honor of Newtown victims.","date":"Fri Dec 14 13:09:43 MST 2012"},{"aspect":"self_created","tweet":"Obama to make statement on Conn shootings in WH at 3:15 pm EST","date":"Fri Dec 14 12:46:48 MST 2012"},{"aspect":"self_created","tweet":"Pres Obama spoke to Connecticut Gov by phone to get details on school shooting and express his condolences","date":"Fri Dec 14 11:22:20 MST 2012"},{"aspect":"self_created","tweet":"WH's Carney says Pres Obama has been informed of Connecticut school shooting and is getting regular updates","date":"Fri Dec 14 10:44:00 MST 2012"},{"aspect":"self_created","tweet":"So far it looks like we got past that doomsday Mayan prophecy from yesterday","date":"Fri Dec 14 07:42:08 MST 2012"},{"aspect":"self_created","tweet":"@GarrettNBCNews should be a good cup of coffee around there somewhere","date":"Thu Dec 13 22:00:28 MST 2012"},{"aspect":"self_created","tweet":"Both sides of fiscal cliff debate described the Obama-Boehner meeting at the WH as \"frank,\" and lines of communication remain open.","date":"Thu Dec 13 16:43:12 MST 2012"},{"aspect":"self_created","tweet":"We're hearing Pres Obama will meet with Susan Rice tomorrow afternoon","date":"Thu Dec 13 16:41:38 MST 2012"},{"aspect":"self_created","tweet":"Pres Obama and Speaker Boehner just ended about an hour of fiscal cliff talks at the White House","date":"Thu Dec 13 16:04:39 MST 2012"},{"aspect":"self_created","tweet":"Boehner will meet Obama at the White House late this afternoon on fiscal cliff, we're being told","date":"Thu Dec 13 13:38:07 MST 2012"},{"aspect":"self_created","tweet":"@DanaPerino @dwhelton @OKnox as you can imagine Chris Christie and other characters were in Greg Clugston's poem","date":"Thu Dec 13 12:45:29 MST 2012"},{"aspect":"self_created","tweet":"Here's the scene in the WH pressroom basement for annual holiday party: http://t.co/lFuJ3goZ","date":"Thu Dec 13 12:38:24 MST 2012"},{"aspect":"self_created","tweet":"WH's Carney: \"We still believe a big deal is possible.\"","date":"Thu Dec 13 11:28:10 MST 2012"},{"aspect":"self_created","tweet":"RT @edhenryTV: President just told me deal \"still a work in progress\" as he walked to Blair House","date":"Thu Dec 13 10:42:06 MST 2012"},{"aspect":"self_created","tweet":"\"Congress is never going to give up its ability to control the purse,\" Boehner said re Obama's debt ceiling demand.","date":"Thu Dec 13 09:34:33 MST 2012"},{"aspect":"self_created","tweet":"\"We made a reasonable offer, now it's up to the White House,\" Boehner said.","date":"Thu Dec 13 09:28:40 MST 2012"},{"aspect":"self_created","tweet":"Speaker Boehner to say in a few minutes that fiscal cliff talks still deadlocked because \"spending is still the problem.\"","date":"Thu Dec 13 09:07:04 MST 2012"},{"aspect":"self_created","tweet":"The White House says the North Korean missile launch is highly provocative act and US will strengthen coordination with allies","date":"Tue Dec 11 21:45:01 MST 2012"},{"aspect":"self_created","tweet":"Our Phil Stewart reports NORAD has determined the North Korean missile appear to launch an object into orbit","date":"Tue Dec 11 21:17:59 MST 2012"},{"aspect":"self_created","tweet":"RT @ReutersPolitics: Obama, Boehner talk and exchange new offers on \"fiscal cliff\" http://t.co/jjZpwvYI","date":"Tue Dec 11 19:15:10 MST 2012"},{"aspect":"self_created","tweet":"Inaugural grandstand under construction: http://t.co/7U3c0aAN","date":"Tue Dec 11 14:21:11 MST 2012"},{"aspect":"self_created","tweet":"Carney on fiscal cliff talks: \"I'm not going to get into the sausage-making.\"","date":"Tue Dec 11 12:35:16 MST 2012"},{"aspect":"self_created","tweet":"Obama weighs in on right-to-work debate in Michigan, \"What we shouldn't do is take away your rights to bargain for better wages.\"","date":"Mon Dec 10 12:41:25 MST 2012"},{"aspect":"self_created","tweet":"In Redford Mich, Obama notes it's been a month since the election. \"It's now safe for you to turn your television sets back on.\"","date":"Mon Dec 10 12:33:31 MST 2012"},{"aspect":"self_created","tweet":"Pres Obama arrives by motorcade instead of helo at Andrews AFB on socked-in day http://t.co/zqwTdjim","date":"Mon Dec 10 09:25:23 MST 2012"},{"aspect":"self_created","tweet":"RT @kherman: Nope. Not the same tradition. I didn't like veep presenting commander in chief trophy today, though I know there will be a  ...","date":"Sat Dec 08 18:39:03 MST 2012"},{"aspect":"self_created","tweet":"RT @petermaercbs: TX hospital reports GHW Bush \nin stable condition.  Drs \"remain cautious with his care and have no timeline for when h ...","date":"Fri Dec 07 11:57:56 MST 2012"},{"aspect":"self_created","tweet":"@nellie4000 No one is surprised. There's still three weeks to go until the deadline.","date":"Fri Dec 07 09:52:48 MST 2012"},{"aspect":"self_created","tweet":"Boehner said his phone call with Obama on Weds night was \"pleasant but more of the same.\" So we can see the two sides still far apart","date":"Fri Dec 07 09:04:30 MST 2012"},{"aspect":"self_created","tweet":"Boehner has an 11 am fiscal cliff newser on the Hill, our folks there are reporting","date":"Fri Dec 07 07:50:33 MST 2012"},{"aspect":"self_created","tweet":"RT @pdacosta: U.S. jobless rate drops to 7.7 percent from 7.9 percent","date":"Fri Dec 07 06:32:23 MST 2012"},{"aspect":"self_created","tweet":"Lighting Natl Xmas tree, Obama notes last two trees didn't make it: \"Just goes to show you that nobody's job is safe here in Washington.\"","date":"Thu Dec 06 16:31:51 MST 2012"},{"aspect":"self_created","tweet":"NJ Gov Chris Christie has been spotted entering the West Wing of the White House","date":"Thu Dec 06 08:47:29 MST 2012"},{"aspect":"self_created","tweet":"Sen John Kerry, SecState candidate, is doing a tour d'horizon with Wolf on CNN","date":"Wed Dec 05 15:28:21 MST 2012"},{"aspect":"self_created","tweet":"WH's Carney, asked about Anna Wintour possibly getting ambassadorial appointment, says can't speculate about possible announcements.","date":"Wed Dec 05 11:36:33 MST 2012"},{"aspect":"self_created","tweet":"GW Bush weighed in on immigration debate today, urging a \"benevolent spirit and keep in mind the contribution of immigrants.\"","date":"Tue Dec 04 13:48:42 MST 2012"},{"aspect":"self_created","tweet":"WH's Carney said the Republican fiscal cliff plan amounts to \"magic beans and fairy dust.\"","date":"Tue Dec 04 11:39:01 MST 2012"},{"aspect":"self_created","tweet":"RT @BretBaier: +1 congrats Peter RT @ZekeJMiller Congrats @PeterAlexander!","date":"Tue Dec 04 11:38:13 MST 2012"},{"aspect":"self_created","tweet":"Carney is saying contours of agreement are evident if Repubs agree to higher tax rates, Obama not wedded to all details of his plan.","date":"Tue Dec 04 11:10:50 MST 2012"},{"aspect":"self_created","tweet":"White House is all in on insisting wealthier pay higher tax rates to avoid fiscal cliff, says no deal possible without it.","date":"Tue Dec 04 11:08:16 MST 2012"},{"aspect":"self_created","tweet":"Both sides tonight in the fiscal cliff battle are saying the ball is in the other side's court","date":"Mon Dec 03 16:05:31 MST 2012"},{"aspect":"self_created","tweet":"@Marty2634 Yes we do, Marty","date":"Mon Dec 03 13:34:40 MST 2012"},{"aspect":"self_created","tweet":"Mitt Romney rejoins board of Marriott hotels: http://t.co/Bo7BaLtz","date":"Mon Dec 03 13:26:20 MST 2012"},{"aspect":"self_created","tweet":"Pres Obama declines to answer reporters' fiscal cliff questions during Oval photo op with visiting Bulgarian PM","date":"Mon Dec 03 13:21:19 MST 2012"},{"aspect":"self_created","tweet":"RT @LarrySabato: @steveholland1 Ask POTUS if he agrees we should go to binding arbitration, will you? Adults can be useful >> #my2k","date":"Mon Dec 03 11:50:44 MST 2012"},{"aspect":"self_created","tweet":"White House's Carney says the Obamas extend congrats to the British royal family for Kate Middleton's pregnancy","date":"Mon Dec 03 10:42:36 MST 2012"},{"aspect":"self_created","tweet":"Pres Obama is going to respond to Twitter questions today at 2 pm re fiscal cliff","date":"Mon Dec 03 10:40:13 MST 2012"},{"aspect":"self_created","tweet":"Our story out of London says Kate Middleton will likely be in a hospital for several days suffering from very acute morning sickness","date":"Mon Dec 03 09:23:41 MST 2012"},{"aspect":"self_created","tweet":"RT @LATSeema: Nice read by @PhilipRucker on Romney's post-election seclusion: http://t.co/eVmRdcgV","date":"Sat Dec 01 15:21:40 MST 2012"},{"aspect":"self_created","tweet":"We're told Obama today will stress that any deal reached with Congress must ask the wealthiest to pay higher tax rates.","date":"Fri Nov 30 07:41:35 MST 2012"},{"aspect":"self_created","tweet":"@bazmaniandevil @ron_fournier yes sir","date":"Thu Nov 29 21:47:37 MST 2012"},{"aspect":"self_created","tweet":"@ron_fournier yes. I suspect we saw the full range of human emotions in covering those two gentlemen","date":"Thu Nov 29 21:12:26 MST 2012"},{"aspect":"self_created","tweet":"@ron_fournier Yes we did. Nice story, my friend","date":"Thu Nov 29 20:58:52 MST 2012"},{"aspect":"self_created","tweet":"MT @ron_fournier: Sincere thanks to Bill Clinton and George W. Bush. They took time with my boy. A dad's essay: http://t.co/96IJ65o0","date":"Thu Nov 29 20:39:10 MST 2012"},{"aspect":"self_created","tweet":"Obama and Romney talked about various things and \"pledged to stay in touch,\" the White House reported","date":"Thu Nov 29 13:27:22 MST 2012"},{"aspect":"self_created","tweet":"Romney has left the White House, our @jeffmason1 reports","date":"Thu Nov 29 11:57:00 MST 2012"},{"aspect":"self_created","tweet":"RT @jimacostacnn: Knoller asks if there will be a joint Obama Romney appearance at the briefing.// and is told no","date":"Thu Nov 29 11:15:46 MST 2012"},{"aspect":"self_created","tweet":"Wonder if Obama and Romney are taking any time to discuss sport","date":"Thu Nov 29 11:05:23 MST 2012"},{"aspect":"self_created","tweet":"In honor of Romney's lunch visit to White House, we picked up a campaign trail staple of his: http://t.co/jRvgyHAX","date":"Thu Nov 29 10:28:55 MST 2012"},{"aspect":"self_created","tweet":"RT @ReutersPolitics: Former President George H. W. Bush expected to be released from hospital within 72 hours - Houston hospital","date":"Thu Nov 29 10:04:39 MST 2012"},{"aspect":"self_created","tweet":"RT @markknoller: Federal Government would have to win 1200 $500-million Powerball jackpots in order to fix Fiscal Cliff.","date":"Wed Nov 28 17:26:12 MST 2012"},{"aspect":"self_created","tweet":"RT @andrewquinn: McCain & Co repeat opposition to potential Rice SecState nomination after meeting her, \"still troubled\" - RTRS","date":"Tue Nov 27 10:32:56 MST 2012"},{"aspect":"self_created","tweet":"The Jets may need to get Chris Christie into this game","date":"Thu Nov 22 19:31:45 MST 2012"},{"aspect":"self_created","tweet":"As Obama pardons Thanksgiving turkey, keep in mind Ben Franklin wanted turkey as our national bird, the wild version not butterballers","date":"Wed Nov 21 09:00:48 MST 2012"},{"aspect":"self_created","tweet":"RT @samyoungman: HUGE. CBS just announced @MajoratNJ becoming chief White House correspondent. Congrats to both!","date":"Sun Nov 18 09:33:32 MST 2012"},{"aspect":"self_created","tweet":"RT @okayhenderson: Rubio creatively addresses ‘16: “I am not now or nor will I ever B a candidate 4 offensive coordinator of Iowa.” Crow ...","date":"Sat Nov 17 17:48:38 MST 2012"},{"aspect":"self_created","tweet":"@markknoller gosh, hope it goes smoothly from here on out","date":"Sat Nov 17 15:26:42 MST 2012"},{"aspect":"self_created","tweet":"@markknoller hoping you won Seato","date":"Sat Nov 17 15:14:22 MST 2012"},{"aspect":"self_created","tweet":"#ff @DanWilliams to keep up with events in Israel and Gaza","date":"Sat Nov 17 08:50:56 MST 2012"},{"aspect":"self_created","tweet":"RT @trottreuters: goodbye #twinkies, goodbye @wonderbread? #hostess standoff w/ union http://t.co/vq7A4iKO","date":"Fri Nov 16 07:55:38 MST 2012"},{"aspect":"self_created","tweet":"Ditto RT @kasie: Happy birthday, @ZekeJMiller!","date":"Thu Nov 15 08:35:27 MST 2012"},{"aspect":"self_created","tweet":"RT @corriemac: Livestrong charity drops Lance Armstrong's name from title: http://t.co/GoLdhr3Z (my @Reuters exclusive story)","date":"Wed Nov 14 18:01:03 MST 2012"},{"aspect":"self_created","tweet":"Yes that's @reidepstein on page B4 of Washington Post in photo with arm outstretched","date":"Wed Nov 14 07:33:36 MST 2012"},{"aspect":"self_created","tweet":"RT @AprilDRyan: Sources close to Sen. Kerry contends he does not want to head the Department of Defense but wants the State Department.","date":"Tue Nov 13 14:42:32 MST 2012"},{"aspect":"self_created","tweet":"RT @robertburnsAP: When I pressed SecDef Panetta today on whether he might stay another 4 yrs at the Pentagon, he replied, \"Who the hell ...","date":"Mon Nov 12 19:15:56 MST 2012"},{"aspect":"self_created","tweet":"Sorry about the Tide @JanCBS and @alanblinder","date":"Sat Nov 10 17:18:14 MST 2012"},{"aspect":"self_created","tweet":"\"@wolfblitzer: Like Daniel Craig, I do my own stunts in #Skyfall\"//is he also in Lincoln movie?","date":"Sat Nov 10 15:36:17 MST 2012"},{"aspect":"self_created","tweet":"\"We can't just cut our way to prosperity,\" says Obama, insisting the wealthy pay more in taxes","date":"Fri Nov 09 11:11:10 MST 2012"},{"aspect":"self_created","tweet":"Pres Obama says he is inviting congressional leaders to the WH next week to talk about end-of-year fiscal woes","date":"Fri Nov 09 11:09:47 MST 2012"},{"aspect":"self_created","tweet":"\"Everything on the revenue side and on the spending side has to be looked at,\" Boehner tells Capitol Hill newser.","date":"Fri Nov 09 09:29:44 MST 2012"},{"aspect":"self_created","tweet":"RT @JohnJHarwood: Was very clearly Rooters @ShawnaNBCNews: Anyone else think the operator just said Jeff Mason w/ Hooters?  #obamacampai ...","date":"Thu Nov 08 12:34:34 MST 2012"},{"aspect":"self_created","tweet":"this RT @globeglen: SPIKE FOOTBALL: RT @steveholland1: The Obama campaign is holding a conference call to .... Well not sure exactly","date":"Thu Nov 08 12:20:00 MST 2012"},{"aspect":"self_created","tweet":"The Obama campaign is holding a conference call to .... Well not sure exactly","date":"Thu Nov 08 12:14:06 MST 2012"},{"aspect":"self_created","tweet":"RT @globeglen: MITT ROMNEY: Campaign had planned Boston Harbor fireworks show to celebrate election win... http://t.co/tdzRzbQK #mapoli","date":"Thu Nov 08 10:27:53 MST 2012"},{"aspect":"self_created","tweet":"RT @AP_Ken_Thomas: RT @okayhenderson: Marco Rubio to Iowa on Nov 17 to headline Branstad 2014 reelect fundraiser","date":"Thu Nov 08 10:12:32 MST 2012"},{"aspect":"self_created","tweet":"RT @hogotogo: Check out Joan Biskupic's take: Obama may now seek to make deeper mark on high court http://t.co/VrxmIpp6 via @reuters","date":"Thu Nov 08 08:50:49 MST 2012"},{"aspect":"self_created","tweet":"@NorahODonnell  OK let us know if you make it","date":"Thu Nov 08 08:45:59 MST 2012"}]}