{"user_name":"jeffmason1","user_timeline":[{"aspect":"self_created","tweet":"RT @carenbohan: Boston bombing edges into U.S. immigration debate in Congress http://t.co/QQS2xTFK1S","date":"Fri Apr 19 14:03:38 MDT 2013"},{"aspect":"self_created","tweet":"RT @dcharlesReuters: Check out @reuters live blog following latest developments in Boston bombing case: http://t.co/6CaN2gWxTp","date":"Fri Apr 19 13:59:04 MDT 2013"},{"aspect":"self_created","tweet":"Talkative @JoeBiden admits at start of gun control  chat that he's inclined to get \"windy\"","date":"Wed Apr 17 13:01:05 MDT 2013"},{"aspect":"self_created","tweet":"RT @pbsgwen: Disturbing that it's OK for TV to ID a Boston bombing suspect only as \"a dark-skinned individual.\"","date":"Wed Apr 17 11:08:26 MDT 2013"},{"aspect":"self_created","tweet":"@PressSec Carney, who earlier clenched jaw and seemed to blink back tears when asked about Newtown families, says on guns: this isn't over","date":"Wed Apr 17 10:57:21 MDT 2013"},{"aspect":"self_created","tweet":"Jay Carney seems visibly annoyed by likelihood that gun control legislation on background checks will not pass Senate","date":"Wed Apr 17 10:38:52 MDT 2013"},{"aspect":"self_created","tweet":"@PressSec Carney says everyone at the White House from the president on down is working on advancing gun control legislation today","date":"Wed Apr 17 10:36:01 MDT 2013"},{"aspect":"self_created","tweet":"RT @SenatorReid: I will vote for assault weapons ban because maintaining law and order and saving lives is more important than preventin ...","date":"Wed Apr 17 07:51:33 MDT 2013"},{"aspect":"self_created","tweet":"RT @KellyO: Sen Wicker thanks law enforcement for \"hard work and diligence.\" Says FBI and Cap Police investigating ricin tainted letter  ...","date":"Tue Apr 16 18:43:05 MDT 2013"},{"aspect":"self_created","tweet":"RT @ReutersPolitics: Obama endorses bipartisan immigration overhaul http://t.co/lrckgPcLL4","date":"Tue Apr 16 18:42:45 MDT 2013"},{"aspect":"self_created","tweet":"@UTMilLiaison good to hear from you Haraz!","date":"Tue Apr 16 10:34:05 MDT 2013"},{"aspect":"self_created","tweet":"Two minute warning to start of Obama's remarks","date":"Tue Apr 16 09:28:57 MDT 2013"},{"aspect":"self_created","tweet":"Obama to make another statement on Boston bombings at 11:30 eastern","date":"Tue Apr 16 09:06:06 MDT 2013"},{"aspect":"self_created","tweet":"RT @steveholland1: WH official says Boston explosion being approached as an \"act of terror.\"","date":"Mon Apr 15 16:32:01 MDT 2013"},{"aspect":"self_created","tweet":"Words Obama did not use in his remarks about Boston: terror attack","date":"Mon Apr 15 16:25:56 MDT 2013"},{"aspect":"self_created","tweet":"Obama says directed authorities to increase security around the United States as necessary after Boston explosions","date":"Mon Apr 15 16:19:13 MDT 2013"},{"aspect":"self_created","tweet":"Obama says we do not know who carried out Boston explosions","date":"Mon Apr 15 16:16:06 MDT 2013"},{"aspect":"self_created","tweet":"White House just gave a two minute warning to reporters that Obama is about to speak","date":"Mon Apr 15 16:09:03 MDT 2013"},{"aspect":"self_created","tweet":"Obama to speak at 6:10 pm eastern on Boston explosions","date":"Mon Apr 15 15:46:19 MDT 2013"},{"aspect":"self_created","tweet":"Thanks @revsusanrussell!","date":"Mon Apr 15 09:51:26 MDT 2013"},{"aspect":"self_created","tweet":"Thanks Susan @susanheavey @reuters","date":"Mon Apr 15 09:50:57 MDT 2013"},{"aspect":"self_created","tweet":"RT @BetsyMTP: On #MTP @kenburns on Jackie Robinson: \"to me he's one of the greatest heroes in all of American history.\"   #42","date":"Sun Apr 14 07:48:32 MDT 2013"},{"aspect":"self_created","tweet":"Stopped at the FBI building, where Potus is playing basketball","date":"Sun Apr 14 07:32:54 MDT 2013"},{"aspect":"self_created","tweet":"@BarackObama's motorcade is on the move on a Sunday morning and we are stopping at stoplights, which means this is not official business","date":"Sun Apr 14 07:30:04 MDT 2013"},{"aspect":"self_created","tweet":"http://t.co/E9nUy1SSXG. Hoping this link works to my story this morning on Obama and gay rights","date":"Sun Apr 14 07:26:21 MDT 2013"},{"aspect":"self_created","tweet":"Thanks @JCBua!","date":"Sun Apr 14 06:53:26 MDT 2013"},{"aspect":"self_created","tweet":"Looking forward to joining @SteveScully shortly on C-SPAN's Washington Journal","date":"Sun Apr 14 05:44:03 MDT 2013"},{"aspect":"self_created","tweet":"Obama and his wife reported adjusted gross income of $608,611 and paid $112,214 in total tax","date":"Fri Apr 12 11:45:07 MDT 2013"},{"aspect":"self_created","tweet":"Obama's effective tax rate in 2012 was 18.4 pct, according to his tax filings","date":"Fri Apr 12 11:43:29 MDT 2013"},{"aspect":"self_created","tweet":"@juliemason, right back at you!","date":"Fri Apr 12 11:36:23 MDT 2013"},{"aspect":"self_created","tweet":"RT @ReutersUS: Poor communities in the United States are being left behind in nation's economic recovery: Fed chief Bernanke http://t.co ...","date":"Fri Apr 12 10:59:16 MDT 2013"},{"aspect":"self_created","tweet":"@PressSec keeps up drumbeat on China, Russia to influence N.Korea. Will be interesting to see if Donilon makes progress on that in Moscow","date":"Fri Apr 12 10:55:02 MDT 2013"},{"aspect":"self_created","tweet":"RT @GlennThrush: CBB ain't ever wrong, folks MT RT @cbudoffbrown: Rubio isn't gonna abandon Gang of Eight. Quite the opposite http://t.c ...","date":"Thu Apr 11 19:54:11 MDT 2013"},{"aspect":"self_created","tweet":"@BenFellerNY, what a nice thing to say my friend and right back at you. Miss you in DC buddy","date":"Thu Apr 11 10:45:17 MDT 2013"},{"aspect":"self_created","tweet":"Getting clever. Carney says Jay Z rap about speaking to Potus about his Cuba trip mentioned the White House because Treasury didn't rhyme","date":"Thu Apr 11 10:31:03 MDT 2013"},{"aspect":"self_created","tweet":"In other news: Carney says Obama probably talked about his budget in meeting with banking CEOs today","date":"Thu Apr 11 10:26:17 MDT 2013"},{"aspect":"self_created","tweet":"For anyone who is unclear what the White House budget message is, Carney sums it up: this is not a starting point, it's a sticking point","date":"Thu Apr 11 10:23:09 MDT 2013"},{"aspect":"self_created","tweet":"@CableGuyG beautiful, my friend. Wish I were there for a walk!","date":"Sun Apr 07 10:38:56 MDT 2013"},{"aspect":"self_created","tweet":"Obama says its going to be tougher to get gun control legislation through House and Senate, wants citizens to mobilize","date":"Thu Apr 04 11:37:53 MDT 2013"},{"aspect":"self_created","tweet":"At third fundraiser in California, Obama says in his second term he is thinking about how to leave a legacy for the next president, country","date":"Thu Apr 04 11:30:42 MDT 2013"},{"aspect":"self_created","tweet":"@Agent350 he didn't mention Keystone by name but it was clearly on his mind","date":"Wed Apr 03 22:24:02 MDT 2013"},{"aspect":"self_created","tweet":"Obama strikes an ecumenical note in his remarks about faith at national prayer breakfast","date":"Wed Apr 03 20:13:56 MDT 2013"},{"aspect":"self_created","tweet":"Obama says at first California fundraiser he expects Nancy Pelosi will be Speaker of the House again","date":"Wed Apr 03 20:13:56 MDT 2013"},{"aspect":"self_created","tweet":"Obama tells fundraiser he thinks immigration reform can get done in next couple months","date":"Wed Apr 03 20:13:55 MDT 2013"},{"aspect":"self_created","tweet":"Obama talking a lot about climate change here. Probably to offset concern that he will approve Keystone pipeline","date":"Wed Apr 03 20:13:28 MDT 2013"},{"aspect":"self_created","tweet":"Obama says his wife Michelle, after a campaign trip in rural Iowa, told him she could understand why people in rural areas would want guns","date":"Wed Apr 03 15:37:27 MDT 2013"},{"aspect":"self_created","tweet":"Obama: I don't believe that weapons designed for theaters of war have a place in movie theaters. (Loud applause for that.)","date":"Wed Apr 03 15:32:54 MDT 2013"},{"aspect":"self_created","tweet":"Obama asks: if you were selling a gun, wouldn't you want to know who's buying it? Only scattered applause for that one.","date":"Wed Apr 03 15:30:56 MDT 2013"},{"aspect":"self_created","tweet":"Picture of Obama speaking at the Denver Police Academy about gun control. http://t.co/znhbB27ynM","date":"Wed Apr 03 15:26:18 MDT 2013"},{"aspect":"self_created","tweet":"@evesgardenparty yes, heard that too. We asked Jay Carney about that on Air Force One, but he didn't give a very direct answer","date":"Wed Apr 03 15:23:22 MDT 2013"},{"aspect":"self_created","tweet":"@joerotondi @ethanklapper hey Joe, he usually does, yes","date":"Wed Apr 03 15:21:04 MDT 2013"},{"aspect":"self_created","tweet":"Af1 is wheels up","date":"Wed Apr 03 10:35:53 MDT 2013"},{"aspect":"self_created","tweet":"Picture of Obama boarding AF1 on the way to Denver http://t.co/RJo7O6AONg","date":"Wed Apr 03 10:29:28 MDT 2013"},{"aspect":"self_created","tweet":"@drewhjohnston thanks Drew!","date":"Mon Apr 01 13:12:02 MDT 2013"},{"aspect":"self_created","tweet":"Am reporting exclusively that Obama chose White House economic adviser Brian Deese as deputy director of OMB, making announcement today","date":"Mon Apr 01 13:08:27 MDT 2013"},{"aspect":"self_created","tweet":"@PressSec Jay Carney says, after Obama missed shots on the basketball court this morning, that the president doesn't get to practice much","date":"Mon Apr 01 11:15:06 MDT 2013"},{"aspect":"self_created","tweet":"@JCBua @whitehouse @skynews Good to see you just now sir. And thankfully the fog has lifted!","date":"Mon Apr 01 10:13:13 MDT 2013"},{"aspect":"self_created","tweet":"One can barely see Pennsylvania Ave. http://t.co/mxR3yUFzA8","date":"Mon Apr 01 06:20:18 MDT 2013"},{"aspect":"self_created","tweet":"It's unusually hazy near the White House this morning. http://t.co/lKQOZdJtgn","date":"Mon Apr 01 06:19:48 MDT 2013"},{"aspect":"self_created","tweet":"Pastor at church Obama is attending says captains of the religious right want blacks at back of bus, women in the kitchen, gays in closet","date":"Sun Mar 31 09:56:36 MDT 2013"},{"aspect":"self_created","tweet":"Rev. Dr. Luis Leon does not acknowledge the president and his family at the beginning of his sermon, but does take a swipe at the Yankees","date":"Sun Mar 31 09:52:57 MDT 2013"},{"aspect":"self_created","tweet":"Obama family on the way to church on Easter Sunday http://t.co/v12gCheq2s","date":"Sun Mar 31 09:21:52 MDT 2013"},{"aspect":"self_created","tweet":"\"Happy Easter,\" Obama said.","date":"Sun Mar 31 09:16:32 MDT 2013"},{"aspect":"self_created","tweet":"President Obama and his family, dressed in Easter best, just walked past the press en route to church across the street from the White House","date":"Sun Mar 31 09:16:03 MDT 2013"},{"aspect":"self_created","tweet":"Obama: \"shame on us if we've forgotten\" Newtown massacre","date":"Thu Mar 28 10:07:23 MDT 2013"},{"aspect":"self_created","tweet":"Obama, asked how he is feeling about his bracket for men's college basketball, says in Oval Office: \"busted!\"","date":"Wed Mar 27 13:19:32 MDT 2013"},{"aspect":"self_created","tweet":"Unclear why the White House can't or won't say when its budget rollout will occur.","date":"Wed Mar 27 11:12:35 MDT 2013"},{"aspect":"self_created","tweet":"White House's Josh Earnest slips and says budget will be released on April 8, then corrects himself to say it will be that week.","date":"Wed Mar 27 11:11:38 MDT 2013"},{"aspect":"self_created","tweet":"White House says is encouraged by progress on immigration reform, reserving judgment on Gang of 8 work","date":"Wed Mar 27 10:48:29 MDT 2013"},{"aspect":"self_created","tweet":"Biden: I'm not surprised I became Vice President, I am surprised to be in the Irish hall of fame.","date":"Thu Mar 21 12:54:05 MDT 2013"},{"aspect":"self_created","tweet":"Biden, during speech in New York, says KKK was not just aimed at blacks but also Catholics","date":"Thu Mar 21 12:44:00 MDT 2013"},{"aspect":"self_created","tweet":"RT @pfeiffer44: Been to hundreds if not thousands of Obama speeches over the last six years and there is a unique electricity in the hal ...","date":"Thu Mar 21 09:19:18 MDT 2013"},{"aspect":"self_created","tweet":"Obama says the only thing that could keep Joe Biden away from St Patrick's Day at the White House is the installation of a new pope.","date":"Tue Mar 19 15:50:16 MDT 2013"},{"aspect":"self_created","tweet":"Link to my cabinet story, Zients will not become U.S. Trade chief: http://t.co/MLsth78Jlr","date":"Tue Mar 19 08:53:32 MDT 2013"},{"aspect":"self_created","tweet":"Am reporting that Obama asked Jeff Zients to stay on as acting budget director, taking him out of the running to become US trade chief","date":"Tue Mar 19 07:59:47 MDT 2013"},{"aspect":"self_created","tweet":"Lentil Vegetable Soup and Broiled Sea Bass was served at the White House lunch with Obama, Ryan and Van Hollen. Also roasted veggie ragu","date":"Thu Mar 07 13:20:22 MST 2013"},{"aspect":"self_created","tweet":"@PressSec Carney says WH is disappointed sequester has led to a temporary suspension of White House tours, including for Iowa 6th graders","date":"Thu Mar 07 11:34:25 MST 2013"},{"aspect":"self_created","tweet":"A link to my story about Brian Deese, who sources tell me is in the running for deputy director of OMB: http://t.co/EgdkbAZvWu","date":"Mon Mar 04 17:11:23 MST 2013"},{"aspect":"self_created","tweet":"Am reporting that White House economic adviser Brian Deese is a leading candidate to become deputy director of OMB","date":"Mon Mar 04 16:03:01 MST 2013"},{"aspect":"self_created","tweet":"Obama will nominate McCarthy to lead EPA and Moniz to lead Energy Dept today, a White House official says","date":"Mon Mar 04 05:07:08 MST 2013"},{"aspect":"self_created","tweet":"Am reporting with @steveholland1 that Obama to announce his choice of Walmart Foundation head Sylvia Mathews Burwell as OMB director Monday","date":"Sun Mar 03 13:44:03 MST 2013"},{"aspect":"self_created","tweet":"2 minute warning until the start of Obama's remarks","date":"Fri Mar 01 09:37:50 MST 2013"},{"aspect":"self_created","tweet":"Looks like the meeting did not go well. Obama is going to make a statement at 11:35. Boehner already spoke to reporters.","date":"Fri Mar 01 09:23:21 MST 2013"},{"aspect":"self_created","tweet":"The meeting over the sequester at the White House has officially started.","date":"Fri Mar 01 08:26:03 MST 2013"},{"aspect":"self_created","tweet":"All the leaders are at the White House now, but no word yet on whether the talks have begun officially.","date":"Fri Mar 01 08:18:56 MST 2013"},{"aspect":"self_created","tweet":"Still waiting on Boehner and then the festivities begin.","date":"Fri Mar 01 08:04:15 MST 2013"},{"aspect":"self_created","tweet":"It appears as though Biden is just arriving at the White House, barely in time for the 10:05 sequester meeting.","date":"Fri Mar 01 08:03:36 MST 2013"},{"aspect":"self_created","tweet":"Didn't see that one coming. Michelle Obama is introducing the Best Picture category for the Oscars from the White House","date":"Sun Feb 24 21:59:43 MST 2013"},{"aspect":"self_created","tweet":"Am reporting that Obama to pick Gina McCarthy to lead EPA, Ernest Moniz to be Energy Secretary as early as this week","date":"Wed Feb 20 10:20:55 MST 2013"},{"aspect":"self_created","tweet":"Hmmm. Are Obama's daughters dating? Potus refers to \"dates\" as something that parents of younger children can look forward to","date":"Thu Feb 14 11:43:05 MST 2013"},{"aspect":"self_created","tweet":"Obama says time outs, quiet time might help people in Washington learn how to play better together","date":"Thu Feb 14 11:38:56 MST 2013"},{"aspect":"self_created","tweet":"Obama jokes its easier to get the First Lady flowers on Valentine's Day because he has the White House Rose Garden","date":"Thu Feb 14 11:31:32 MST 2013"},{"aspect":"self_created","tweet":"Bo the dog was outside when reporters at the White House came out for Obama's arrival but didn't stay to wait for his master","date":"Wed Feb 13 12:21:53 MST 2013"},{"aspect":"self_created","tweet":"Lots of Obama references to his own retirement in this Asheville speech. Talks about getting a place there someday, needing interview tips","date":"Wed Feb 13 10:31:05 MST 2013"},{"aspect":"self_created","tweet":"Obama: this is not the first time the US has debated gun control, but this time is different","date":"Tue Feb 12 20:09:06 MST 2013"},{"aspect":"self_created","tweet":"Boehner releases statement that Obama let opportunity \"slip by\" on economic solutions. Obama is still speaking, Boehner sitting behind him.","date":"Tue Feb 12 20:07:09 MST 2013"},{"aspect":"self_created","tweet":"One of the biggest proposals in Obama's State of the Union Address: raising the minimum wage to $9 an hour","date":"Tue Feb 12 19:24:15 MST 2013"},{"aspect":"self_created","tweet":"Steven Chu, energy secretary, is the cabinet official staying behind tonight and not attending the state of the union address.","date":"Tue Feb 12 18:09:11 MST 2013"},{"aspect":"self_created","tweet":"Jay Carney confirms Obama will do 14 Democratic fundraisers this year","date":"Thu Feb 07 08:31:56 MST 2013"},{"aspect":"self_created","tweet":"Obama says those of us with the most power should be the most humble","date":"Thu Feb 07 07:22:16 MST 2013"},{"aspect":"self_created","tweet":"Obama has work/life balance issues too: says at prayer bkfst he struggles to mix being a president with being a husband and father","date":"Thu Feb 07 07:21:34 MST 2013"},{"aspect":"self_created","tweet":"Obama says too often leaders leave the national prayeer breakfast and forget what was said there","date":"Thu Feb 07 07:17:13 MST 2013"},{"aspect":"self_created","tweet":"Obama says division in the US are not as deep as when Lincoln led, but they are real","date":"Thu Feb 07 07:15:11 MST 2013"},{"aspect":"self_created","tweet":"Obama: it's true that my daughters are gorgeous, that's because my wife is gorgeous","date":"Thu Feb 07 07:06:10 MST 2013"},{"aspect":"self_created","tweet":"RT @ahmannt: Exclusive: Obama considering MIT physicist Moniz for energy secretary - sources http://t.co/seEN0sul","date":"Thu Feb 07 05:45:46 MST 2013"},{"aspect":"self_created","tweet":"RT @ahmannt: Zients, Pritzker top candidates for trade and commerce jobs http://t.co/QLPRM3EH","date":"Thu Feb 07 05:45:34 MST 2013"},{"aspect":"self_created","tweet":"RT @petermaercbs: Pres. and Mrs. Obama & VP Biden attend Natl. Prayer Breakfast this morning...one of those rare DC events where eve ...","date":"Thu Feb 07 05:44:38 MST 2013"},{"aspect":"self_created","tweet":"Am reporting with @robertarampton that MIT physicist Ernest Moniz is under consideration for energy secretary","date":"Wed Feb 06 19:14:07 MST 2013"},{"aspect":"self_created","tweet":"Am reporting that OMB deputy director Jeffrey Zients is front runner for US Trade Representative, Penny Pritzker considered for Commerce","date":"Wed Feb 06 16:23:46 MST 2013"},{"aspect":"self_created","tweet":"Obama and Salazar seem to be going out of their way to make expressions of friendship and devotion at this ceremony","date":"Wed Feb 06 12:17:06 MST 2013"},{"aspect":"self_created","tweet":"Obama says, unlike his Interior secretary nominee, he would never think of wanting to hike in Antarctica","date":"Wed Feb 06 12:15:07 MST 2013"},{"aspect":"self_created","tweet":"RT @steveholland1: Pres Obama will not carry with him to Israel a new Middle East peace process proposal when he goes this spring, WH's  ...","date":"Wed Feb 06 10:27:54 MST 2013"},{"aspect":"self_created","tweet":"RT @ZekeJMiller: Q: Civilians have been killed. Carney: “I don’t disagree with that.”","date":"Wed Feb 06 10:27:40 MST 2013"},{"aspect":"self_created","tweet":"Obama to meet with CEOs from Goldman Sachs, Motorola Solutions, Marriott, Yahoo, United Continental, Alcoa on immigration, deficts Tuesday","date":"Mon Feb 04 15:38:48 MST 2013"},{"aspect":"self_created","tweet":"Something to pass the time until the Super Bowl lights return: Obama encourages Boy Scouts to end ban on gays http://t.co/J0M3vuoR","date":"Sun Feb 03 18:59:49 MST 2013"},{"aspect":"self_created","tweet":"RT @KennethBaer: And 100 million Americans suddenly learn what it's like to be in Chevy Chase in a rainstorm. #SuperBowl2013 brought to  ...","date":"Sun Feb 03 18:47:21 MST 2013"},{"aspect":"self_created","tweet":"Ha, love it @KennethBaer","date":"Sun Feb 03 18:47:03 MST 2013"},{"aspect":"self_created","tweet":"Super Bowl singers Jennifer Hudson and Alicia Keys both performed at Obama's inaugural balls","date":"Sun Feb 03 16:28:43 MST 2013"},{"aspect":"self_created","tweet":"The Obamas are serving beers from the two cities competing in the Super Bowl at a private White House watching party today","date":"Sun Feb 03 15:57:50 MST 2013"},{"aspect":"self_created","tweet":"@Citizen_Chad done, thanks man","date":"Sat Feb 02 17:37:57 MST 2013"},{"aspect":"self_created","tweet":"My twitter account was hacked, sorry for the weird tweet. Please don't open that link that was sent. Should be fixed now","date":"Sat Feb 02 17:36:57 MST 2013"},{"aspect":"self_created","tweet":"The Fastest Way To Lose BodyFat in (2)Weeks http://t.co/pxiArBaw","date":"Sat Feb 02 15:00:33 MST 2013"},{"aspect":"self_created","tweet":"@Daroswene correct","date":"Sat Feb 02 13:04:48 MST 2013"},{"aspect":"self_created","tweet":"@drewhjohnston bingo!","date":"Sat Feb 02 13:04:23 MST 2013"},{"aspect":"self_created","tweet":"Am reporting today that President Obama is leaning toward picking Gina McCarthy to be EPA administrator","date":"Fri Feb 01 13:54:38 MST 2013"},{"aspect":"self_created","tweet":"Check out my story on a leading cabinet for Labor Secretary: http://t.co/LihiXH5i","date":"Thu Jan 31 17:34:20 MST 2013"},{"aspect":"self_created","tweet":"@PressSec Carney definitely trying to play down implications of appeals court ruling on NLRB recess appointments","date":"Fri Jan 25 12:07:52 MST 2013"},{"aspect":"self_created","tweet":"Obama pays tribute to young campaign staffer who died during his campaign","date":"Tue Jan 22 19:21:20 MST 2013"},{"aspect":"self_created","tweet":"Obama tells them, you can't stop now; jokes that some of them have to return to school","date":"Tue Jan 22 19:17:17 MST 2013"},{"aspect":"self_created","tweet":"Obama tells folks at staff ball: this weekend belonged to you","date":"Tue Jan 22 19:16:31 MST 2013"},{"aspect":"self_created","tweet":"Obama says at staff ball: thank you to his team","date":"Tue Jan 22 19:11:51 MST 2013"},{"aspect":"self_created","tweet":"Interesting tweak on gay marriage support from @PressSec Carney, who says Obama support is for civil marriage not religious sacrament","date":"Tue Jan 22 10:14:30 MST 2013"},{"aspect":"self_created","tweet":"@CableGuyG it does indeed!","date":"Mon Jan 21 10:20:00 MST 2013"},{"aspect":"self_created","tweet":"@the_Jeff_Jones yes, and he gave it several lines in this speech","date":"Mon Jan 21 10:17:28 MST 2013"},{"aspect":"self_created","tweet":"Definitely the best rendition of \"My country tis of thee\" this reporter has ever heard","date":"Mon Jan 21 10:16:45 MST 2013"},{"aspect":"self_created","tweet":"Obama is hitting lots of campaign notes in this speech: shout-outs to gay marriage (without using the word), immigration reform, gun control","date":"Mon Jan 21 10:09:07 MST 2013"},{"aspect":"self_created","tweet":"Eric Shinseki is the cabinet official who is staying back today and not attending the inaugural ceremonies, according to a WH official","date":"Mon Jan 21 09:45:42 MST 2013"},{"aspect":"self_created","tweet":"Obama and motorcade are on the way to the Capitol for his second swearing in","date":"Mon Jan 21 08:45:15 MST 2013"},{"aspect":"self_created","tweet":"Obama says, addressing \"most significant event\" of the weekend: he likes Michelle's bangs","date":"Sun Jan 20 18:57:57 MST 2013"},{"aspect":"self_created","tweet":"@kentnish I found you! Great to see you in Hawaii. Take care and stay in touch.","date":"Thu Jan 17 16:50:02 MST 2013"},{"aspect":"self_created","tweet":"@PressSec Carney wades into dangerous sports territory, says Redskins QB did not look like he should still be playing at end of last game","date":"Wed Jan 09 13:16:04 MST 2013"},{"aspect":"self_created","tweet":"Greetings from the press pool house in Honolulu. Here's a link to a story about Obama's radio address: http://t.co/nEyw5tSF","date":"Sat Jan 05 13:43:40 MST 2013"},{"aspect":"self_created","tweet":"@PressSec Carney says Obama's shift, changing his tax increase threshold to $400,000 is not a broken promise","date":"Tue Dec 18 10:50:19 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama has boarded Air Force One for the flight to Connecticut. Will be a difficult night.","date":"Sun Dec 16 13:08:33 MST 2012"},{"aspect":"self_created","tweet":"Obama, at White House Hanukkah reception, says US stands by its ally Israel during these difficult times.","date":"Thu Dec 13 17:51:54 MST 2012"},{"aspect":"self_created","tweet":"The Obama-Boehner meeting at the White House just ended","date":"Thu Dec 13 16:04:46 MST 2012"},{"aspect":"self_created","tweet":"Boehner to meet with Obama at White House around 5 pm tonight - WH official","date":"Thu Dec 13 13:36:18 MST 2012"},{"aspect":"self_created","tweet":"Jay Carney says Republicans are using \"fantasy economics.\" Says making Bush tax cuts permanent is not negotiable and \"not happening.\"","date":"Thu Dec 13 11:12:36 MST 2012"},{"aspect":"self_created","tweet":"Moment of honesty from Jay Carney at today's briefing on the fiscal cliff, saying he was trying to be opaque. Reporter reply: its working.","date":"Tue Dec 11 12:35:29 MST 2012"},{"aspect":"self_created","tweet":"RT @whitehouse: hey guys - this is barack.  ready to answer your questions on fiscal cliff & #my2k.  Let's get started. -bo","date":"Mon Dec 03 12:06:57 MST 2012"},{"aspect":"self_created","tweet":"@aepton hey there, sorry I missed this tweet. Tell John I say hi. Happy to chat about Medill anytime. Want to give me a ring?","date":"Thu Nov 29 12:16:13 MST 2012"},{"aspect":"self_created","tweet":"@revsusanrussell Very belated thanks for this shout-out!","date":"Thu Nov 29 12:14:25 MST 2012"},{"aspect":"self_created","tweet":"Jay Carney talks about \"chewy\" policy debates when asked about how the president will sell his fiscal plans. That's a mouthful.","date":"Mon Nov 26 13:18:33 MST 2012"},{"aspect":"self_created","tweet":"Belatedely, @robertarampton, thanks and right back at you.","date":"Mon Nov 26 13:17:12 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama has arrived on AF1 back in the US after a quick trip to Asia","date":"Tue Nov 20 22:38:18 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama, after refueling in Japan, is wheels up on AF1 for DC","date":"Tue Nov 20 10:42:33 MST 2012"},{"aspect":"self_created","tweet":"After refueling stop in Germany, @BarackObama is wheels up on AF1 for Thailand","date":"Sat Nov 17 14:48:18 MST 2012"},{"aspect":"self_created","tweet":"Obama has taken off for Asia","date":"Sat Nov 17 06:20:08 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama tells volunteers on campaign call that he plans to get out of DC more in his second term. \"I love you\" he tells them.","date":"Tue Nov 13 18:52:16 MST 2012"},{"aspect":"self_created","tweet":"Didn't see that one coming: Jay Carney says, tongue in cheek, that Jim Messina and Bono -- who were both at the WH -- are forming a band","date":"Tue Nov 13 11:48:23 MST 2012"},{"aspect":"self_created","tweet":"Jay Carney says: if nothing else this year, we've earned credibility that we know our arithmetic","date":"Tue Nov 13 11:43:20 MST 2012"},{"aspect":"self_created","tweet":"Tune in to MSNBC today at 12:00 ET. Looking forward to being on panel with @NowWithAlex","date":"Fri Nov 09 09:13:38 MST 2012"},{"aspect":"self_created","tweet":"Axelrod says if he were a billionaire who had donated to Republican Super PACs, he want his money back. \"You can't buy the White House.\"","date":"Thu Nov 08 12:27:22 MST 2012"},{"aspect":"self_created","tweet":"Messina says sometime today expects @BarackObama to be officially the winner in Florida","date":"Thu Nov 08 12:14:03 MST 2012"},{"aspect":"self_created","tweet":"Messina congratulates Team Romney on a hard fought campaign, wishes them sleep and time with family.","date":"Thu Nov 08 12:12:50 MST 2012"},{"aspect":"self_created","tweet":"AF1 Colonel and crew gave @BarackObama a sheet cake as congratulations for his re-election on flight from Chicago to Andrews","date":"Wed Nov 07 16:24:36 MST 2012"},{"aspect":"self_created","tweet":"Obama is wheels up for DC","date":"Wed Nov 07 14:50:47 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama just arrived at his campaign headquarters in Chicago, presumably to give a lot of hugs and say thanks.","date":"Wed Nov 07 12:55:22 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama has arrived at the convention center","date":"Tue Nov 06 23:29:23 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama is on his way to the McCormick center in Chicago to give his victory speech","date":"Tue Nov 06 23:11:07 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama congratulates Mitt Romney on a \"spirited campaign\"","date":"Tue Nov 06 08:13:41 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama gets voice mail for one of his campaign calls. \"Talk to you soon,\" he says in the message.","date":"Tue Nov 06 08:06:26 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama making calls from local campaign office in Chicago http://t.co/UZm9nAgt","date":"Tue Nov 06 08:03:03 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama says \"Hopefully we'll have a good day\" during call at local Chicago campaign office","date":"Tue Nov 06 08:01:54 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama wipes away tears from his eyes during final campaign rally in Iowa","date":"Mon Nov 05 21:18:52 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama lands in Iowa for his final rally of the 2012 campaign, and his final rally as a candidate, going back to where it started.","date":"Mon Nov 05 19:59:39 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama thanks a line of folks at Ohio stadium who organized the event.","date":"Mon Nov 05 17:08:03 MST 2012"},{"aspect":"self_created","tweet":"Stevie Wonder sings live version of \"Signed Sealed Delivered\" as Obama finishes his rally in Ohio. Obama stays on stage a bit to sing along","date":"Sun Nov 04 18:58:44 MST 2012"},{"aspect":"self_created","tweet":"Police are forcibly removing the heckler. Obama: \"Let me try this again.\"","date":"Sun Nov 04 18:28:57 MST 2012"},{"aspect":"self_created","tweet":"Crowd is drowning out a heckler at Obama rally in Ohio","date":"Sun Nov 04 18:27:52 MST 2012"},{"aspect":"self_created","tweet":"\"Don't stop thinking about tomorrow\" is the closing song at Obama rally. Another nod to Bill Clinton...","date":"Sun Nov 04 09:33:03 MST 2012"},{"aspect":"self_created","tweet":"Some 14,000 people at @BarackObama rally in New Hampshire","date":"Sun Nov 04 09:25:42 MST 2012"},{"aspect":"self_created","tweet":"@carenbohan Thanks you two!","date":"Sun Nov 04 09:07:39 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama and President Bill Clinton have brief hug after after Clinton introduces Potus in New Hampshire","date":"Sun Nov 04 09:06:39 MST 2012"},{"aspect":"self_created","tweet":"Hey @noahbarkin, we landed in Manchester and the rally is in Concord","date":"Sun Nov 04 07:44:24 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama and President Bill Clinton share a limo en route to first event of the day in NH http://t.co/yESbmHM5","date":"Sun Nov 04 07:42:18 MST 2012"},{"aspect":"self_created","tweet":"@noahbarkin New Hampshire","date":"Sun Nov 04 06:35:29 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama boarding AF1. http://t.co/3ssD2TUT","date":"Sun Nov 04 06:34:26 MST 2012"},{"aspect":"self_created","tweet":"President Bill Clinton is also on board for the trip to New Hampshire","date":"Sun Nov 04 06:29:00 MST 2012"},{"aspect":"self_created","tweet":"@BarackObama has boarded Air Force One for his final flight from Andrews before the election.","date":"Sun Nov 04 06:27:57 MST 2012"},{"aspect":"self_created","tweet":"Obama: millionaires and billionaires aren't going to go to the poor house if they have to pay more taxes.","date":"Fri Nov 02 11:42:14 MDT 2012"},{"aspect":"self_created","tweet":"Obama to Ohio crowd: \"you know I tell the truth\"","date":"Fri Nov 02 11:36:26 MDT 2012"},{"aspect":"self_created","tweet":"New twist to Obama's \"don't boo, vote!\" line: in Ohio just now, he said \"voting's the best revenge.\"","date":"Fri Nov 02 11:30:50 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama makes only brief reference to jobs figures at campaign rally in Ohio.","date":"Fri Nov 02 08:56:58 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama notes that even some people in Ohio and Michigan opposed the auto bailout at the time.","date":"Thu Nov 01 20:02:02 MDT 2012"},{"aspect":"self_created","tweet":"As Obama repeats his line \"that's not change\", referring to Romney's proposals, crowd in Boulder responds in unison: \"Chump change!\"","date":"Thu Nov 01 20:01:02 MDT 2012"},{"aspect":"self_created","tweet":"Some 10,000 people at the @BarackObama rally in CO. After smaller crowds earlier today, this feels a little more like 2008.","date":"Thu Nov 01 19:48:52 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama boarding AF1 for his first campaign trip since the storm http://t.co/zkAzitNo","date":"Thu Nov 01 07:45:34 MDT 2012"},{"aspect":"self_created","tweet":"Asked why Obama campaign is putting up ads in Michigan, Axelrod says they had a contingency fund to put up ads so as not to cede any state.","date":"Wed Oct 31 09:27:09 MDT 2012"},{"aspect":"self_created","tweet":"Messina: Romney campaign said it would talk about the issues, instead they are flailing with false attacks about autos, welfare","date":"Wed Oct 31 09:21:20 MDT 2012"},{"aspect":"self_created","tweet":"Messina on his counterparts at Romney campaign in Boston: \"This 'Hail Mary' isn't going to work.\"","date":"Wed Oct 31 09:17:27 MDT 2012"},{"aspect":"self_created","tweet":"Jim Messina on Obama's campaign vs Romney's: \"We have they math, and they have the myth.\"","date":"Wed Oct 31 09:13:22 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama's advisers must have judged that tomorrow will still be too early to be out on the trail, better to be presidential from DC","date":"Tue Oct 30 09:34:21 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama cancels another day of campaigning in Ohio to stay in Washington and oversee storm response efforts.","date":"Tue Oct 30 09:32:53 MDT 2012"},{"aspect":"self_created","tweet":"@davidaxelrod says North Carolina is absolutely still in play in the Nov 6 election","date":"Mon Oct 29 09:30:32 MDT 2012"},{"aspect":"self_created","tweet":"@Messina2012 says calling Romney's bluff in North Carolina: the race there, he says, is tied.","date":"Mon Oct 29 09:20:55 MDT 2012"},{"aspect":"self_created","tweet":"AF1 has landed at Andrews, spraying water on the runway as it did. Obama will now head to the White House.","date":"Mon Oct 29 08:30:22 MDT 2012"},{"aspect":"self_created","tweet":"Obama, after coming to Florida last night, cancels campaign event here this morning to return to DC before the storm","date":"Mon Oct 29 04:55:35 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama gets someone on phone at Florida campaign office. \"Is this Ann?\" he asks. Turns out its a wrong number. He hangs up.","date":"Sun Oct 28 18:56:25 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama says, during stop at OFA office in Florida, that he will not be able to campaign as much in coming days because of the storm.","date":"Sun Oct 28 18:53:52 MDT 2012"},{"aspect":"self_created","tweet":"It was windy already at Joint Base Andrews. AF1 is taxiing now with @BarackObama for Florida for a quick trip before the storm.","date":"Sun Oct 28 15:55:32 MDT 2012"},{"aspect":"self_created","tweet":"Obama heads to FEMA today for briefing on Hurricane Sandy. Expect him to look presidential as storm approaches in lieu of some campaigning","date":"Sun Oct 28 09:51:11 MDT 2012"},{"aspect":"self_created","tweet":"A poll worker helping the president suddenly has his cell phone ring. Asked if that was his wife, Obama advises to always take that call","date":"Thu Oct 25 15:21:22 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama says he's glad he remembered his drivers license; poll worker studies it closely.","date":"Thu Oct 25 15:16:17 MDT 2012"},{"aspect":"self_created","tweet":"At early voting facility in Chicago, poll worker asks to see President Barack Obama's i.d.","date":"Thu Oct 25 15:14:41 MDT 2012"},{"aspect":"self_created","tweet":"Hoarse Obama tells Florida crowd: I know you're sick of all he TV ads...except the one that I'm in.","date":"Thu Oct 25 07:05:39 MDT 2012"},{"aspect":"self_created","tweet":"After leaving Krispy Kreme, Obama delivers donuts to a local Florida fire station","date":"Thu Oct 25 05:23:56 MDT 2012"},{"aspect":"self_created","tweet":"\"Let the president buy these guys donuts,\" Obama says to a father with two little boys","date":"Thu Oct 25 05:14:32 MDT 2012"},{"aspect":"self_created","tweet":"After overnight flight on Air Force One, @BarackObama is stopping at Krispy Kreme for donuts...","date":"Thu Oct 25 05:13:14 MDT 2012"},{"aspect":"self_created","tweet":"A picture of the plane this morning before Potus and team boarded http://t.co/f8CLvkLQ","date":"Wed Oct 24 06:22:44 MDT 2012"},{"aspect":"self_created","tweet":"Air Force One is taking off for Obama's 2-day, 8-state tour.","date":"Wed Oct 24 06:21:42 MDT 2012"},{"aspect":"self_created","tweet":"We're at the point in the campaign for hair jokes. One of the differences between Romney and Obama: Potus says Mitt has better hair.","date":"Tue Oct 23 14:12:32 MDT 2012"},{"aspect":"self_created","tweet":"Obama, after saying at the debate that Biden had opposed some of his forpol positions, says at rally no one gives better advice than his VP","date":"Tue Oct 23 14:10:09 MDT 2012"},{"aspect":"self_created","tweet":"Joe Biden says couldn't tell from last night's debate whether @MittRomney wanted to oppose or endorse @BarackObama","date":"Tue Oct 23 14:04:18 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama is back at his hotel after a strong debate.","date":"Mon Oct 22 20:55:25 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama and @MittRomney and their families seem to be having a friendly conversation on the stage","date":"Mon Oct 22 20:36:49 MDT 2012"},{"aspect":"self_created","tweet":"Both @BarackObama and @MittRomney give strong closing statements at the final #debate.","date":"Mon Oct 22 20:33:27 MDT 2012"},{"aspect":"self_created","tweet":"@MittRomney mentions voters in Wisconsin and Pennsylvania at the debate in a play for those two states.","date":"Mon Oct 22 20:29:02 MDT 2012"},{"aspect":"self_created","tweet":"@MittRomney mentions the number of nuclear warheads that Britain has when talking about Pakistan.","date":"Mon Oct 22 20:06:02 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama namecheks his VP, Joe Biden, as not always agreeing with him on foreign policy. Does that make Biden look weak?","date":"Mon Oct 22 20:04:47 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama strategy on Romney: paint him as \"all over the map\" on foreign policy.","date":"Mon Oct 22 20:02:18 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama gives strong rebuttal about Israel trip, talks about going there as a candidate and notes he didn't bring donors on his trip.","date":"Mon Oct 22 19:57:57 MDT 2012"},{"aspect":"self_created","tweet":"@MittRomney explains to @BarackObama why he called the Potus trip an apology tour, and knocks him for not going to Israel.","date":"Mon Oct 22 19:57:12 MDT 2012"},{"aspect":"self_created","tweet":"#Obama doesn't use the word lie, but comes close. Says @MittRomney's accusation that he made an apology tour is biggest whopper of campaign","date":"Mon Oct 22 19:55:31 MDT 2012"},{"aspect":"self_created","tweet":"Obama says NyTimes report that US, Iran agreed in principle to one on one talks is not true.","date":"Mon Oct 22 19:50:40 MDT 2012"},{"aspect":"self_created","tweet":"Obama says Romney hasn't spent time looking at how military works. Says with condescension that US has things called aircraft carriers.","date":"Mon Oct 22 19:46:52 MDT 2012"},{"aspect":"self_created","tweet":"@MittRomney also turns the debate to a discussion of the economy, mentions high unemployment","date":"Mon Oct 22 19:33:56 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama finds a way to get auto industry (read: Ohio) into a foreign policy debate.","date":"Mon Oct 22 19:32:23 MDT 2012"},{"aspect":"self_created","tweet":"It's a competition of list-making! Both @BarackObama and @MittRomney are speaking in ones, twos, and threes to make their points.","date":"Mon Oct 22 19:15:56 MDT 2012"},{"aspect":"self_created","tweet":"Obama knocks Romney for saying Russia was the biggest U.S. geopolitical foe, says the Cold War has been over for years","date":"Mon Oct 22 19:11:40 MDT 2012"},{"aspect":"self_created","tweet":"@MittRomney seeks to neutralize Obama's having presided over the killing of Osama bin Laden, saying U.S. can't kill itself out of this mess","date":"Mon Oct 22 19:08:37 MDT 2012"},{"aspect":"self_created","tweet":"Body language: @BarackObama is looking closely at @MittRomney as he speaks, not looking down or at his notes.","date":"Mon Oct 22 19:06:09 MDT 2012"},{"aspect":"self_created","tweet":"Obama and Romney shake hands, lean heads very closely to each other as they come in to the debate hall.","date":"Mon Oct 22 19:02:45 MDT 2012"},{"aspect":"self_created","tweet":"The debate hall is completely silent, except for some TV folks. Tense waiting for the candidates to come in","date":"Mon Oct 22 19:00:14 MDT 2012"},{"aspect":"self_created","tweet":"@bobschieffer is telling the audience in the debate hall that he is honored to be the moderator.","date":"Mon Oct 22 18:53:42 MDT 2012"},{"aspect":"self_created","tweet":"@MichelleObama just took her seat in the debate hall, Looks like she's in the front row, on the left side.","date":"Mon Oct 22 18:45:03 MDT 2012"},{"aspect":"self_created","tweet":"A view of the debate hall from the back where pool reporters are sitting. http://t.co/ryrE80V5","date":"Mon Oct 22 18:43:12 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama has arrived at the debate site.","date":"Mon Oct 22 18:29:09 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama's motorcade is driving past some cheering supporters on the road to the university. So far, more Dems than Repubs are out.","date":"Mon Oct 22 18:19:47 MDT 2012"},{"aspect":"self_created","tweet":"Getting close to getting started. @BarackObama has left the hotel and is on the way to the debate site.","date":"Mon Oct 22 18:17:53 MDT 2012"},{"aspect":"self_created","tweet":"It's steak and potatoes again! A campaign aide for @BarackObama says he'll repeat the menu he had with wife Michelle before the last debate.","date":"Mon Oct 22 14:03:10 MDT 2012"},{"aspect":"self_created","tweet":"Air Force One has landed in Florida. Game on for @BarackObama.","date":"Mon Oct 22 11:25:42 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama has boarded AF1 and is headed to Florida for the final debate against Mitt Romney.","date":"Mon Oct 22 09:21:45 MDT 2012"},{"aspect":"self_created","tweet":"Two White House aides just high-fived as they boarded Air Force One.","date":"Tue Oct 16 22:03:15 MDT 2012"},{"aspect":"self_created","tweet":"Obama has finally left the debate site and headed to his helicopter, a good hour behind schedule.","date":"Tue Oct 16 21:48:26 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama must be pleased with how he did tonight. He lingered much longer on the stage afterwards and hasn't head to the airport yet.","date":"Tue Oct 16 21:22:53 MDT 2012"},{"aspect":"self_created","tweet":"It's' 10:30 p.m eastern. This debate is going into overtime, literally.","date":"Tue Oct 16 20:30:35 MDT 2012"},{"aspect":"self_created","tweet":"Romney also a little wordy at the end.","date":"Tue Oct 16 20:29:44 MDT 2012"},{"aspect":"self_created","tweet":"After being disciplined at being concise at the beginning of the debate, Obama gets a little less disciplined at the end.","date":"Tue Oct 16 20:26:24 MDT 2012"},{"aspect":"self_created","tweet":"Romney jabs Obama for going on a political trip right after the U.S. ambassador to Libya was killed.","date":"Tue Oct 16 20:13:39 MDT 2012"},{"aspect":"self_created","tweet":"Obama neutralized a potential attack from Romney by saying the buck stops with him on the Libya tragedy.","date":"Tue Oct 16 20:12:04 MDT 2012"},{"aspect":"self_created","tweet":"Obama is speaking in lists during this debate...a lot like Romney did in the first one.","date":"Tue Oct 16 20:10:25 MDT 2012"},{"aspect":"self_created","tweet":"Romney compares Obama unfavorably to Reagan on getting unemployment down. Red meat for his conservative base.","date":"Tue Oct 16 19:57:41 MDT 2012"},{"aspect":"self_created","tweet":"Romney reaches out to women, mentions poverty levels for women specifically.","date":"Tue Oct 16 19:31:53 MDT 2012"},{"aspect":"self_created","tweet":"Obama gets it in to the conversation that Romney makes $20 million a year","date":"Tue Oct 16 19:29:40 MDT 2012"},{"aspect":"self_created","tweet":"Clear strategy from Romney: keep mentioning middle class has been buried. He doesnt' need to quote Biden for people to know the allusion","date":"Tue Oct 16 19:27:14 MDT 2012"},{"aspect":"self_created","tweet":"Crowd laughs when Obama says conceivable that Romney could bring gas prices down because his policies would put the economy back in a mess","date":"Tue Oct 16 19:22:14 MDT 2012"},{"aspect":"self_created","tweet":"Romney just as feisty as Obama. Debate is getting testy.","date":"Tue Oct 16 19:20:40 MDT 2012"},{"aspect":"self_created","tweet":"Very clear tactic here from Obama. In his next rebuttal, he says again that very little that Romney said is true.","date":"Tue Oct 16 19:17:37 MDT 2012"},{"aspect":"self_created","tweet":"You can tell that Obama has practiced being concise. It's showing.","date":"Tue Oct 16 19:14:37 MDT 2012"},{"aspect":"self_created","tweet":"On energy, Obama says Romney will let oil and gas companies write U.S. energy policy. Gets an attack in right after going over his policy","date":"Tue Oct 16 19:14:10 MDT 2012"},{"aspect":"self_created","tweet":"Obama very feisty. Says Obama doesn't have a five point plan, he has a one point plan.","date":"Tue Oct 16 19:10:33 MDT 2012"},{"aspect":"self_created","tweet":"So much for no follow-ups. Candy Crowley asks a question right after the first questioner.","date":"Tue Oct 16 19:09:48 MDT 2012"},{"aspect":"self_created","tweet":"Obama, in a much more energetic style than last debate, goes through a lot of his talking points in his first answer. Energy. Cars. Taxes.","date":"Tue Oct 16 19:08:41 MDT 2012"},{"aspect":"self_created","tweet":"Obama gets into his first answer the fact that Gov. Romney said \"Let Detoit go bankrupt.\"","date":"Tue Oct 16 19:06:46 MDT 2012"},{"aspect":"self_created","tweet":"Romney asks questioner, Jeremy, when he will graduate. 2014 is the answer. Romney says he expects to be president then.","date":"Tue Oct 16 19:06:19 MDT 2012"},{"aspect":"self_created","tweet":"Romney starts walking toward first questioner. He won coin toss, so gets to give the first answer.","date":"Tue Oct 16 19:03:57 MDT 2012"},{"aspect":"self_created","tweet":"Obama goes straight for his stool after shaking hands with Romney","date":"Tue Oct 16 19:03:10 MDT 2012"},{"aspect":"self_created","tweet":"CNN's Candy Crowley says her goal is to make sure questions at the debate get answered.","date":"Tue Oct 16 19:02:22 MDT 2012"},{"aspect":"self_created","tweet":"Pretty much complete silence in the debate hall as the crowd waits for the final three minutes before the canidates come on stage.","date":"Tue Oct 16 18:57:32 MDT 2012"},{"aspect":"self_created","tweet":"Crowd claps as Ann Romney and Michelle Obama are introduced","date":"Tue Oct 16 18:51:27 MDT 2012"},{"aspect":"self_created","tweet":"Former Clinton press second Mike McCurry told the crowd no tweeting and no participating in the Pizza Hut challenge","date":"Tue Oct 16 18:45:06 MDT 2012"},{"aspect":"self_created","tweet":"Inside the debate hall, members of the presidential debate commission are admonishing the crowd behind the group of undecideds to keep quiet","date":"Tue Oct 16 18:44:04 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama's limo is parked and he is headed into the building at Hofstra University for Round Two with Romney.","date":"Tue Oct 16 18:22:45 MDT 2012"},{"aspect":"self_created","tweet":"It's on. @BarackObama has left the hotel and is on his way to the debate site.","date":"Tue Oct 16 18:08:22 MDT 2012"},{"aspect":"self_created","tweet":"Obama is doing last minute debate prep this afternoon, then hanging with friends. Dinner with Michelle tonight: steak and potatoes.","date":"Tue Oct 16 13:07:35 MDT 2012"},{"aspect":"self_created","tweet":"Big news flash: @BarackObama had pasta with chicken for lunch","date":"Tue Oct 16 13:06:25 MDT 2012"},{"aspect":"self_created","tweet":"Hightlights from Obama's day, according to an aide: the president worked out this morning, then did 45 minutes of debate review","date":"Tue Oct 16 13:05:51 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama and motorcade have arrived at Hofstra University to do a walk-through of the debate environs.","date":"Tue Oct 16 11:33:14 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama has arrived in NY for the second debate and boarded his helicopter, en route to the debate site.","date":"Tue Oct 16 11:11:00 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama says debate prep is \"going great\" during a stop to make calls at a campaign office in Virginia.","date":"Sun Oct 14 12:42:19 MDT 2012"},{"aspect":"self_created","tweet":"Obama making a call to a volunteer from a campaign office in Virginia. http://t.co/kfejbCeP","date":"Sun Oct 14 12:41:51 MDT 2012"},{"aspect":"self_created","tweet":"Both Joe Biden and Paul Ryan have thrown a lot of red meat to their bases in this debate. Conservatives will love Ryan's answer on abortion","date":"Thu Oct 11 20:17:25 MDT 2012"},{"aspect":"self_created","tweet":"Biden can't keep his laughter in check when Ryan says the sanctions against Iran were put in place in spite of the Obama administration","date":"Thu Oct 11 19:21:10 MDT 2012"},{"aspect":"self_created","tweet":"Biden says: the last thing we need right now is another war.","date":"Thu Oct 11 19:06:17 MDT 2012"},{"aspect":"self_created","tweet":"ABC's Martha Raddatz shoots a look over her shoulder as Fox's Bret Baier makes loud intro to his show. So much for silence in the hall","date":"Thu Oct 11 18:59:02 MDT 2012"},{"aspect":"self_created","tweet":"@JoeBiden and motorcade are on the way to the debate hall...","date":"Thu Oct 11 18:07:05 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama makes an OJ Simpson joke at San Francisco fundraiser, says Elmo is departing in a white Suburban to avoid Big Bird's fate","date":"Mon Oct 08 22:39:49 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama tells fundraiser in San Francisco, when talking about his date night with Michelle, that yes, he does still have a credit card","date":"Mon Oct 08 20:12:35 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama says he \"goofed up\" in 2008, too","date":"Sun Oct 07 19:40:01 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama chides himself for the debate at LA fundraiser, says singers and actors always perform well but he can't say same for himself","date":"Sun Oct 07 19:25:15 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama and his team have boarded Air Force One. We are on our way to CA, where he will be doing a round of fundraising.","date":"Sun Oct 07 09:30:02 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama's campaign & Democrats bring in whopping $181 million in Sept","date":"Sat Oct 06 08:08:24 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama seems to be getting his mojo back after the debate. Two feisty speeches to big rallies today","date":"Thu Oct 04 15:07:59 MDT 2012"},{"aspect":"self_created","tweet":"That must have been one of the zingers. Romney tells Obama he's entitled to his own house and plane but not his own facts.","date":"Wed Oct 03 20:22:49 MDT 2012"},{"aspect":"self_created","tweet":"Romney says regulation is essential but can become excessive.","date":"Wed Oct 03 19:51:46 MDT 2012"},{"aspect":"self_created","tweet":"Romney opens up with a joke, tells Obama he's sure there was no more romantic place for him to spend his wedding anniversary than with him.","date":"Wed Oct 03 19:07:45 MDT 2012"},{"aspect":"self_created","tweet":"Inside the debate hall, the lights have just gone down. 5 minutes til start time.","date":"Wed Oct 03 18:54:51 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama just made a surprise stop to vire the Hoover Dam.","date":"Tue Oct 02 14:24:19 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama says his staff is keeping him indoors while in Nevada to do his homework. \"It's a drag,\" he tells another volunteer.","date":"Mon Oct 01 15:24:03 MDT 2012"},{"aspect":"self_created","tweet":"Obama calls another person who doesn't pick up. \"Nobody picked up the phone!\" he tells her, when another volunteer gets her on another line.","date":"Mon Oct 01 15:19:52 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama calls a volunteer from the OFA office. Donna, on the other line, is apparently a talker.","date":"Mon Oct 01 15:16:48 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama makes a surprise visit to campaign office in Nevada. He brought pizza. And once he gave one volunteer a hug, everyone got one.","date":"Mon Oct 01 15:13:06 MDT 2012"},{"aspect":"self_created","tweet":"Belated thansk, @DianeQuest! Great to hear from you!","date":"Mon Oct 01 14:53:32 MDT 2012"},{"aspect":"self_created","tweet":"Hey, thanks @mashmule. I enjoyed doing it, too.","date":"Mon Oct 01 14:51:09 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama tells Las Vegas rally: Gov. Romney is a good debater. I'm just OK.","date":"Sun Sep 30 19:47:20 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama is leaving his debate prep hotel outside Las Vegas for a Nevada campaign rally, past a faux Italian-looking village.","date":"Sun Sep 30 19:03:27 MDT 2012"},{"aspect":"self_created","tweet":"So we know now who will be helping Obama with debate prep: Lew, Plouffe, Sperling and Favreau all boarded Air Force One just now with Potus","date":"Sun Sep 30 09:34:37 MDT 2012"},{"aspect":"self_created","tweet":"Enjoyed being on #NowWithAlex on MSNBC just now. Check out clips on their website.","date":"Fri Sep 28 11:16:06 MDT 2012"},{"aspect":"self_created","tweet":"Quick save? @BarackObama fumbles a line, says wants to export more jobs abroad, then catches himself and say he was channeling Romney","date":"Wed Sep 26 15:50:58 MDT 2012"},{"aspect":"self_created","tweet":"Obama landing on Marine One at the White House http://t.co/Ns5ruAjs","date":"Fri Sep 21 12:09:16 MDT 2012"},{"aspect":"self_created","tweet":"Trying that again without typos: @BarackObama on Mitt Romney: what kind of inside job is he talking about?","date":"Fri Sep 21 10:36:50 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama on Mitt Romney: what kinf on inside job is he talking about?","date":"Fri Sep 21 10:36:00 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama says his biggest failure has been not being able to accomplish immigration reform","date":"Thu Sep 20 13:05:14 MDT 2012"},{"aspect":"self_created","tweet":"Obama says in his first job, he made $10,000 a year","date":"Thu Sep 20 12:52:35 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama says Romney hasn't gotten around a lot if he thinks the \"47 pct\" are victims","date":"Thu Sep 20 12:48:48 MDT 2012"},{"aspect":"self_created","tweet":"Obama tells Hispanics he's not going to concede that Republicans will control Congress after November election","date":"Thu Sep 20 12:29:30 MDT 2012"},{"aspect":"self_created","tweet":"Obama on Letterman says Romney essentially \"writing off\" a chunk of America with his comments about the 47 pct","date":"Tue Sep 18 15:59:06 MDT 2012"},{"aspect":"self_created","tweet":"White House says Obama's message is consistent in fundraisers whether the press is present or not. Piling on Romney video continues...","date":"Tue Sep 18 10:04:30 MDT 2012"},{"aspect":"self_created","tweet":"Carney says: when you're president of the United States, you're president for everybody.","date":"Tue Sep 18 09:35:01 MDT 2012"},{"aspect":"self_created","tweet":"Obama tells Columbus, Ohio crowd: \"I've got a lot of fight in me right now.\"","date":"Mon Sep 17 14:45:16 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama says he's done his own taxes, not sure if that can be said about the other guys","date":"Mon Sep 17 10:50:35 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama in Ohio tells crowd they should be having a picnic. Who's got the chicken, he asks. Then, naturally: who said 'beer'?","date":"Mon Sep 17 10:30:15 MDT 2012"},{"aspect":"self_created","tweet":"Correction: crowd in West Palm Beech was singing along to Al Green's \"Let's Stay together. Was a nice moment for the campaign.","date":"Sun Sep 09 15:58:47 MDT 2012"},{"aspect":"self_created","tweet":"#Obama continues arithmetic theme in West Palm Beach, tells Repubs \"no recess for you\" for bad math on Medicare","date":"Sun Sep 09 15:35:54 MDT 2012"},{"aspect":"self_created","tweet":"Crowd waiting for @BarackObama in West Palm Beach is singing along to to Tina Turner's \"Let's stay together.\"","date":"Sun Sep 09 15:10:56 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama making campaign calls in Florida http://t.co/WHK71fvF","date":"Sun Sep 09 13:48:46 MDT 2012"},{"aspect":"self_created","tweet":"Obama calls a volunteer, can't get him on the phone, so tries another number. Says Barney, the man on the phone, didn't believe it was him.","date":"Sun Sep 09 13:47:16 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama is stopping at a campaign office to make calls. After fiddling with an iPhone, he notes that he still has a Blackberry","date":"Sun Sep 09 13:45:51 MDT 2012"},{"aspect":"self_created","tweet":"@RachelSB Photos should be on the wire shortly","date":"Sun Sep 09 13:25:28 MDT 2012"},{"aspect":"self_created","tweet":"@JackVanD Obama bought pizza, so guess that counts","date":"Sun Sep 09 13:25:07 MDT 2012"},{"aspect":"self_created","tweet":"Maybe this will help with white guy voters? Enthusiastic, big-muscled white male pizza place owner literally just lifted Obama in the air","date":"Sun Sep 09 12:58:28 MDT 2012"},{"aspect":"self_created","tweet":"Alert, Potus makes a birth certificate joke! Told that a little boy was from Hawaii, Obama asks: \"Do you have a birth certificate?\"","date":"Sat Sep 08 17:21:25 MDT 2012"},{"aspect":"self_created","tweet":"It wouldn't be an Obama bus trip without a stop for beer. @BarackObama is enjoying a brew at Gator's Dockside in Florida.","date":"Sat Sep 08 16:59:13 MDT 2012"},{"aspect":"self_created","tweet":"The indoor venues are working well for Obama. This crowd is very hyped up, and Potus is drinking it in. The press likes the airconditioning.","date":"Sat Sep 08 15:10:22 MDT 2012"},{"aspect":"self_created","tweet":"Obama in Florida: Romney said it was tragic how I ended the war in Iraq. \"Well, I did it anyway.\"","date":"Sat Sep 08 15:08:14 MDT 2012"},{"aspect":"self_created","tweet":"@antiimbeciles Hey Lev. Potus stands for President Of The United States. Its a code word his staff, secret service, and many others use.","date":"Sat Sep 08 14:16:02 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama and First Lady Michelle waving from AF1 before departing Charlottte after Dem convention. http://t.co/EvrZQ1GQ","date":"Fri Sep 07 08:13:02 MDT 2012"},{"aspect":"self_created","tweet":"After a sweaty morning workout at the hotel, @BarackObama hits the trail today in New Hampshire, Iowa, Florida. Swing state tour time.","date":"Fri Sep 07 07:34:39 MDT 2012"},{"aspect":"self_created","tweet":"@barakat_sara Different vantages points then. From the balcony view, while Obama and family were hugging, the crowd seemed unsure what to do","date":"Thu Sep 06 21:45:30 MDT 2012"},{"aspect":"self_created","tweet":"@saquin it wasn't pouring near potus's hotel, no. Heard some thunder at one point though","date":"Thu Sep 06 21:29:17 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama motorcade heading back to the hotel now, no lingering for confetti and after parties at the arena","date":"Thu Sep 06 21:20:49 MDT 2012"},{"aspect":"self_created","tweet":"Crowd seems unusually subdued at the end of Obama's speech.","date":"Thu Sep 06 21:07:56 MDT 2012"},{"aspect":"self_created","tweet":"Flotus and the girls just left their seats to go backstage. Obama must be wrapping up.","date":"Thu Sep 06 21:01:54 MDT 2012"},{"aspect":"self_created","tweet":"Potus has arrived at the Time Warnerr Cable Arena for his biggest speech of the campaign. The weather outside, by the way, is beautiful.","date":"Thu Sep 06 19:20:22 MDT 2012"},{"aspect":"self_created","tweet":"After a day at his hotel working on his big speech, @BarackObama is en route to the arena for the Democratic convention","date":"Thu Sep 06 18:57:18 MDT 2012"},{"aspect":"self_created","tweet":"Just saw a yawn in the audience. Clinton's speech length so far according to this reporter's tape recorder: 45 minutes","date":"Wed Sep 05 21:20:23 MDT 2012"},{"aspect":"self_created","tweet":"Members of DNC crowd shout \"liar!\" about Romney/Ryan when Clinton talks about Republican ads about welfare reform","date":"Wed Sep 05 21:13:12 MDT 2012"},{"aspect":"self_created","tweet":"Crowd erupts to its feet when Clinton amswers question: are we better off than we were four years ago?","date":"Wed Sep 05 20:54:00 MDT 2012"},{"aspect":"self_created","tweet":"Bill Clinton just ad-libbed the line on liking the signal about democracy that Obama and Hillary Clinton's friendly relationship sends","date":"Wed Sep 05 20:48:28 MDT 2012"},{"aspect":"self_created","tweet":"@wdcscribe not tonight is right","date":"Wed Sep 05 20:43:24 MDT 2012"},{"aspect":"self_created","tweet":"Can see the TelePrompter from the press pool's vantage point. Bill Clinton is following his text pretty closely.","date":"Wed Sep 05 20:38:49 MDT 2012"},{"aspect":"self_created","tweet":"Potus' press pool is standing behind the stage at the DNC on a balcony. In the hall at least, Elizabeth Warren was hard to hear","date":"Wed Sep 05 20:33:49 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama has arrived at Time Warner Cable Arena","date":"Wed Sep 05 20:19:48 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama motorcade has left the hotel","date":"Wed Sep 05 20:00:24 MDT 2012"},{"aspect":"self_created","tweet":"@BarackObama will be in the convention hall tonight to watch the Clinton speech, a campaign official says","date":"Wed Sep 05 19:24:32 MDT 2012"},{"aspect":"self_created","tweet":"With stadium event off, @BarackObama team says there were 65000 ticket holders & 19000 on waitlist. Last week they wouldn't release numbers.","date":"Wed Sep 05 14:24:19 MDT 2012"},{"aspect":"self_created","tweet":"AF1 taking off now with @BarackObama to @dnc2012 in Charlotte, rain and all.","date":"Wed Sep 05 11:50:38 MDT 2012"},{"aspect":"self_created","tweet":"Sheets of rain pouring down on Air Force One. We're now waiting on the runway, not taxiing anymore, perhaps to wait it out.","date":"Wed Sep 05 11:41:16 MDT 2012"},{"aspect":"self_created","tweet":"@davidaxelrod and david plouffe -- the designers of @BarackObama's 2008 campaign -- are on AF1 today for his ride to the DNC in Charlotte","date":"Wed Sep 05 11:32:30 MDT 2012"},{"aspect":"self_created","tweet":"Flotus: for Barack, success isn't about how much money you make but the difference you make in other people's lives","date":"Tue Sep 04 20:56:23 MDT 2012"},{"aspect":"self_created","tweet":"Michelle Obama: the truth matters. (Expect to hear this a lot from Dems in the coming days.)","date":"Tue Sep 04 20:50:15 MDT 2012"},{"aspect":"self_created","tweet":"Michelle Obama talks about growing up in a family without a lot of wealth or material things. Contrasting with the Romneys...","date":"Tue Sep 04 20:45:36 MDT 2012"},{"aspect":"self_created","tweet":"Flotus is getting a rock star's welcome at the DNC","date":"Tue Sep 04 20:39:43 MDT 2012"},{"aspect":"self_created","tweet":"Axe says says Dems will mention Bush next week as often as Repubs did at their convention this week (not much)","date":"Fri Aug 31 12:20:56 MDT 2012"},{"aspect":"self_created","tweet":"David Axelrod says the fact that Romney gave a 45-minute speech without noting he was governor of Massachusetts was a telling fact","date":"Fri Aug 31 12:19:19 MDT 2012"},{"aspect":"self_created","tweet":"Awkward?","date":"Thu Aug 30 20:11:29 MDT 2012"},{"aspect":"self_created","tweet":"Sounds like Paul Ryan was assigned to make Mormonism palatable for evangelicals, noting he & Romney go to different churches but share faith","date":"Wed Aug 29 21:02:30 MDT 2012"},{"aspect":"self_created","tweet":"Paul Ryan manages to get two swing states into his childhood story: growing up in Wisconsin (check) and going to college in Ohio (check)","date":"Wed Aug 29 20:57:03 MDT 2012"},{"aspect":"self_created","tweet":"Chris Christie says \"tonight we're going to choose respect over love.\" This comes after Ann Romney made \"love\"  centerpiece of her speech","date":"Tue Aug 28 20:43:14 MDT 2012"},{"aspect":"self_created","tweet":"Ann Romney talks about her first apartment with Mitt. In a basement. With an ironing board.","date":"Tue Aug 28 20:22:49 MDT 2012"},{"aspect":"self_created","tweet":"Ann Romney expresses hope that no lives -- or property -- are lost from Hurricane Isaac.","date":"Tue Aug 28 20:14:04 MDT 2012"},{"aspect":"self_created","tweet":"Newish line in Obama's stump speech on this trip to Iowa/Colorado: \"Denying climate change doesn't make it stop.\"","date":"Tue Aug 28 17:08:10 MDT 2012"},{"aspect":"self_created","tweet":"Obama sneezes, then says it gives him a cold just thinking what Republicans will do if they win the White House","date":"Tue Aug 28 17:02:00 MDT 2012"},{"aspect":"self_created","tweet":"Obama says Mitt Romney needs tax cuts even less than he does.","date":"Tue Aug 28 16:56:17 MDT 2012"},{"aspect":"self_created","tweet":"\"Don't boo, vote!\" Obama says when CO crowd shows displeasure at mention of Republican convention. Not the first time he's used that line.","date":"Tue Aug 28 16:55:53 MDT 2012"},{"aspect":"self_created","tweet":"After being interrupted by a protester in Nevada, Obama says: that young man probably needed a good teacher. It's teacher day on the trail.","date":"Wed Aug 22 11:23:31 MDT 2012"},{"aspect":"self_created","tweet":"Obama says Romney has more friends than he does who can write $10 million checks for the campaign","date":"Wed Aug 15 12:15:59 MDT 2012"},{"aspect":"self_created","tweet":"Obama jokes that he won't take questions from a man wearing a Green Bay Packers T-Shirt. Says he only interacts with Packers people in WI","date":"Wed Aug 15 10:17:52 MDT 2012"},{"aspect":"self_created","tweet":"Obama makes a surprise visit at an Iowa high school, is taking questions from teachers here. Teachers seem a bit awed.","date":"Wed Aug 15 10:15:09 MDT 2012"},{"aspect":"self_created","tweet":"Obama is visiting the Iowa State Fair","date":"Mon Aug 13 18:25:16 MDT 2012"},{"aspect":"self_created","tweet":"Obama says Republicans are not constrained by the facts when making political ads.","date":"Mon Aug 13 16:38:15 MDT 2012"},{"aspect":"self_created","tweet":"\"Nice T-shirt!\" Obama tells a boy wearing a shirt with the president's image on it","date":"Mon Aug 13 14:10:03 MDT 2012"},{"aspect":"self_created","tweet":"Obama is making a stop at a sno cone stand in Denison Iowa. Kinda like \"shave ice\" in Hawaii, minus the beans at the bottom of the cone.","date":"Mon Aug 13 14:07:33 MDT 2012"},{"aspect":"self_created","tweet":"Obama cals Paul Ryan a good family man, welcomes him to the race. Says he is a good spokesman for Romney's vision -- which he opposes.","date":"Sun Aug 12 14:35:43 MDT 2012"},{"aspect":"self_created","tweet":"Obama calls Hillary Clinton aide Huma Abedin an American patriot. Rep. Michele Bachman had suggested she was tied to the Muslim Brotherhood.","date":"Fri Aug 10 18:49:45 MDT 2012"},{"aspect":"self_created","tweet":"My grandmother would be proud, he notes. Obama had taken shoes off to walk on the wrestling mats at the gym.","date":"Thu Aug 09 15:16:08 MDT 2012"},{"aspect":"self_created","tweet":"Obama points out to the press that he doesn't have any holes in his socks, when putting his shoes back on at Olympic facility.","date":"Thu Aug 09 15:15:09 MDT 2012"},{"aspect":"self_created","tweet":"Obama says gives a special shoutout to the women's soccer team for avenging the loss at the World Cup","date":"Thu Aug 09 15:05:02 MDT 2012"},{"aspect":"self_created","tweet":"For the culinary experts out there, the enchilada comes with chorizo and an egg on top.","date":"Thu Aug 09 09:33:44 MDT 2012"}]}