{"user_name":"stevebruskCNN","user_timeline":[{"aspect":"self_created","tweet":"Senator Murkowski says tonight she will be a no vote on the Toomey/Manchin plan.","date":"Tue Apr 16 21:23:34 MDT 2013"},{"aspect":"self_created","tweet":"That photo from our producer Greg Seaby on site. No one is in custody in connection with the letter, that had a Memphis postmark","date":"Tue Apr 16 19:10:37 MDT 2013"},{"aspect":"self_created","tweet":"Haz mat trucks at mail facility in Hyattsville, MD where letter to Sen. Wicker tested positive for ricin. http://t.co/buZj8x2Nd5","date":"Tue Apr 16 19:09:04 MDT 2013"},{"aspect":"self_created","tweet":"Vice President Biden says we saw the extraordinary character of the American people raise its head again in heroics in Boston","date":"Tue Apr 16 17:10:39 MDT 2013"},{"aspect":"self_created","tweet":"Sen. McCaskill told reporters \"It was caught in the screening facility -- that's why we have an off-site screening facility for mail.\"","date":"Tue Apr 16 16:34:27 MDT 2013"},{"aspect":"self_created","tweet":"Sen. Reid, asked if the letter was sent to Sen.. Roger Wicker of Mississippi, said, that's the information I have","date":"Tue Apr 16 16:34:06 MDT 2013"},{"aspect":"self_created","tweet":"Routine first screening and 2 other tests were positive at site. Letter has now been sent to Maryland lab for further testing.","date":"Tue Apr 16 16:24:29 MDT 2013"},{"aspect":"self_created","tweet":"Sources tell CNN envelope that tested positive for ricin poison intercepted Tuesday afternoon at the U.S. Capitol’s offsite mail facility","date":"Tue Apr 16 16:21:41 MDT 2013"},{"aspect":"self_created","tweet":"White House says the president will no longer travel to the University of Kansas on Friday","date":"Tue Apr 16 15:19:34 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama will attend interfaith service in Boston Thursday","date":"Tue Apr 16 15:16:57 MDT 2013"},{"aspect":"self_created","tweet":"FBI asks for info on anyone who carried unusually heavy dark colored bag in area of the bombing","date":"Tue Apr 16 15:13:32 MDT 2013"},{"aspect":"self_created","tweet":"FBI: 'The range of suspects and motives remains wide open\". Asking for tips, says \"someone knows who did this\".","date":"Tue Apr 16 15:12:43 MDT 2013"},{"aspect":"self_created","tweet":"News conference in Boston beginning now -- CNN live","date":"Tue Apr 16 15:07:50 MDT 2013"},{"aspect":"self_created","tweet":"Biden, asked if Toomey-Manchin would pass, said, 'I've learned after 36 years not to predict what the Senate's going to do on anything\"","date":"Tue Apr 16 14:51:26 MDT 2013"},{"aspect":"self_created","tweet":"VP Biden leaving Hill says of gun bill: \"I think we're going to be ok..we are working to get to 60 and it's fluid.\"","date":"Tue Apr 16 14:47:11 MDT 2013"},{"aspect":"self_created","tweet":"There will be a 5pm ET news conference with law enforcement officials in Boston","date":"Tue Apr 16 13:18:25 MDT 2013"},{"aspect":"self_created","tweet":"The official tells Elise the student was questioned but “it came up empty. He was just at the wrong place at the wrong time.”","date":"Tue Apr 16 12:24:24 MDT 2013"},{"aspect":"self_created","tweet":"Our Elise Labott told by US official the injured Saudi student was a spectator at the race, was running away because of his injury.","date":"Tue Apr 16 12:23:39 MDT 2013"},{"aspect":"self_created","tweet":"The official told Barbara that's from circulated through senior levels of admin 6 hours ago, and could change as investigation progresses","date":"Tue Apr 16 12:20:19 MDT 2013"},{"aspect":"self_created","tweet":"Senior US official tells Barbara Starr at this stage, “there is no reporting indicating a foreign connection or any reaction from Al Qaeda\"","date":"Tue Apr 16 12:18:32 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama: we all have a part to play. \"If you see something suspicious, speak up\"","date":"Tue Apr 16 09:34:30 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama says American people refuse to be terrorized, citing heroics and actions after attack","date":"Tue Apr 16 09:33:00 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama says FBI investigating \"heinous and cowardly\" act in Boston as an act of terrorism","date":"Tue Apr 16 09:32:19 MDT 2013"},{"aspect":"self_created","tweet":"President Obama's remarks follow his briefing by the FBI Director and other officials. Entering briefing room now.","date":"Tue Apr 16 09:30:47 MDT 2013"},{"aspect":"self_created","tweet":"We'll hear from President Obama shortly, making a statement at the White House at 11:30am ET","date":"Tue Apr 16 09:11:20 MDT 2013"},{"aspect":"self_created","tweet":"Latest on Boston bombing in 9:30am news conference. CNN live coverage","date":"Tue Apr 16 07:14:09 MDT 2013"},{"aspect":"self_created","tweet":"The WH official said Pres. Obama \"made clear that he expects to be kept update to date on developments\". FBI Dir. briefs him this morning.","date":"Tue Apr 16 05:14:22 MDT 2013"},{"aspect":"self_created","tweet":"A White House official says President Obama received updates on the Boston investigation overnight from Homeland Sec Advisor Lisa Monaco","date":"Tue Apr 16 05:06:27 MDT 2013"},{"aspect":"self_created","tweet":"Next news conference on Boston will be at 9:30am ET Tuesday","date":"Mon Apr 15 21:23:44 MDT 2013"},{"aspect":"self_created","tweet":"Another important story tonight: 4 GOP Senators who were on the fence came out against the Toomey/Manchin bill. Bill short of needed votes","date":"Mon Apr 15 19:30:34 MDT 2013"},{"aspect":"self_created","tweet":"Boston Police now says there are 3 fatalities in the bombings. Firm numbers of casualties won't be clear until tomorrow","date":"Mon Apr 15 18:53:49 MDT 2013"},{"aspect":"self_created","tweet":"News conference beginning now in Boston -- CNN live","date":"Mon Apr 15 18:45:21 MDT 2013"},{"aspect":"self_created","tweet":"The state source and a city official tell John the devices were \"crude\", relatively modest devices in terms of their explosive power.","date":"Mon Apr 15 17:48:38 MDT 2013"},{"aspect":"self_created","tweet":"(More)...as anything more than normal investigative practices. Some were questioned at hospitals. No one identified as suspect yet","date":"Mon Apr 15 17:45:33 MDT 2013"},{"aspect":"self_created","tweet":"State law enforcement source tells John King there were several \"persons of interest\" through day, but cautions against reading that (more)","date":"Mon Apr 15 17:43:34 MDT 2013"},{"aspect":"self_created","tweet":"Latest # of injured: 132 people were received at Boston hospitals. At least 17 are in critical condition, at least 25 in serious condition","date":"Mon Apr 15 17:35:55 MDT 2013"},{"aspect":"self_created","tweet":"Boston Children's Hospital says it received 8 victims...conditions range from serious to good. There were no deaths among their patients","date":"Mon Apr 15 17:08:02 MDT 2013"},{"aspect":"self_created","tweet":"Hospitals tells CNN at least 110 people were hurt. At least 8 are in critical condition, at least 14 are in serious condition.","date":"Mon Apr 15 16:48:50 MDT 2013"},{"aspect":"self_created","tweet":"The report of the 8-year-old killed in the bombing was first reported by NBC News","date":"Mon Apr 15 16:43:34 MDT 2013"},{"aspect":"self_created","tweet":"WH official tells Jessica Yellin \"Any event with multiple explosive devices as this appears to be is clearly an act of terror\"","date":"Mon Apr 15 16:41:25 MDT 2013"},{"aspect":"self_created","tweet":"Affiliate WCVB says an 8-year-old was one of those killed today in the bombings","date":"Mon Apr 15 16:32:36 MDT 2013"},{"aspect":"self_created","tweet":"Two minutes to President Obama's remarks. CNN live","date":"Mon Apr 15 16:09:13 MDT 2013"},{"aspect":"self_created","tweet":"Federal officials are now classifying the Boston explosions as a terrorist attack, not clear yet if it's foreign or domestic.","date":"Mon Apr 15 16:01:47 MDT 2013"},{"aspect":"self_created","tweet":"President Obama will address the nation at 6:10pm from the White House briefing room","date":"Mon Apr 15 15:45:16 MDT 2013"},{"aspect":"self_created","tweet":"Boston Police now saying the JFK Library incident appears fire-related, not an explosion","date":"Mon Apr 15 15:28:31 MDT 2013"},{"aspect":"self_created","tweet":"The Boston Globe now reports at least 100 people are being treated for injuries","date":"Mon Apr 15 15:16:48 MDT 2013"},{"aspect":"self_created","tweet":"Hospitals in Boston now reporting at least 45 injured at this point.","date":"Mon Apr 15 15:02:34 MDT 2013"},{"aspect":"self_created","tweet":"Tonight's NHL game in Boston has been postponed, league says","date":"Mon Apr 15 14:59:49 MDT 2013"},{"aspect":"self_created","tweet":"Police say 3rd incident did occur at the JFK Library...treating it as if it's related","date":"Mon Apr 15 14:53:01 MDT 2013"},{"aspect":"self_created","tweet":"News conference underway...CNN live","date":"Mon Apr 15 14:51:03 MDT 2013"},{"aspect":"self_created","tweet":"Chris Cuomo will be live on CNN momentarily with new information on the additional devices found","date":"Mon Apr 15 14:35:10 MDT 2013"},{"aspect":"self_created","tweet":"News conference in Boston delayed slightly...likely about 10 minutes away. CNN live when it happens. Boston, state and fed officials there","date":"Mon Apr 15 14:34:08 MDT 2013"},{"aspect":"self_created","tweet":"Gov. Patrick's office: \"Gov. Patrick is at the State House, in contact w federal/state/city officials. Please stay clear of Copley Square\"","date":"Mon Apr 15 14:18:15 MDT 2013"},{"aspect":"self_created","tweet":"Boston Fire Dept. says there will be a 4:30pm news conference","date":"Mon Apr 15 14:04:54 MDT 2013"},{"aspect":"self_created","tweet":"Boston Police can confirm 2 fatalities, 22 injured. (Should be noted these are early numbers and likely to rise)","date":"Mon Apr 15 14:04:29 MDT 2013"},{"aspect":"self_created","tweet":"WH official: The pres.\"directed his administration to provide whatever assistance is necessary in the investigation and response\"","date":"Mon Apr 15 14:02:13 MDT 2013"},{"aspect":"self_created","tweet":"WH official: \"The President has been notified of the incident in Boston  His administration is in contact with state and local authorities\"","date":"Mon Apr 15 14:00:52 MDT 2013"},{"aspect":"self_created","tweet":"Like New York City, Washington is now on heightened level of security.","date":"Mon Apr 15 13:58:14 MDT 2013"},{"aspect":"self_created","tweet":"John King told by state and local officials there was no known credible threat prior to the explosions","date":"Mon Apr 15 13:52:26 MDT 2013"},{"aspect":"self_created","tweet":"Officials in Boston say Green Line subway service has been suspended between the Kenmore and Park Street stations","date":"Mon Apr 15 13:31:07 MDT 2013"},{"aspect":"self_created","tweet":"Massachusetts General has 4 victims in the ER from the explosion","date":"Mon Apr 15 13:30:03 MDT 2013"},{"aspect":"self_created","tweet":"The explosions were about 10 seconds apart, on same side of the street","date":"Mon Apr 15 13:23:44 MDT 2013"},{"aspect":"self_created","tweet":"Breaking news on air momentarily on two explosions reported in Boston's Copley Square near finish line","date":"Mon Apr 15 13:04:52 MDT 2013"},{"aspect":"self_created","tweet":"McCain reiterates US should treat a NK missile launch as \"threat to our natl security and our allies\", shoot it down once it leaves airspace","date":"Mon Apr 15 12:32:35 MDT 2013"},{"aspect":"self_created","tweet":"Manchin and Toomey coming to the Senate floor in about 45 minutes to talk about their bill","date":"Mon Apr 15 12:28:34 MDT 2013"},{"aspect":"self_created","tweet":"Alabama's national champion team being honored by Pres. Obama at the White House this hour. Looking forward to the Buckeyes here next year.","date":"Mon Apr 15 12:12:04 MDT 2013"},{"aspect":"self_created","tweet":"This comes a day after O'Malley appears on same stage as Vice President Biden at a University of Baltimore law school ceremony","date":"Mon Apr 15 11:23:39 MDT 2013"},{"aspect":"self_created","tweet":"Gov. Martin O'Malley will have First Lady Michelle Obama at his bill signing on Veterans' full employment Wednesday.","date":"Mon Apr 15 11:22:48 MDT 2013"},{"aspect":"self_created","tweet":"Rick Santorum in SC hospital because of stomach bug, dehydration. Spokesperson says he's feeling better but Mon. Iowa trip postponed","date":"Sun Apr 14 17:30:04 MDT 2013"},{"aspect":"self_created","tweet":"The baby's name is Margaret Laura \"Mila\" Hager, named for her grandmothers. Mom, dad and baby are doing well. The Bushes visited  today.","date":"Sun Apr 14 14:21:51 MDT 2013"},{"aspect":"self_created","tweet":"Former Pres. Bush 43 and Laura are grandparents. He announced Jenna gave birth to a granddaughter last night in New York.","date":"Sun Apr 14 14:20:15 MDT 2013"},{"aspect":"self_created","tweet":"We think The Full Marco gets an *. Though he broke record, Ginsburg went to 5 studios while Rubio was at same camera. Like Maris and Ruth","date":"Sun Apr 14 14:03:03 MDT 2013"},{"aspect":"self_created","tweet":"McCain praised Toomey and Manchin for their \"work together\", says we \"need to do a lot more of that\"","date":"Sun Apr 14 10:10:33 MDT 2013"},{"aspect":"self_created","tweet":"McCain told Candy he still wants a \"greater explanation\" of the Internet aspect of the bill. (Fixes word)","date":"Sun Apr 14 10:08:07 MDT 2013"},{"aspect":"self_created","tweet":"John McCain a likely 4th Republican vote for the Toomey/Manchin bill, telling Candy Crowley on SOTU he's \"very favorably disposed\" to it","date":"Sun Apr 14 09:02:54 MDT 2013"},{"aspect":"self_created","tweet":"The scene played out over several miles, partially on a busy freeway just north of Atlanta's Perimeter.","date":"Fri Apr 12 20:34:53 MDT 2013"},{"aspect":"self_created","tweet":"WSB reports the gunman was killed, the officer is stable, and the female bystander is also hospitalized. She was shot in car.","date":"Fri Apr 12 20:34:04 MDT 2013"},{"aspect":"self_created","tweet":"Our affiliate WSB reports gunman shot police officer, innocent bystander in northern Atlanta suburbs before being shot by officers.","date":"Fri Apr 12 20:02:26 MDT 2013"},{"aspect":"self_created","tweet":"As RNC meets in LA today, Tony Perkins is telling conservatives to withhold contributions until party grows \"a backbone\" on social issues","date":"Fri Apr 12 05:03:41 MDT 2013"},{"aspect":"self_created","tweet":"@jbendery thanks!","date":"Thu Apr 11 13:21:15 MDT 2013"},{"aspect":"self_created","tweet":"The Biden trip to the Capitol was not announced...no word yet where he went inside","date":"Thu Apr 11 13:15:24 MDT 2013"},{"aspect":"self_created","tweet":"Our Lisa Desjardins reports Vice President  Biden is on Capitol Hill, just went in went Senate carriage entrance","date":"Thu Apr 11 13:12:29 MDT 2013"},{"aspect":"self_created","tweet":"Sen. Alexander is also attending the White House dinner tonight","date":"Wed Apr 10 14:04:19 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama on gun compromise (2): \"...to be stronger. But the agreement does represent welcome and significant bipartisan progress\"","date":"Wed Apr 10 13:57:21 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama on Manchin/Toomer compromise (1/2): \"This is not my bill, and there are aspects of the agreement that I might prefer...(more)","date":"Wed Apr 10 13:56:46 MDT 2013"},{"aspect":"self_created","tweet":"White House on quake in Iran: \"deeply saddened by the loss of life and the destruction...stand ready to help the Iranian people\".","date":"Wed Apr 10 13:11:51 MDT 2013"},{"aspect":"self_created","tweet":"Sen. Rubio is a yes if immigration developments don't prevent him from making it","date":"Wed Apr 10 11:25:09 MDT 2013"},{"aspect":"self_created","tweet":"We now know 8 of the confirmed Senators for tonight's WH Dinner: Isakson, Boozman, Thune, Enzi, Collins, Fischer, Wicker, Hatch.","date":"Wed Apr 10 11:24:44 MDT 2013"},{"aspect":"self_created","tweet":"Elise reports package was approved at National Sec. Council meeting last week, part of ramped-up effort to change the military balance","date":"Tue Apr 09 16:52:28 MDT 2013"},{"aspect":"self_created","tweet":"Just in: US officials tell Elise Labott  President Obama has signed off on a new package of nonlethal aid for Syrian rebels","date":"Tue Apr 09 16:48:53 MDT 2013"},{"aspect":"self_created","tweet":"Fire Dept now says 15 total victims in Lone Star College stabbing spree...12 transported to hospitals. 6 of them have most serious injuries","date":"Tue Apr 09 12:18:02 MDT 2013"},{"aspect":"CNN Super Tuesday","tweet":"RT @psteinhauserCNN: Sparks begin to fly in high profile congressional special election in South Carolina: http://t.co/X84GfA5HSj","date":"Tue Apr 09 11:29:49 MDT 2013"},{"aspect":"self_created","tweet":"RNC Chair Reince Priebus says Pres. Obama and GOP Senators should eat in rather than go to upscale restaurant Weds, offers to send pizza","date":"Tue Apr 09 08:28:30 MDT 2013"},{"aspect":"self_created","tweet":"Other than the skating of the Cup in hockey, no better championship tradition than One Shining Moment.","date":"Mon Apr 08 20:00:30 MDT 2013"},{"aspect":"self_created","tweet":"On the last tweet, should read \"12 family members\" who are on board","date":"Mon Apr 08 17:33:25 MDT 2013"},{"aspect":"self_created","tweet":"There are 12 Newtown families aboard Air Force One, coming to Washington to lobby lawmakers tomorrow on the Hill for new gun measures.","date":"Mon Apr 08 16:58:53 MDT 2013"},{"aspect":"self_created","tweet":"Pool reporter Sarah Courtney says one of the Newtown family members boarding AF1 carried a small sign reading \"Love wins!\"","date":"Mon Apr 08 16:57:36 MDT 2013"},{"aspect":"self_created","tweet":"Sen. McCain tells FP's The Cable US should shoot down any North Korean missile launch. \"If they launched a missile, we should take it out.\"","date":"Mon Apr 08 16:49:26 MDT 2013"},{"aspect":"self_created","tweet":"Dana Bash reports the leading bipartisan gun negotiations would expan  background checks, fall short of universal checks Pres. Obama wants","date":"Mon Apr 08 15:41:40 MDT 2013"},{"aspect":"self_created","tweet":"As tensions rise, 41% of the respondents in the CNN/ORC poll say North Korea is an immediate threat to the US. That's up from 28% in March","date":"Mon Apr 08 14:26:49 MDT 2013"},{"aspect":"self_created","tweet":"But 52% in the CNN/ORC poll say they disapprove of how the president is handling gun policy. 54% disapprove of his handling of the economy","date":"Mon Apr 08 14:25:21 MDT 2013"},{"aspect":"self_created","tweet":"New CNN/ORC poll:  51% approve of how President Obama is doing his job, 47% disapprove. Approval is up from 47% in March.","date":"Mon Apr 08 14:22:56 MDT 2013"},{"aspect":"self_created","tweet":"On day President Obama heads to Connecticut to push new gun measures, our affils report a CT state trooper was shot during robbery/chase","date":"Mon Apr 08 14:02:39 MDT 2013"},{"aspect":"self_created","tweet":"Air Force One has taken off, bound for Hartford","date":"Mon Apr 08 13:25:03 MDT 2013"},{"aspect":"self_created","tweet":"Reid on floor (2/2):  \"... is a thoughtful debate about whether stronger laws could have saved their little girls and boys.\"","date":"Mon Apr 08 12:32:11 MDT 2013"},{"aspect":"self_created","tweet":"Reid on Senate floor (1/2): \"The least Republicans owe the parents of these 20 little babies who were murdered at Sandy Hook...(more)","date":"Mon Apr 08 12:31:35 MDT 2013"},{"aspect":"self_created","tweet":"Christie defends Rutgers president, says he shouldn't lose job over basketball scandal. He called ousted coach Mike Rice an \"animal\".","date":"Mon Apr 08 10:59:27 MDT 2013"},{"aspect":"self_created","tweet":"They will come with letter signed by 120 Sandy Hook extended family members, will lobby Senators from both parties on gun measures","date":"Mon Apr 08 10:35:44 MDT 2013"},{"aspect":"self_created","tweet":"Jessica Yellin reports 11 Sandy Hook family members will fly to Washington with Pres. Obama on Air Force One after tonight's speech","date":"Mon Apr 08 10:33:54 MDT 2013"},{"aspect":"self_created","tweet":"Mrs. Reagan: \"Ronnie and Margaret were political soul mates, committed to freedom and resolved to end Communism\"","date":"Mon Apr 08 10:23:00 MDT 2013"},{"aspect":"self_created","tweet":"Mrs. Reagan on PM Thatcher: US \"knew Margaret as a spirited and courageous ally, and the world owes her a debt of gratitude\"","date":"Mon Apr 08 10:15:29 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama: Prime Min. Thatcher \"stands as an example to our daughters that there is no glass ceiling that can’t be shattered\".","date":"Mon Apr 08 08:35:39 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama (3/3): \"... with moral conviction, unyielding courage and iron will.\"Â†","date":"Mon Apr 08 08:19:37 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama (2/3): \"...reminding the world that we are not simply carried along by the currents of history—we can shape them\"...","date":"Mon Apr 08 08:19:11 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama on Thatcher (1/3): \"many of us will never forget her standing shoulder to shoulder with President Reagan...(More)","date":"Mon Apr 08 08:18:02 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama on Thatcher: \"world has lost one of the great champions of freedom and liberty, and America has lost a true friend.\"","date":"Mon Apr 08 08:16:08 MDT 2013"},{"aspect":"self_created","tweet":"Gorbachev: He and Thatcher \" able to reach an understanding... contribution to the change in atmosphere between our country and the West\"","date":"Mon Apr 08 08:07:38 MDT 2013"},{"aspect":"self_created","tweet":"Gorbachev: relationship w/ Thatcher \"at times difficult, not always smooth, but on both sides serious and responsible\", grew more friendly","date":"Mon Apr 08 08:06:13 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Bush 43: Thatcher \"great example of strength and character, and a great ally who strengthened the special relationship\" between US,UK","date":"Mon Apr 08 07:23:37 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Bush 43 calls Prime Min. Thatcher \"inspirational leader who stood on principle and guided her nation with confidence and clarity\"","date":"Mon Apr 08 07:22:30 MDT 2013"},{"aspect":"self_created","tweet":"RNC Chair Reince Priebus calls Prime Minister Thatcher \"one of the world's greatest conservative leaders and will always be remembered\"Â†","date":"Mon Apr 08 06:43:12 MDT 2013"},{"aspect":"self_created","tweet":"In videotaped message for his funeral, Thatcher called working closely w/ Pres. Reagan \"8 of the most important years of all our lives\"","date":"Mon Apr 08 06:39:18 MDT 2013"},{"aspect":"self_created","tweet":"In 1991, Thatcher received the Medal of Freedom, awarded by President George HW Bush.","date":"Mon Apr 08 06:27:48 MDT 2013"},{"aspect":"self_created","tweet":"Prime Minister Thatcher had wanted to attend the 2011 London unveiling of a statue of Ronald Reagan, but her health wouldn't allow","date":"Mon Apr 08 06:24:52 MDT 2013"},{"aspect":"self_created","tweet":"RT @mpoindc: Classy RT @MickiMaynard: The #Tigers honored Mo Rivera with vials of dirt from the Comerica and Tiger Stadium mounds. http: ...","date":"Sun Apr 07 11:07:14 MDT 2013"},{"aspect":"self_created","tweet":"Sen. Rand Paul's office says he'll speak Weds. at Howard Univ, focus will be \"importance of outreach to younger voters\", minority groups","date":"Sat Apr 06 13:27:10 MDT 2013"},{"aspect":"self_created","tweet":"Kerry said she \"tragically gave her young life working to give young Afghans the opportunity to have a better future\"","date":"Sat Apr 06 13:06:17 MDT 2013"},{"aspect":"self_created","tweet":"Kerry: the American officials were on way w/ Afghan colleagues to donate books to school  \"when they were struck by this despicable attack\"","date":"Sat Apr 06 13:04:44 MDT 2013"},{"aspect":"self_created","tweet":"Kerry says he met the fallen officer during his trip to Kabul last week, \"when she was selected to support me during my visit\"","date":"Sat Apr 06 13:02:10 MDT 2013"},{"aspect":"self_created","tweet":"Kerry in statement says \"our State Dept. family is grieving over the loss of one of our own, an exceptional young Foreign Service officer\"","date":"Sat Apr 06 13:00:45 MDT 2013"},{"aspect":"self_created","tweet":"NEW: Sec. Kerry now confirms a State Dept. employee was killed in in the Zabul Province attack. 4 other State Dept. employees hurt.","date":"Sat Apr 06 12:59:47 MDT 2013"},{"aspect":"self_created","tweet":"In all, six Americans were killed in the 2 Afghanistan attacks today. 3 service members and 2 civilians in one. 4th service member in other","date":"Sat Apr 06 12:42:19 MDT 2013"},{"aspect":"self_created","tweet":"Opening to Maureen Dowd column in NYT: \"PLEASE don’t ask me this anymore. It’s such a silly question. Of course Hillary is running\"","date":"Sat Apr 06 12:19:02 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama is playing golf this afternoon at the Joint Base Andrews course.","date":"Sat Apr 06 10:24:05 MDT 2013"},{"aspect":"self_created","tweet":"Breaking from Afghanistan: 3 ISAF soldiers and 2 coalition civilians killed in bomb attack on convoy","date":"Sat Apr 06 08:46:39 MDT 2013"},{"aspect":"self_created","tweet":"Good morning, on a picture perfect today in Washington http://t.co/LFhf4xgiO2","date":"Sat Apr 06 08:42:37 MDT 2013"},{"aspect":"self_created","tweet":"WH statement on the UN Sec.-General meeting says Pres. will consult with him on key issues, including Syria. Doesn't direct mention NK","date":"Fri Apr 05 16:35:11 MDT 2013"},{"aspect":"self_created","tweet":"UN Secretary General Ban Ki-moon will come to the White House Thursday for an Oval Office meeting with President Obama","date":"Fri Apr 05 16:31:26 MDT 2013"},{"aspect":"self_created","tweet":"Gov. Chris Christie will spend his Sunday night at Wrestlemania 29 inside MetLife Stadium in East Rutherford, NJ","date":"Fri Apr 05 16:21:11 MDT 2013"},{"aspect":"self_created","tweet":"Kamala Harris spokesperson: she and pres. have been friends for years, \"had a great conversation..and she strongly supports him\"","date":"Fri Apr 05 13:25:59 MDT 2013"},{"aspect":"self_created","tweet":"Carney: Pres. Obama \"fully recognizes the challenge women continue to face in the workplace.. they should not be judged based on appearance\"","date":"Fri Apr 05 12:21:22 MDT 2013"},{"aspect":"self_created","tweet":"Air Force One takes off from Denver headed for San Francisco, where Pres. Obama holds two fundraisers for DCCC and DNC. Back to DC Thurs.","date":"Wed Apr 03 16:45:09 MDT 2013"},{"aspect":"self_created","tweet":"Protesters outside as Pres. Obama left Denver stop. Pool says 1 sign read, \"What part of 'Shall not be infringed' do you not understand?\"","date":"Wed Apr 03 16:43:35 MDT 2013"},{"aspect":"self_created","tweet":"Rand Paul's NH GOP speech on May 20 comes 10 days after he headlines a party dinner in Iowa","date":"Wed Apr 03 15:59:25 MDT 2013"},{"aspect":"self_created","tweet":"WH official says Pres. Obama will give back 5% of his salary to \"share in the sacrifice being made by public servants\" hit by furloughs","date":"Wed Apr 03 13:12:03 MDT 2013"},{"aspect":"self_created","tweet":"About 40 Hillary Clinton supporters rallied outside Kennedy Center appearance. (Photo from CNN's Skip Nocciolo) http://t.co/BtN8tDN0bg","date":"Tue Apr 02 16:36:57 MDT 2013"},{"aspect":"self_created","tweet":"Christie spokesman says of coach video \"there are questions about this behavior that need to be answered by the leaders at Rutgers\"","date":"Tue Apr 02 16:27:07 MDT 2013"},{"aspect":"self_created","tweet":"Spokesman says Gov. Chris Christie saw video of Rutgers BB coach Mike Rice for first time today, \"deeply disturbed by the conduct displayed\"","date":"Tue Apr 02 16:26:03 MDT 2013"},{"aspect":"self_created","tweet":"Busy May 3rd in South Carolina. @PeterHambyCNN reports Ted Cruz will headline GOP dinner that night.VP Biden speaks at Dem dinner same night","date":"Tue Apr 02 05:51:54 MDT 2013"},{"aspect":"self_created","tweet":"VP Biden, Hillary Clinton will attend same event tomorrow night. Both speaking at the Vital Voices Global Leadership Awards at Kennedy Ctr","date":"Mon Apr 01 16:50:23 MDT 2013"},{"aspect":"self_created","tweet":"After they take part in event with first lady earlier in day, Pres. Obama will host cast and crew of \"42\" for WH screening of movie Tues","date":"Mon Apr 01 16:22:15 MDT 2013"},{"aspect":"self_created","tweet":"The pool says Hadiya's 10-year-old brother  Nathaniel played tennis with the president.","date":"Mon Apr 01 14:55:09 MDT 2013"},{"aspect":"self_created","tweet":"In addition to families of Newtown victims, mother and  brother of Chicago murder victim Hadiya Pendleton attended WH Easter Egg roll.","date":"Mon Apr 01 14:54:07 MDT 2013"},{"aspect":"self_created","tweet":"Congrats to the Wolverines and all my friends who bleed Maize and Blue. Represent the B1G well in Atlanta.","date":"Sun Mar 31 15:06:23 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama and his family have walked across Lafayette Park to attend Easter services at St. John’s Episcopal Church, pool says","date":"Sun Mar 31 09:21:03 MDT 2013"},{"aspect":"self_created","tweet":"RT @JFKucinich: Well, that was terrible. \n\nOhio State football starts in five months. #Buckeyes","date":"Sun Mar 31 05:27:51 MDT 2013"},{"aspect":"self_created","tweet":"A great season with a tough ending. This is further than I envisioned us going at the start of the year.","date":"Sat Mar 30 19:44:15 MDT 2013"},{"aspect":"self_created","tweet":"Not...done...yet","date":"Sat Mar 30 19:16:00 MDT 2013"},{"aspect":"self_created","tweet":"Bad karma? Watching the game with a table full of Michigan fans. This may be my fault.","date":"Sat Mar 30 18:47:53 MDT 2013"},{"aspect":"self_created","tweet":"No need to panic yet. Trust in Matta, Craft and Thomas. But would to see the run start, um, kinda soon.","date":"Sat Mar 30 18:33:55 MDT 2013"},{"aspect":"self_created","tweet":"O - H!!","date":"Sat Mar 30 16:56:42 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama has arrived at Verizon Center, where Syracuse and Marquette are playing in the NCAA East Region finals","date":"Sat Mar 30 14:48:01 MDT 2013"},{"aspect":"self_created","tweet":"RT @Rob10TVSports: With Kansas and MSU losing tonight, #OhioState can become the only school in the country with 3 Final Four appearance ...","date":"Fri Mar 29 22:24:35 MDT 2013"},{"aspect":"self_created","tweet":"@GarrettHaake better the conference does, better OSU. Pushes back to the naysayers who called Big 10 overrated.","date":"Fri Mar 29 17:41:48 MDT 2013"},{"aspect":"self_created","tweet":"In the name of the Big 10, pulling for Michigan and Michigan State tonight.","date":"Fri Mar 29 17:38:00 MDT 2013"},{"aspect":"self_created","tweet":"Ben Carson tells Wolf Blitzer on Situation Room he could back a presidential candidate who supports same sex marriage, not a one-issue voter","date":"Fri Mar 29 15:13:55 MDT 2013"},{"aspect":"self_created","tweet":"Michelle Obama will do student workshop w/ cast and crew of movie \"42\" Tues. Jackie Robinson's widow Rachel and Harrison Ford take part","date":"Fri Mar 29 14:50:57 MDT 2013"},{"aspect":"CNN Super Tuesday","tweet":"RT @AWMooneyCNN: oops WH covered chinese crane co. ZMPC's logos with US flags but 1 fell down b4 speech http://t.co/3pT3BilT62","date":"Fri Mar 29 12:36:05 MDT 2013"},{"aspect":"self_created","tweet":"@CNNJustin your fantasy team namesake, no?","date":"Fri Mar 29 11:00:41 MDT 2013"},{"aspect":"self_created","tweet":"RT @TIM_MAYsports: Ross -- found out he is using Kobe Bryant's locker in the Lakers locker room. That's cool.","date":"Thu Mar 28 20:46:37 MDT 2013"},{"aspect":"self_created","tweet":"On to the Elite 8. I can't take many more of these finishes. But wow. O - H!!!","date":"Thu Mar 28 20:03:26 MDT 2013"},{"aspect":"self_created","tweet":"Ross!!! Unreal","date":"Thu Mar 28 20:00:59 MDT 2013"},{"aspect":"self_created","tweet":"@chucktodd not coming over to the Buckeyes?","date":"Thu Mar 28 19:24:15 MDT 2013"},{"aspect":"self_created","tweet":"What an incredible run for the Buckeyes, sometimes at their best when forced to fight back.","date":"Thu Mar 28 19:12:23 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama on Mandela (more). \"... and hopefully he will, he will come out of this latest challenge\"","date":"Thu Mar 28 14:31:34 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama said of Mandela, \" He is as strong physically as he’s been in character and in leadership over so many decades...\"(more)","date":"Thu Mar 28 14:30:45 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama on Mandela: \"We're all deeply concerned with Mr. Mandela's health. He's a hero to all of us\"","date":"Thu Mar 28 14:07:17 MDT 2013"},{"aspect":"self_created","tweet":"The aforementioned Denver trip for the President will be on Wednesday, WH says","date":"Thu Mar 28 11:41:35 MDT 2013"},{"aspect":"self_created","tweet":"President Obama going to Denver Tuesday to push for gun control measures. (State just passed tougher rules)","date":"Thu Mar 28 11:18:29 MDT 2013"},{"aspect":"self_created","tweet":"White House says April 10th will be day budget is released. (That night, he'll have the second dinner with another 12 GOP Senators)","date":"Thu Mar 28 10:53:03 MDT 2013"},{"aspect":"self_created","tweet":"President Obama will sign executive order this afternoon to form election reform commission...idea first mentioned in State of the Union","date":"Thu Mar 28 10:51:46 MDT 2013"},{"aspect":"self_created","tweet":"NRA says no record of  \"member relationship\" with Adam Lanza or his mother. \"Reporting to the contrary is reckless, false and defamatory\"","date":"Thu Mar 28 10:14:34 MDT 2013"},{"aspect":"self_created","tweet":"4 Big Ten teams in the Sweet 16 so far. Just sayin'.","date":"Sun Mar 24 15:06:36 MDT 2013"},{"aspect":"self_created","tweet":"RT @TIM_MAYsports: Thad Matta just said on CBS he hopes some day they put up a statue of Aaron Craft in front of OSU basketball building.","date":"Sun Mar 24 12:50:42 MDT 2013"},{"aspect":"self_created","tweet":"Ice cold, Craft. On to the Sweet 16. The curse of Siena is broken in Dayton.","date":"Sun Mar 24 12:37:41 MDT 2013"},{"aspect":"self_created","tweet":"Wow!!!!!!","date":"Sun Mar 24 12:30:40 MDT 2013"},{"aspect":"self_created","tweet":"I trust Craft and I trust Coach Matta. #gobucks","date":"Sun Mar 24 12:26:16 MDT 2013"},{"aspect":"self_created","tweet":"In Columbus. Debating whether worth driving through snowstorm for the Buckeye tourney game in Dayton tomorrow. Ok, it's worth it...","date":"Sat Mar 23 15:14:55 MDT 2013"},{"aspect":"self_created","tweet":"I think Michigan just reminded everyone how good the Big Ten really is this year","date":"Sat Mar 23 12:16:18 MDT 2013"},{"aspect":"self_created","tweet":"Bad news: My bracket is in last place currently. Good news: all of my Final Four teams are still alive.","date":"Sat Mar 23 08:20:07 MDT 2013"},{"aspect":"self_created","tweet":"@RyanSloaneCNN @Jennmoxley @maryloumoloney @alejandrasoto_ @MichaelHLN @JournoMaggie @hunterschwarz thanks, Ryan!","date":"Fri Mar 22 16:08:48 MDT 2013"},{"aspect":"self_created","tweet":"White House says President Obama is heading to Miami next Friday for an event on the economy","date":"Fri Mar 22 15:00:38 MDT 2013"},{"aspect":"self_created","tweet":"Little girl asks Christie at town hall if he'll run for president. He tells her you can't worry about 4th grade until you finish 3rd grade","date":"Thu Mar 21 15:30:58 MDT 2013"},{"aspect":"self_created","tweet":"Officials emphasized this is prelim conclusion and investigation continues, but analysts \"leaning hard away\" from Syria using chem weapons","date":"Thu Mar 21 14:47:07 MDT 2013"},{"aspect":"self_created","tweet":"Just in: Barbara Starr reports preliminary US intelligence suggests Syria did not use chemical weapons in strike earlier this week","date":"Thu Mar 21 14:45:04 MDT 2013"},{"aspect":"self_created","tweet":"(2) Mayor's office said that the fortress was only reachable by bridge that fell after Pres and VP crossed, sending vips into the drink","date":"Thu Mar 21 13:05:39 MDT 2013"},{"aspect":"self_created","tweet":"One didn't go so well. In 1833, Pres. Jackson and VP Van Buren went there after touring an old fortress, Castle Garden (more)","date":"Thu Mar 21 13:04:28 MDT 2013"},{"aspect":"self_created","tweet":"NYC Mayor's office says VP Biden's visit was only 4th ever by a sitting Vice President to City Hall, and first since Mondale in 1979","date":"Thu Mar 21 13:02:58 MDT 2013"},{"aspect":"self_created","tweet":"In Texas, 6 dead, 9 hurt when truck being pursued by police & Border Patrol crashed into security barrier at Naval Air Station Kingsville","date":"Thu Mar 21 12:10:41 MDT 2013"},{"aspect":"self_created","tweet":"The pool says the heckler was yelling about Pollard","date":"Thu Mar 21 09:11:02 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama jokes he arranged heckler at Jerusalem speech so he'd feel at home, \"wouldn’t feel comfortable \" without \"at least 1 heckler.”","date":"Thu Mar 21 09:10:16 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama: once we establish facts, the use of chemical weapons would be a game changer...\"having the facts before you act is very impt\"","date":"Wed Mar 20 12:49:07 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama: will \"investigate thoroughly\" the chemical weapons claim in Syria, need to find out \"precisely if this red line was crossed\"","date":"Wed Mar 20 12:47:18 MDT 2013"},{"aspect":"CNN Super Tuesday","tweet":"RT @AdamATCNN: Iron Dome tour guide: \"Just follow the red line\" OBAMA: \"Bibi's always talking about red lines.\" BIBI: [laughing] This wa ...","date":"Wed Mar 20 12:16:26 MDT 2013"},{"aspect":"self_created","tweet":"The news conference with Pres. Obama and Prime Minister Netanyahu is delayed a bit...now expected to start at 2:25pm ET.","date":"Wed Mar 20 12:11:41 MDT 2013"},{"aspect":"self_created","tweet":"Boehner to @jaketapper: 'The president's  meeting with the president of Israel. He's got his legislative issues, the president's got his\"","date":"Wed Mar 20 11:54:30 MDT 2013"},{"aspect":"self_created","tweet":"Boehner tells @jaketapper on The Lead says \"I'd rather be heckled than ignored. Or as I like to say, you only tease the ones you love\"","date":"Wed Mar 20 11:53:27 MDT 2013"},{"aspect":"self_created","tweet":"On The Lead with @jaketapper: Speaker Boehner jokes \"so much for the charm offensive\" after Pres. Obama's good to be away from Congress quip","date":"Wed Mar 20 11:51:51 MDT 2013"},{"aspect":"self_created","tweet":"Still too early to tell who will be Sanford's runoff opponent April 2nd. Bostic and Grooms in a tight race for 2nd","date":"Tue Mar 19 19:38:07 MDT 2013"},{"aspect":"self_created","tweet":"CNN can project there will be a runoff in the SC-1 GOP primary, and that Sanford will be one of the two candidates to advance.","date":"Tue Mar 19 18:54:05 MDT 2013"},{"aspect":"self_created","tweet":"CNN can now project Elizabeth Colbert Busch, the sister of Stephen Colbert, the winner of the Democratic primary in the SC-1.","date":"Tue Mar 19 18:29:58 MDT 2013"},{"aspect":"self_created","tweet":"On Democratic side, with 11% of Charleston County, Colbert Busch has commanding lead with 96% of vote so  far.","date":"Tue Mar 19 18:25:42 MDT 2013"},{"aspect":"self_created","tweet":"About 11% of biggest county in: on GOP side, Sanford at 38%, Bostic at nearly 17%, Turner at 10%, Grooms and Limestone around  9%.","date":"Tue Mar 19 18:24:54 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama arriving at Joint Base Andrews, about to head to Israel. Did not answer questions on Syria as he left White House","date":"Tue Mar 19 18:02:03 MDT 2013"},{"aspect":"self_created","tweet":"On Democratic side, just under 600 votes counted so far. Colbert Busch has 93% of that vote.","date":"Tue Mar 19 18:00:36 MDT 2013"},{"aspect":"self_created","tweet":"VERY early numbers in SC1: just 1335 votes in so far. Sanford getting 40 percent of the vote. Bostic at 14%, Limehouse 13%.","date":"Tue Mar 19 17:59:22 MDT 2013"},{"aspect":"self_created","tweet":"The polls are now closed in the wild South Carolina 1st Congressional district special primary.","date":"Tue Mar 19 17:00:29 MDT 2013"},{"aspect":"self_created","tweet":"Feinstein on Syria: Probabilities are very high that we're going into some very dark times, and I think the WH needs to be prepared\"","date":"Tue Mar 19 16:42:04 MDT 2013"},{"aspect":"self_created","tweet":"Senate Intel Chair Dianne Feinstein on CNN: \"The White House has to make some decisions...I think the days are becoming more desperate\"","date":"Tue Mar 19 16:34:31 MDT 2013"},{"aspect":"self_created","tweet":"House Intel chair Mike Rogers on CNN's Situation Room: \"I have a high probability to believe that chemical weapons were used\" in Syria","date":"Tue Mar 19 16:32:42 MDT 2013"},{"aspect":"self_created","tweet":"McCain/Graham on Syria (4): \"...against Assad’s aircraft and SCUD missile batteries on the ground\"","date":"Tue Mar 19 13:36:54 MDT 2013"},{"aspect":"self_created","tweet":"McCain/Graham (3): \"That should include the provision of arms to vetted Syrian opposition groups,  targeted strikes...\" (more)","date":"Tue Mar 19 13:36:13 MDT 2013"},{"aspect":"self_created","tweet":"McCain/Graham on Syria (2): \"... to take immediate action to impose the consequences he has promised\"","date":"Tue Mar 19 13:31:42 MDT 2013"},{"aspect":"self_created","tweet":"McCain and Graham on Syria: \"if today’s reports are substantiated, the President’s red line has been crossed...we would urge him (more)","date":"Tue Mar 19 13:31:10 MDT 2013"},{"aspect":"self_created","tweet":"Tornado warnings issues for north end of the Atlanta metro area","date":"Mon Mar 18 16:06:17 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama's message to the Iranian people on eve of his Middle East trip. \nhttp://t.co/xNZBE08BfZ","date":"Mon Mar 18 15:51:29 MDT 2013"},{"aspect":"self_created","tweet":"The State Dept. calls Syria’s use of fighter jets to fire rockets into Lebanon a “significant escalation\"","date":"Mon Mar 18 12:37:17 MDT 2013"},{"aspect":"self_created","tweet":"Producers of \"The Bible\" series call claims of resemblance \"utter nonsense\" http://t.co/Y52JPFO6Vb","date":"Mon Mar 18 12:22:50 MDT 2013"},{"aspect":"self_created","tweet":"The bombers were used in the exercise March 8th, will fly again tomorrow. Part of an effort to send NK message on commitment to defend SK","date":"Mon Mar 18 10:42:26 MDT 2013"},{"aspect":"self_created","tweet":"Pentagon Correspondent Chris Lawrence reports the US military using B-52 bombers in joint exercise in South Korea (more)","date":"Mon Mar 18 10:37:49 MDT 2013"},{"aspect":"self_created","tweet":"Priebus: party hurt in last election by some \"biologically stupid\" comments","date":"Mon Mar 18 07:06:50 MDT 2013"},{"aspect":"self_created","tweet":"Priebus: \"We have to stop divorcing ourselves from American culture. And maybe that means I get to sit down with the ladies of the View\"","date":"Mon Mar 18 06:52:49 MDT 2013"},{"aspect":"self_created","tweet":"Priebus: \"The report minces no words in telling us that we have to be more inclusive. I agree. Our 80% friend is not our 20% enemy\"","date":"Mon Mar 18 06:45:37 MDT 2013"},{"aspect":"self_created","tweet":"Priebus addresses National Press Club on RNC report http://t.co/FGwNET8tbQ","date":"Mon Mar 18 06:43:25 MDT 2013"},{"aspect":"self_created","tweet":"Priebus on key takeaway of the report: \"we know we have problems, we’ve identified them, and we’re implementing the solutions to fix them\"","date":"Mon Mar 18 06:42:01 MDT 2013"},{"aspect":"self_created","tweet":"More Priebus on report: \"we weren’t inclusive; we were behind in both data and digital; our primary and debate process needed improvement\"","date":"Mon Mar 18 06:40:50 MDT 2013"},{"aspect":"self_created","tweet":"RNC chair Reince Priebus on \"frank\" report: \"there’s no one reason we lost. Our message was weak; our ground game was insufficient\"","date":"Mon Mar 18 06:40:04 MDT 2013"},{"aspect":"self_created","tweet":"Early start to this Monday morning. With @prestonCNN covering the RNC report at the National Press Club.","date":"Mon Mar 18 03:26:40 MDT 2013"},{"aspect":"self_created","tweet":"Accident happened in Baton Rogue as Jindal returned from son's soccer game. Driver of the truck cited for illegal turn.","date":"Sun Mar 17 20:21:14 MDT 2013"},{"aspect":"self_created","tweet":"Minor accident involving LA Gov. Jindal today. State vehicle sideswiped by box truck. Gov unhurt. Minor injuries to trooper in 2nd SUV.","date":"Sun Mar 17 20:19:57 MDT 2013"},{"aspect":"self_created","tweet":"I like Ohio State's draw. A lot. That second round game will be a tough one...but glad it's close to home in Dayton. #gobucks!","date":"Sun Mar 17 16:51:09 MDT 2013"},{"aspect":"self_created","tweet":"Big Ten Tournament Champs!!! #gobucks","date":"Sun Mar 17 15:22:23 MDT 2013"},{"aspect":"self_created","tweet":"No St. Patrick's Day celebrating outside of the White House today. He played basketball with his daughter, and is now in for the night.","date":"Sun Mar 17 15:03:16 MDT 2013"},{"aspect":"self_created","tweet":"O - H!  #gobucks","date":"Sun Mar 17 13:40:33 MDT 2013"},{"aspect":"self_created","tweet":"Go Buckeyes! 7th time in 9 years Coach Matta has OSU in the conference championship. Especially impressive this year.","date":"Sun Mar 17 12:49:59 MDT 2013"},{"aspect":"CNN Super Tuesday","tweet":"RT @PrestonCNN: I highlight Ben Carson as a new face of conservatism: http://t.co/68xxCzGj1C  He will be interviewed by @crowleyCNN on C ...","date":"Sun Mar 17 06:40:07 MDT 2013"},{"aspect":"self_created","tweet":"I think I brought the Buckeyes luck by not being able to watch today's game. Sweated it out by Twitter inside the CPAC ballroom. #gobucks","date":"Sat Mar 16 16:20:18 MDT 2013"},{"aspect":"self_created","tweet":"Ann Coulter was asked in her q and a if Christie should have been invited. Several people in crowd shouted no.","date":"Sat Mar 16 15:08:57 MDT 2013"},{"aspect":"self_created","tweet":"Applause alert. 5 #CPAC2013 speakers who so far have had biggest crowd reaction: Paul, Walker, Carson, Rubio and Palin","date":"Sat Mar 16 10:50:38 MDT 2013"},{"aspect":"self_created","tweet":"Palin: \"now is the time to furlough the consultants...if we truly know what we believe, we don't need the professionals to tell us\"","date":"Sat Mar 16 10:32:30 MDT 2013"},{"aspect":"self_created","tweet":"Cruz tells crowd \"I would not be in the U.S. Senate today without Gov. Sarah Palin\"","date":"Sat Mar 16 10:11:35 MDT 2013"},{"aspect":"self_created","tweet":"Ted Cruz makes surprise appearance to introduce Sarah Palin to full house at CPAC. Listing all the recent winning politicians Palin backed","date":"Sat Mar 16 10:11:01 MDT 2013"},{"aspect":"self_created","tweet":"Asked if he's entering politics, Carson says he's very dedicated to education, then says \"who knows\" what we could do next.","date":"Sat Mar 16 09:01:00 MDT 2013"},{"aspect":"self_created","tweet":"Ben Carson, the neurosurgeon turned political speaker, is retiring from medicine in 3 months. Says there's more that can be done","date":"Sat Mar 16 09:00:06 MDT 2013"},{"aspect":"self_created","tweet":"Huge applause line for Walker says he says America celebrates the 4th of July, not April 15th","date":"Sat Mar 16 07:36:10 MDT 2013"},{"aspect":"self_created","tweet":"Loud applause for Scott Walker as he's introduced at CPAC. One person waves large \"don't tread on me\" flag","date":"Sat Mar 16 07:22:39 MDT 2013"},{"aspect":"self_created","tweet":"Part of crowd at CPAC briefly booed mention of John McCain and Lindsey Graham as speaker criticized them","date":"Sat Mar 16 07:03:47 MDT 2013"},{"aspect":"self_created","tweet":"Not a full house for Bobby Jindal as he addresses CPAC. About three-quarters full.","date":"Fri Mar 15 12:50:58 MDT 2013"},{"aspect":"self_created","tweet":"@CNNJustin. Kid Rock \"Born Free\" was my flashback moment. @MarlenaCNN @cnnjanet @cnnemily","date":"Fri Mar 15 11:43:36 MDT 2013"},{"aspect":"self_created","tweet":"Romney mentions Christie and McDonnell, not invited to CPAC, as he says look to Governors for ideas and leadership.","date":"Fri Mar 15 11:41:20 MDT 2013"},{"aspect":"self_created","tweet":"Loud cheers for Mitt Romney as he takes stage","date":"Fri Mar 15 11:33:03 MDT 2013"},{"aspect":"self_created","tweet":"Crowd at CPAC was standing room only for Marco Rubio and Rand Paul. Good crowd but areas of empty seats for Rick Perry.","date":"Thu Mar 14 13:30:11 MDT 2013"},{"aspect":"self_created","tweet":"Marco Rubio and Rand Paul speak to CPAC next hour. Brianna Keilar notes they are missing the President's meeting with Senate Republicans","date":"Thu Mar 14 10:52:46 MDT 2013"},{"aspect":"self_created","tweet":"Jeb Bush spokesman tells @jaketapper \"we asked not to be included, as Gov Bush has said repeatedly, it is too early to think about 2016\"","date":"Thu Mar 14 10:08:36 MDT 2013"},{"aspect":"self_created","tweet":"Our @psteinhauserCNN reports there will be 23 names on the CPAC straw ballot. Jeb Bush won't be one of then. He asked not to be included","date":"Thu Mar 14 09:24:59 MDT 2013"},{"aspect":"self_created","tweet":"As CPAC speaker talks about attracting wider range of voters to party, someone in audience yells \"legally\"","date":"Thu Mar 14 08:58:05 MDT 2013"},{"aspect":"self_created","tweet":"Oops. Accidental f-bomb at CPAC as Mumford and Sons song plays unbleeped between speakers","date":"Thu Mar 14 08:54:31 MDT 2013"},{"aspect":"self_created","tweet":"Vice President Biden will lead the U.S. delegation for the installation of Pope Francis.","date":"Wed Mar 13 14:49:44 MDT 2013"},{"aspect":"self_created","tweet":"From sources, a member in the room said if that meant WH tours were open again. There was laughter, and Pres. joked back, Vatican tours are","date":"Wed Mar 13 12:38:32 MDT 2013"},{"aspect":"self_created","tweet":"Deirdre Walsh says Pres. Obama was passed a note in the House GOP meeting by his staff on the white smoke, and he announced it the room.","date":"Wed Mar 13 12:33:35 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama has arrived for his second day of meetings at the Capitol...today with House Republicans","date":"Wed Mar 13 11:36:44 MDT 2013"},{"aspect":"self_created","tweet":"President Obama departing the Capitol after the meeting with Senate Democrats. (Sorry, I have no black smoke or anything to offer).","date":"Tue Mar 12 12:58:00 MDT 2013"},{"aspect":"self_created","tweet":"President Obama heading to the Capitol. He will get even more familiar with the drive...doing it 3 times this week","date":"Tue Mar 12 11:30:38 MDT 2013"},{"aspect":"self_created","tweet":"Boehner spokesman Brendan Buck: \"We certainly take Mr. Carney at his word, but the proof will be in the  follow-through\"","date":"Tue Mar 12 11:28:31 MDT 2013"},{"aspect":"CNN Super Tuesday","tweet":"RT @jimacostacnn: Carney says anonymous admin official who called president's outreach a \"joke\" does not speak on behalf of Obama or WH.","date":"Tue Mar 12 11:05:03 MDT 2013"},{"aspect":"self_created","tweet":"US officials tell Barbara Starr the 5 service members killed in the helicopter crash in southern Afghanistan were American.","date":"Tue Mar 12 05:01:33 MDT 2013"},{"aspect":"self_created","tweet":"The cause of the chopper crash is under investigation, but the ISAF says there was no evidence of enemy activity in the area.","date":"Mon Mar 11 18:10:35 MDT 2013"},{"aspect":"self_created","tweet":"5 ISAF service members were killed in a helicopter crash in southern Afghanistan yesterday. No word yet on nationalities.","date":"Mon Mar 11 18:02:48 MDT 2013"},{"aspect":"self_created","tweet":"Mayor Bloomberg 5:30pm news conference reacting to court ruling on sugary drink restriction. (Disclosure: sent w/ soda sitting on my desk)","date":"Mon Mar 11 14:38:36 MDT 2013"},{"aspect":"self_created","tweet":"Rep. Fudge: CBC has recommended \"a number of qualified candidates. I am disappointed none have received the consideration they deserve\"","date":"Mon Mar 11 14:15:48 MDT 2013"},{"aspect":"self_created","tweet":"Rep. Marcia Fudge writes \"the people you have chosen to appoint in this new term have hardly been reflective of this country’s diversity:","date":"Mon Mar 11 14:13:30 MDT 2013"},{"aspect":"self_created","tweet":"Congressional Black Caucus chair sends Pres Obama a letter expressing concern no cabinet appointees so far have been African-American","date":"Mon Mar 11 14:12:41 MDT 2013"},{"aspect":"self_created","tweet":"@MelissaHeyboer Today is an 'enemy of my enemy' day...rooting for Michigan so Bucks get a share of the Big Ten title. So. #goblue #gobucks","date":"Sun Mar 10 14:24:41 MDT 2013"},{"aspect":"self_created","tweet":"Jeb Bush on meeting happening without Pres. comments before or after; \"Ronald Reagan would have done that, George Bush would have done that","date":"Fri Mar 08 13:58:25 MST 2013"},{"aspect":"self_created","tweet":"Jeb Bush at Reagan Library on Pres. Obama meeting with GOP Senators, Ryan: \"This is a change that I think we should encourage\"","date":"Fri Mar 08 13:57:27 MST 2013"},{"aspect":"self_created","tweet":"Latest on Rand Paul from @danabashCNN\n\nhttp://t.co/926PRGyUFQ","date":"Fri Mar 08 13:54:07 MST 2013"},{"aspect":"self_created","tweet":"Vice President Biden will administer the oath to new CIA Director John Brennan shortly in private ceremony at the White House","date":"Fri Mar 08 08:01:36 MST 2013"},{"aspect":"self_created","tweet":"Our Kevin Bohn reports Pres. Obama met today with group of Jewish community leaders at WH to get input about his upcoming trip to Israel.","date":"Thu Mar 07 17:02:39 MST 2013"},{"aspect":"self_created","tweet":"Final confirmation vote on Brennan now beginning","date":"Thu Mar 07 13:30:44 MST 2013"},{"aspect":"self_created","tweet":"The procedural vote is now underway","date":"Thu Mar 07 13:04:53 MST 2013"},{"aspect":"self_created","tweet":"There will be two votes...the procedural one to allow the vote to go forward (60 votes needed) and then the vote on the confirmation","date":"Thu Mar 07 12:56:31 MST 2013"},{"aspect":"self_created","tweet":"With Rand Paul agreeing to allow it to move forward, the Senate votes on Brennan's confirmation will start in about 20 minutes","date":"Thu Mar 07 12:55:18 MST 2013"},{"aspect":"self_created","tweet":"McCain on floor disagrees with Rand Paul's drone arguments, says \"I don’t think what happened yesterday was helpful to the American people\"","date":"Thu Mar 07 09:49:11 MST 2013"},{"aspect":"self_created","tweet":"Sen. Tim Scott now on the Senate floor at 12:13am (fixes time)","date":"Wed Mar 06 22:16:02 MST 2013"},{"aspect":"self_created","tweet":"From RNC Chair at 11:43pm: @Reince: Attention all Republican US Senators -> Please go to the floor and help out @SenRandPaul #StandWithRand","date":"Wed Mar 06 21:59:40 MST 2013"},{"aspect":"self_created","tweet":"The filibuster has now lasted 12 hours","date":"Wed Mar 06 21:49:18 MST 2013"},{"aspect":"self_created","tweet":"The other Senators at the dinner with Pres. Obama were Coats, Johanns, Johnson, Hoeven and Chambliss.","date":"Wed Mar 06 19:31:16 MST 2013"},{"aspect":"self_created","tweet":"Other Senators spotted by pool leaving the dinner with the president: Burr, Toomey and Corker.","date":"Wed Mar 06 19:02:14 MST 2013"},{"aspect":"self_created","tweet":"President Obama returns to the White House after dinner with GOP Senators. Some seen leaving: McCain, Graham, Coburn, Chambliss, Ayotte.","date":"Wed Mar 06 18:51:00 MST 2013"},{"aspect":"self_created","tweet":"Tea Party Express chair @AmyKremer has sent a series of tweets urging other GOP Senators to \"stand with Rand\" on filibuster","date":"Wed Mar 06 18:34:02 MST 2013"},{"aspect":"self_created","tweet":"This filibuster started around 11:47am...has now passed the 7-hour mark","date":"Wed Mar 06 16:52:58 MST 2013"},{"aspect":"self_created","tweet":"Rand Paul says he's had no communication with WH and Justice Dept. since filibuster began.","date":"Wed Mar 06 16:42:31 MST 2013"},{"aspect":"self_created","tweet":"President Obama has arrived at the Jefferson Hotel in downtown DC for dinner with GOP Senators. Wet, not snowy, streets for ride over","date":"Wed Mar 06 16:25:57 MST 2013"},{"aspect":"self_created","tweet":"There will not be a vote on the Brennan nomination tonight","date":"Wed Mar 06 14:51:50 MST 2013"},{"aspect":"self_created","tweet":"Rubio jokes to Rand Paul, \"I know you've been here awhile. Let me give you some advice: keep some water nearby. Trust me.\"","date":"Wed Mar 06 14:28:18 MST 2013"},{"aspect":"self_created","tweet":"Sen. Rubio speaking now on the Senate floor during filibuster","date":"Wed Mar 06 14:22:13 MST 2013"},{"aspect":"self_created","tweet":"Sen. Lee now on the Senate floor, speaking on Paul's filibuster after he spoke for just over 3 hours.","date":"Wed Mar 06 13:00:08 MST 2013"},{"aspect":"self_created","tweet":"Interesting watching an old school filibuster","date":"Wed Mar 06 12:08:18 MST 2013"},{"aspect":"self_created","tweet":"Deirdre Walsh reports Paul Ryan told reporters he spoke with Pres. Obama this week, but said he'd keep conversation confidential","date":"Wed Mar 06 11:19:53 MST 2013"},{"aspect":"self_created","tweet":"Obama: US \"remains committed to  policies that promote democratic principles, the rule of law, and respect for human rights.\"","date":"Tue Mar 05 16:27:59 MST 2013"},{"aspect":"self_created","tweet":"Pres. Obama: US \"reaffirms its support for the Venezuelan people...interest in developing constructive relationship with the Venezuelan govt","date":"Tue Mar 05 16:26:21 MST 2013"},{"aspect":"self_created","tweet":"The president also took part in a promotion ceremony during the visit. He met with 10 soldiers, 5 Marines and 1 NATO service member","date":"Tue Mar 05 14:33:31 MST 2013"},{"aspect":"self_created","tweet":"Pool says Pres. Obama met w/ 16 wounded service members during visit Walter Reed medical center visit, awarded 2 Purple Hearts","date":"Tue Mar 05 14:32:28 MST 2013"},{"aspect":"self_created","tweet":"Pres.Obama returns to White House from visit to wounded warriors, declines to answer question on White House tours being suspended","date":"Tue Mar 05 14:07:56 MST 2013"},{"aspect":"self_created","tweet":"Sen. Cornyn tells reporters on Capitol Hill, \"President Obama reminds me of the little boy who cried wolf.\", \"credibility has been strained\"","date":"Tue Mar 05 12:24:24 MST 2013"},{"aspect":"self_created","tweet":"Airport and Air Force say the Lear jet involved is not a military aircraft","date":"Mon Mar 04 12:21:09 MST 2013"},{"aspect":"self_created","tweet":"The small jet with possible landing gear problems outside St. Louis has Air Force markings on it,","date":"Mon Mar 04 11:52:48 MST 2013"},{"aspect":"CNN Super Tuesday","tweet":"RT @jimacostacnn: Duncan apologizes for sequester comments last week:  \"so when I said \"pink slips\" that was probably the wrong word.\" 2/2","date":"Mon Mar 04 11:28:55 MST 2013"},{"aspect":"CNN Super Tuesday","tweet":"RT @jimacostacnn: Duncan apologized this morning for pink slips comment:  \"I want to apologize for not being as clear as I should've bee ...","date":"Mon Mar 04 11:28:42 MST 2013"},{"aspect":"self_created","tweet":"We'll have a live report in just a few minutes from the bridge in Selma, with CNN's Victor Blackwell","date":"Sun Mar 03 14:11:14 MST 2013"},{"aspect":"self_created","tweet":"Thousands took part in the crossing, marking the 48th anniversary of Bloody Sunday during the Selma to Montgomery voting rights march.","date":"Sun Mar 03 14:10:34 MST 2013"},{"aspect":"self_created","tweet":"Vice President Biden moments ago led the march across the Edmund Pettus Bridge in Selma, armed locked with Congressman John Lewis.","date":"Sun Mar 03 14:09:25 MST 2013"},{"aspect":"self_created","tweet":"Worst of all, my brother and sister-in-law are Blackhawk fans. #traitors","date":"Sun Mar 03 13:18:49 MST 2013"},{"aspect":"self_created","tweet":"I do not like or embrace that last tweet. But it is an amazing stat. #gowings","date":"Sun Mar 03 13:07:13 MST 2013"},{"aspect":"self_created","tweet":"RT @BaichwalABC7: I love doing this calculation: 45.8% of the season is over and the #Blackhawks have not lost in regulation","date":"Sun Mar 03 13:05:57 MST 2013"},{"aspect":"self_created","tweet":"RT @capitalweather: Snow odds in DC Wed: At least 1\" 70%, 5\" 45%, 10\" 10%: http://t.co/thXLsKRxFz","date":"Sun Mar 03 12:20:51 MST 2013"},{"aspect":"self_created","tweet":"Favorite name I've seen on Twitter so far for DC's possible snowstorm this week: Snowquester","date":"Sun Mar 03 10:59:49 MST 2013"},{"aspect":"self_created","tweet":"Hoping to see the Blackhawks' point streak come to a crashing halt in Detroit! #gowings","date":"Sun Mar 03 10:44:15 MST 2013"},{"aspect":"self_created","tweet":"RT @shirleyhenrycnn: Sen McConnell said he's open to reconfiguring the cuts but says the president doesn't seem interested in doing so","date":"Sun Mar 03 07:45:56 MST 2013"},{"aspect":"self_created","tweet":"Romney says 47 percent remark \"did real damage\"to his campaign, says it was not what he believes.","date":"Sun Mar 03 07:28:40 MST 2013"},{"aspect":"self_created","tweet":"Romney: \"this is a critical time...Nero is fiddling\"","date":"Sun Mar 03 07:24:08 MST 2013"},{"aspect":"self_created","tweet":"Romney: \"hardest thing about losing\" is watching \"this golden moment\" slipping away","date":"Sun Mar 03 07:22:02 MST 2013"},{"aspect":"self_created","tweet":"Romney on Fox News Sunday: as he watches current events, \"it kills me not be there\" in office doing what needs to be done","date":"Sun Mar 03 07:19:47 MST 2013"},{"aspect":"self_created","tweet":"Ann Romney: \"I'm happy to blame the media\", says didn't give Romney fair shake on who he was.","date":"Sun Mar 03 07:10:35 MST 2013"},{"aspect":"self_created","tweet":"Obama and Putin will hold meeting around G8 summit in No. Ireland in June, and Obama will travel to Russia for G20 in St. Petersburg in Sept","date":"Fri Mar 01 16:18:24 MST 2013"},{"aspect":"self_created","tweet":"WH says they also discussed Iran, says Pres, Obama welcomed \"strong US-Russian cooperation in the P5+1 to address Iranian nuclear issue\"","date":"Fri Mar 01 16:16:23 MST 2013"},{"aspect":"self_created","tweet":"WH: Pres.Obama talked w/ Pres.Putin, \"agreed on need to advance a political transition\" in Syria to end violence as soon  as possible","date":"Fri Mar 01 16:14:57 MST 2013"},{"aspect":"self_created","tweet":"Congressman Peter King on Situation Room calls CPAC decision not to invite Chris Christie \"a suicidal death wish\"","date":"Fri Mar 01 15:39:40 MST 2013"},{"aspect":"self_created","tweet":"McConnell in statement says any solutions needs to come through \"regular order\", says \"I will not be part of any back room deal\"","date":"Fri Mar 01 11:21:16 MST 2013"},{"aspect":"self_created","tweet":"Sen. McConnell didn't talk to reporters after WH meeting. He'll be on CNN's State of the Union Sunday","date":"Fri Mar 01 10:15:02 MST 2013"},{"aspect":"self_created","tweet":"The WH meeting lasted 52 minutes, ending at 11:10am.","date":"Fri Mar 01 09:21:55 MST 2013"},{"aspect":"self_created","tweet":"The White House meeting officially began at 10:18am, the pool tells us.","date":"Fri Mar 01 08:29:21 MST 2013"},{"aspect":"self_created","tweet":"Speaker Boehner just arrived at the White House","date":"Fri Mar 01 08:07:43 MST 2013"},{"aspect":"self_created","tweet":"Confused about the sequester and forced budget cuts? @TomForemanCNN will answer your questions on CNN today. Tweet now using #AskTomCNN","date":"Fri Mar 01 07:14:29 MST 2013"},{"aspect":"CNN Super Tuesday","tweet":"RT @jimacostacnn: WH official on Woodward: \"note suggested that Mr. Woodward would regret the observation he made... because that observ ...","date":"Wed Feb 27 20:09:19 MST 2013"},{"aspect":"self_created","tweet":"Our Dana Bash and Jim Acosta report Pres. Obama has invited Congressional leaders to the WH Friday, day of forced spending cuts deadline","date":"Wed Feb 27 07:54:45 MST 2013"},{"aspect":"self_created","tweet":"Heading home from Charlotte by way of Atlanta. Thank you, Winthrop University, for the hospitality and very smart questions.","date":"Tue Feb 26 17:11:38 MST 2013"},{"aspect":"self_created","tweet":"Mayor Bloomberg at the White House tomorrow for a meeting on gun violence with Vice President Biden","date":"Tue Feb 26 16:56:38 MST 2013"},{"aspect":"self_created","tweet":"Excited to be at Winthrop University today as part of their Mass Communications Week.","date":"Tue Feb 26 05:06:23 MST 2013"},{"aspect":"CNN Super Tuesday","tweet":"RT @jimacostacnn: Jindal outside WH: \"the president needs to stop campaigning, stop trying to scare people.\"","date":"Mon Feb 25 11:15:30 MST 2013"},{"aspect":"self_created","tweet":"Great game in Columbus. O - H!  #gobucks","date":"Sun Feb 24 15:32:14 MST 2013"},{"aspect":"self_created","tweet":"VP Biden will go to Selma, Alabama next Sunday for the commemoration of the civil rights march, crossing of the Edmond Pettus Bridge","date":"Fri Feb 22 16:49:25 MST 2013"},{"aspect":"self_created","tweet":"Pres. Obama, asked if he sees any realistic signs of reaching deal on forced spending cuts, told reporters, \"hope springs eternal\"","date":"Fri Feb 22 13:03:09 MST 2013"},{"aspect":"self_created","tweet":"Gov. Bobby Jindal now confirmed to be a speaker at next month's CPAC Conference outside DC.","date":"Fri Feb 22 08:25:00 MST 2013"},{"aspect":"CNN Super Tuesday","tweet":"RT @jimacostacnn: Top GOP Hill aide on any new outreach from WH on sequester: \"No old outreach, no new outreach, no anything.\"","date":"Wed Feb 20 13:59:06 MST 2013"},{"aspect":"self_created","tweet":"Back to reality....this time yesterday I was in 70-degree Florida. Today, I'm walking in sleet.","date":"Tue Feb 19 07:35:38 MST 2013"},{"aspect":"self_created","tweet":"A look at the course where President Obama has been playing at Floridian in Palm City. We think this is 16th fairway. http://t.co/2GQpzjX3","date":"Mon Feb 18 11:00:18 MST 2013"},{"aspect":"self_created","tweet":"High profile but out of sight: Pres. Obama and Tiger Woods. http://t.co/Xaaobcqz","date":"Sun Feb 17 19:26:21 MST 2013"},{"aspect":"self_created","tweet":"The Floridian in Palm City. Where Pres. Obama is staying and where Golf Digest says he's playing golf with Tiger http://t.co/d2qWyvxP","date":"Sun Feb 17 11:31:46 MST 2013"},{"aspect":"self_created","tweet":"@Rachael_Russell officer must have been from Michigan. (Or a Gator)","date":"Sat Feb 16 14:01:07 MST 2013"},{"aspect":"self_created","tweet":"President has no public events scheduled...golf is on agenda (and according to Golf Digest lessons w/ex-Tiger Woods coach Butch Harmon)","date":"Sat Feb 16 09:13:48 MST 2013"},{"aspect":"self_created","tweet":"President Obama spending today at private resort in Palm City, Florida...","date":"Sat Feb 16 09:10:34 MST 2013"},{"aspect":"self_created","tweet":"Senator Rubio announces he's leaving today on official trip to Israel and Jordan","date":"Sat Feb 16 09:08:53 MST 2013"},{"aspect":"self_created","tweet":"Air Force One has landed in West Palm Beach. President heading to Palm Bay for weekend with friends and golf http://t.co/LQNTkWFK","date":"Fri Feb 15 18:37:57 MST 2013"},{"aspect":"self_created","tweet":"@gregorywallce found restaurant's website says \"here you will be taken on a culinary journey\". @zekejmiller notes a pricey one at that","date":"Thu Feb 14 17:13:37 MST 2013"},{"aspect":"self_created","tweet":"The President and First Lady are celebrating Valentine's Day at a hot DC ticket...a restaurant called MiniBar in the Penn Quarter area","date":"Thu Feb 14 17:10:12 MST 2013"},{"aspect":"CNN Super Tuesday","tweet":"RT @jimacostacnn: Rubio turning water into $ tonight. His PAC selling the Marco Water Bottle:  http://t.co/IpdNp7kS","date":"Wed Feb 13 19:06:15 MST 2013"},{"aspect":"self_created","tweet":"LAPD news conference in a few moments on Dorner case...CNN live","date":"Wed Feb 13 09:00:26 MST 2013"},{"aspect":"self_created","tweet":"The San Bernardino's Sheriff's Dept. says they believe the gunman from the standoff is dead, and body is inside the cabin.","date":"Tue Feb 12 21:46:33 MST 2013"},{"aspect":"self_created","tweet":"Showing his sense of humor  RT@marcorubio #GOPResponse #SOTU #gop #tcot http://t.co/0aaaOYiP","date":"Tue Feb 12 21:15:21 MST 2013"},{"aspect":"self_created","tweet":"Latest from the news conference: LAPD says no body has been recovered or identified yet from inside the cabin","date":"Tue Feb 12 21:07:54 MST 2013"},{"aspect":"self_created","tweet":"Pres. Obama has now departed the Capitol","date":"Tue Feb 12 20:56:33 MST 2013"},{"aspect":"self_created","tweet":"From Romney's body man:  RT     ‏@dgjackson  I would have had that water bottle closer, had it been the Gov. Haha. Marco needs an aide","date":"Tue Feb 12 20:54:29 MST 2013"},{"aspect":"self_created","tweet":"Great shot of lawmakers shielding eyes to try to see 102-year-old Desiline Victor in the upper section of the chamber","date":"Tue Feb 12 20:15:19 MST 2013"},{"aspect":"self_created","tweet":"Jessica Yellin reports administration officials refused to put a price tag on the president’s new proposals tonight.","date":"Tue Feb 12 20:07:55 MST 2013"},{"aspect":"self_created","tweet":"That information from our CNN contributor Tom Fuentes. Forensic tests will be done to confirm the identity.","date":"Tue Feb 12 20:02:15 MST 2013"},{"aspect":"self_created","tweet":"Away from the speech: Body pulled from the burned cabin in Big Bear. Law enforcement sources are told by LAPD it is Christopher Dorner","date":"Tue Feb 12 20:01:28 MST 2013"},{"aspect":"self_created","tweet":"Surprising reference to Mitt Romney as he discussed minimum wage","date":"Tue Feb 12 19:52:37 MST 2013"},{"aspect":"self_created","tweet":"Flames engulfing cabin where Dorner was believed holed up -- ammo inside is exploding.","date":"Tue Feb 12 17:33:46 MST 2013"},{"aspect":"self_created","tweet":"LA Times and affiliates report one of the deputies wounded in the Big Bear shootout has died from his injuries","date":"Tue Feb 12 16:51:31 MST 2013"},{"aspect":"self_created","tweet":"Police say the two wounded deputies have been airlifted to the hospital. No word yet on their conditions","date":"Tue Feb 12 15:24:22 MST 2013"},{"aspect":"self_created","tweet":"The law enforcement source says Dorner is now believed to be \"pinned down\" in the area","date":"Tue Feb 12 14:48:10 MST 2013"},{"aspect":"self_created","tweet":"Law enforcement source tells our LA Bureau police set up roadblock. Dorner allegedly opened fire as he approached, wounding 2 deputies","date":"Tue Feb 12 14:46:34 MST 2013"},{"aspect":"self_created","tweet":"Affiliates reporting two officers may be wounded in shootout in Big Bear, believed to involved Christopher Dorner.","date":"Tue Feb 12 14:38:11 MST 2013"},{"aspect":"self_created","tweet":"Among potential '16'ers picked for official responses: Rubio tonight, Ryan in '11, McDonnell in '10, Jindal in '09, and Biden ('83 and '84)","date":"Tue Feb 12 13:09:10 MST 2013"},{"aspect":"self_created","tweet":"The last time someone who went to be the party's nominee for Pres. delivered the response: Bob Dole in 1996","date":"Tue Feb 12 13:03:45 MST 2013"},{"aspect":"self_created","tweet":"The last time someone who went on to be President gave the opposition response to the State of the Union: then-AR Gov. Bill Clinton in 1985","date":"Tue Feb 12 13:02:58 MST 2013"},{"aspect":"self_created","tweet":"Pres. Obama calls NK test \"highly provocative\" act, actions \"a threat to U.S. national security and to intl peace and security\".","date":"Tue Feb 12 00:04:47 MST 2013"},{"aspect":"self_created","tweet":"Pres Obama: \"danger posed by North Korea’s threatening activities warrants further swift and credible action by the international community'","date":"Tue Feb 12 00:02:30 MST 2013"},{"aspect":"self_created","tweet":"VP Biden on the Pope: \"this is a man of  great integrity...looking out for what he believes is in the best interest of our church\".","date":"Mon Feb 11 12:12:48 MST 2013"},{"aspect":"Politics","tweet":"RT @jaketapper: All 8 troops killed at Combat Outpost Keating that day died in an act of selflessness --trying to return fire, deliver a ...","date":"Mon Feb 11 11:57:57 MST 2013"},{"aspect":"self_created","tweet":"RT @CNNRick: Sgt. Romesha being honored 4 his valor  at Afghanistan 2009 battle. #CNN Heroes. President Obama speaking #CNN Live This is ...","date":"Mon Feb 11 11:53:44 MST 2013"},{"aspect":"self_created","tweet":"The adorable suit-wearing toddler near podium before ceremony in East Room is the son of Medal of Honor recipient, Staff Sgt. Clint Romesha","date":"Mon Feb 11 11:51:55 MST 2013"},{"aspect":"self_created","tweet":"Biden on violence in hometown Wilmington: \"dealing with a murder rate that exceeds any number a city of its size should be dealing with\"","date":"Mon Feb 11 11:40:31 MST 2013"},{"aspect":"self_created","tweet":"3 are dead in the courthouse shooting in Wilmington, DE...two police officers wounded, Gunman and two women were killed.","date":"Mon Feb 11 08:51:52 MST 2013"},{"aspect":"self_created","tweet":"VP Biden holding gun violence roundtable in Philadelphia w/ police officials shortly. The Wilmington chief was among scheduled participants","date":"Mon Feb 11 07:03:46 MST 2013"},{"aspect":"self_created","tweet":"The shooting happened at the New Castle County Court of Common Pleas. One of the victims is a constable. No word yet on conditions","date":"Mon Feb 11 07:01:12 MST 2013"},{"aspect":"self_created","tweet":"Breaking -- there's been a shooting at the courthouse in Wilmington, Delaware this morning. Police report \"a few\" wounded, # not clear","date":"Mon Feb 11 06:59:51 MST 2013"},{"aspect":"self_created","tweet":"Preliminary reports say more than 200 homes were damaged in Hattiesburg","date":"Sun Feb 10 21:04:19 MST 2013"},{"aspect":"self_created","tweet":"Officials in Hattiesburg say 10 people have taken to hospital with tornado-related injuries, believe everyone is now accounted for.","date":"Sun Feb 10 20:29:35 MST 2013"}]}