{"user_name":"samyoungman","user_timeline":[{"aspect":"self_created","tweet":"SCOOP (but only in Sam World): Sen. Manchin conceded this morning that Kentuckians might be \"tougher\" than West Virginians.","date":"Fri Apr 19 08:37:14 MDT 2013"},{"aspect":"self_created","tweet":"Up too late and saw @jaketapper report the apprehension of -- and I love this  this -\"the marked m man.\" Bless you, Tapper. Truth","date":"Fri Apr 19 01:22:16 MDT 2013"},{"aspect":"self_created","tweet":"My fellow Americans, a trying, hellish week Boston to DC's battles. Do me a favor: Ignore at least 1 person who angers you online tomorrow.","date":"Thu Apr 18 23:51:43 MDT 2013"},{"aspect":"self_created","tweet":"Since I'm usually the Travis Bickle of DC tweeting, this feels odd to say: Some of y'all need to say goodnight and turn the computer off.","date":"Wed Apr 17 21:05:16 MDT 2013"},{"aspect":"self_created","tweet":"Watching the Wizards this year after @John_Wall came back was amazing. No shot at play-offs, but still they fought. Pride. Grit. Next year.","date":"Wed Apr 17 20:38:11 MDT 2013"},{"aspect":"self_created","tweet":"@Lindenberger That's it. You cain't come here. We're all full.","date":"Wed Apr 17 20:35:27 MDT 2013"},{"aspect":"self_created","tweet":"@TonyFratto I wish I had never seen it. Very few victims of kidnapping and sex trafficking have former-CIA dads to come get them.","date":"Wed Apr 17 20:33:08 MDT 2013"},{"aspect":"self_created","tweet":"@Lindenberger You're a Louisville Cardinal. Neither Wall nor the Hoyas want ya. I suggest the Kastles","date":"Wed Apr 17 20:31:48 MDT 2013"},{"aspect":"self_created","tweet":"Tough loss @WashWizards. Proud as hell of the season though. Fought like lions to the very end of every game. Keep your head up @John_Wall","date":"Wed Apr 17 20:27:22 MDT 2013"},{"aspect":"self_created","tweet":"@mikememoli Thanks. Good to see you today.","date":"Wed Apr 17 20:25:29 MDT 2013"},{"aspect":"self_created","tweet":"@TonyFratto Scarred me. Way too heavy an issue for an action movie. Seriously just horrified me.","date":"Wed Apr 17 20:22:22 MDT 2013"},{"aspect":"self_created","tweet":"@mikememoli You get the sense that some family members thought 50+ was a win?","date":"Wed Apr 17 20:21:11 MDT 2013"},{"aspect":"self_created","tweet":"Serious question: Did someone at some point today have to explain cloture to Newtown family members?","date":"Wed Apr 17 20:13:52 MDT 2013"},{"aspect":"self_created","tweet":"@meredithshiner @OKnox @dcbigjohn Are you kidding? You're my hero. You called him on it faster than I could. And you're a Dukie.","date":"Wed Apr 17 19:55:12 MDT 2013"},{"aspect":"self_created","tweet":"Turned out the folks walking into the Senate side with me weren't just Sandy Hook. Also Aurora, Va.Tech. and maybe more.","date":"Wed Apr 17 19:44:39 MDT 2013"},{"aspect":"self_created","tweet":"Was so happy to see @OKnox and @dcbigjohn today until the latter, bama that he is, asked me if I was from Tennessee. cc @meredithshiner","date":"Wed Apr 17 19:37:22 MDT 2013"},{"aspect":"self_created","tweet":"OH going through Senate security: \"Do y'all have an appointment?\" \"Yes, we're the victims of Sandy Hook.\"","date":"Wed Apr 17 13:10:35 MDT 2013"},{"aspect":"self_created","tweet":"I ain't even got jokes","date":"Wed Apr 17 12:58:15 MDT 2013"},{"aspect":"self_created","tweet":"@CindyCoops Happy to help. Just think one good thought about the media today:)","date":"Wed Apr 17 11:54:18 MDT 2013"},{"aspect":"self_created","tweet":"@CindyCoops  Sure. \"Do you think the bombings in Boston have any policy implications either on gun control or immigration?\"","date":"Wed Apr 17 11:32:53 MDT 2013"},{"aspect":"self_created","tweet":"\"I think that in some cases the president has used them as props, and that disappoints me.\" -- Paul","date":"Wed Apr 17 11:05:56 MDT 2013"},{"aspect":"self_created","tweet":"Paul: \"And I know they’re coming voluntarily, and they want to come be part of this debate. But it still saddens me just to see them.\"","date":"Wed Apr 17 11:05:20 MDT 2013"},{"aspect":"self_created","tweet":"Rand Paul's criticism of potus for using Newtown families as props was in response to a question about Boston.","date":"Wed Apr 17 11:04:36 MDT 2013"},{"aspect":"self_created","tweet":"At Monitor breakfast this morning (my 1st in a while), kept thinking of sitting next to the late great Broder when Phil Singer went off","date":"Wed Apr 17 10:04:44 MDT 2013"},{"aspect":"self_created","tweet":"@Lexvegaskid He is not. He's a Dukie.","date":"Wed Apr 17 09:57:04 MDT 2013"},{"aspect":"self_created","tweet":"Rand noted he doesn't always go to the Derby. I always figured great seats to Derby and UK ball were why ppl ran for office in the Bluegrass","date":"Wed Apr 17 09:54:24 MDT 2013"},{"aspect":"self_created","tweet":"\"We're colleagues, and I do respect him,\" Rand Paul on McConnell. Added: \"I don't think he ever personally disliked me.\"","date":"Wed Apr 17 09:27:32 MDT 2013"},{"aspect":"self_created","tweet":"Rand Paul did seem to have trouble with date JFK died. Legendary Mark Shields offered up '63. The senator: \"But was it summer or fall?\"","date":"Wed Apr 17 09:15:30 MDT 2013"},{"aspect":"self_created","tweet":"And because you were dying to know, Sen. Rand Paul will be attending the Kentucky Derby this year.","date":"Wed Apr 17 09:11:02 MDT 2013"},{"aspect":"self_created","tweet":"Yeah, Sen. Paul did pause when I asked if McConnell is a \"mentor.\" Then: \"Thoreau is a mentor.\"","date":"Wed Apr 17 09:08:59 MDT 2013"},{"aspect":"self_created","tweet":"always nice to have breakfast with a fellow Kentuckian","date":"Wed Apr 17 08:13:10 MDT 2013"},{"aspect":"self_created","tweet":"RT @Chris_Moody: Reuters' @SamYoungman asked Rand Paul if he considers Mitch McConnell \"mentor.\" Paul pauses. \"Thoreau is a mentor.\"","date":"Wed Apr 17 08:01:54 MDT 2013"},{"aspect":"self_created","tweet":"@jimacostacnn Ah yes, the BSEOIMA Act. You don't wanna know what that means in Klingon.","date":"Wed Apr 17 05:05:45 MDT 2013"},{"aspect":"self_created","tweet":"Happy birthday to Wire 1's tough-as-nails mama @juliehdavis. Hearing that son Harry took his track winnings and bought mom a new mink","date":"Wed Apr 17 04:51:23 MDT 2013"},{"aspect":"self_created","tweet":"@samsteinhp or to the voters in rural states. Did I just blow your mind?","date":"Tue Apr 16 21:41:52 MDT 2013"},{"aspect":"self_created","tweet":"\"He never could have outfought Santino.\" a line that inexplicably and repeatedly pops in my head after every terror attack","date":"Tue Apr 16 16:39:04 MDT 2013"},{"aspect":"self_created","tweet":"@eyokley Weird is a Tuesday here, and I'm cool with that. It's dumb, dangerous and cowardly I can't comprehend.","date":"Tue Apr 16 16:27:16 MDT 2013"},{"aspect":"self_created","tweet":"Ricin?!","date":"Tue Apr 16 16:23:01 MDT 2013"},{"aspect":"self_created","tweet":"Ugh. RIP Pat Summerall","date":"Tue Apr 16 14:59:13 MDT 2013"},{"aspect":"self_created","tweet":"@DougHeye happy birthday, ol' sport","date":"Tue Apr 16 14:52:11 MDT 2013"},{"aspect":"self_created","tweet":"RT @kwingfieldajc: The terrorists have officially lost RT @RedSox: .@yankees Thank you! We appreciate your support.","date":"Tue Apr 16 14:04:08 MDT 2013"},{"aspect":"self_created","tweet":"Just because I'm thrilled for a piece of good news: Snoop has a new album out?!","date":"Tue Apr 16 13:26:49 MDT 2013"},{"aspect":"self_created","tweet":"RT @hollybdc: Hearing church bells going off around Boston's Back Bay as city marks 24 hours after bombing","date":"Tue Apr 16 13:04:33 MDT 2013"},{"aspect":"self_created","tweet":"It would make me happy if we never used the word terrorism again, replacing it forever with the word cowardice.","date":"Tue Apr 16 10:39:31 MDT 2013"},{"aspect":"self_created","tweet":"twitter really is a showcase for how tragedy brings out the best and worst of us","date":"Tue Apr 16 09:45:02 MDT 2013"},{"aspect":"self_created","tweet":"RT @BillSimmons: Can't believe this.","date":"Mon Apr 15 13:13:02 MDT 2013"},{"aspect":"self_created","tweet":"Oh Lord, please be with Boston.","date":"Mon Apr 15 13:01:06 MDT 2013"},{"aspect":"self_created","tweet":"\"Arrrrgh. Sometimes I wonder why I bother plundering at all.\" The Sea Captain after paying his taxes","date":"Mon Apr 15 09:12:44 MDT 2013"},{"aspect":"self_created","tweet":"It's Monday, it's Tax Day, the Masters champ used a belly putter. I don't need to click on a Bieber story to get angrier.","date":"Mon Apr 15 08:23:33 MDT 2013"},{"aspect":"self_created","tweet":"@RealClearScott $$$","date":"Mon Apr 15 08:18:04 MDT 2013"},{"aspect":"self_created","tweet":"Congrats and good luck to @NerlensNoel3","date":"Mon Apr 15 08:14:44 MDT 2013"},{"aspect":"self_created","tweet":"Brockman: \"Sir, why did you wait until the last minute to pay your taxes?\" Krusty: \"Because I'm an idiot. Happy?\"","date":"Mon Apr 15 08:08:30 MDT 2013"},{"aspect":"self_created","tweet":"\"Marge, if anybody asks, you require 24-hour nursing care, Lisa's a clergyman, Maggie is seven people and Bart was wounded in Vietnam.\"","date":"Mon Apr 15 07:59:34 MDT 2013"},{"aspect":"self_created","tweet":"\"Will you look at those morons? I paid my taxes over a year ago.\" Homer Simpson","date":"Mon Apr 15 07:57:53 MDT 2013"},{"aspect":"self_created","tweet":"Julius Randle is making a statement tonight. And depending on what happens, that statement might be Wiggins who? #bbn","date":"Sat Apr 13 19:55:22 MDT 2013"},{"aspect":"self_created","tweet":"A recent bout with disillusion kept me from watching Lincoln or House of Cards. Until tonight. The decision will reveal my true soul","date":"Sat Apr 13 18:24:19 MDT 2013"},{"aspect":"self_created","tweet":"\"How much of a distraction was it?\" \"A horrible break.\" \"Good luck tomorrow.\" -- how did Tiger make it through such a grueling interview?","date":"Sat Apr 13 16:16:56 MDT 2013"},{"aspect":"self_created","tweet":"if you add \"let me be clear\" to any of Tiger's earlier tweets, you can hear it in potus's voice clear as day","date":"Sat Apr 13 15:51:13 MDT 2013"},{"aspect":"self_created","tweet":"@TigerWoods should've skipped the dozen tweet legal jargon and just responded \"Yes, yes. Winter rules.\"","date":"Sat Apr 13 15:17:00 MDT 2013"},{"aspect":"self_created","tweet":"I love watching Tiger play, but I would love more Condi Rice giving an cuss-filled interview that includes \"they shoulda kicked him out!\"","date":"Sat Apr 13 15:11:40 MDT 2013"},{"aspect":"self_created","tweet":"@John_Wall dude, I totally jinxed Tiger last night.","date":"Sat Apr 13 15:05:23 MDT 2013"},{"aspect":"self_created","tweet":"So \"I didn’t know I had taken an incorrect drop prior to signing my scorecard\" is obviously a new all-purpose euphemism, right?","date":"Sat Apr 13 10:03:25 MDT 2013"},{"aspect":"self_created","tweet":"stories filed at 3am go 1 of 2 ways: topnotch from uninterrupted focus and silence. or complete gibberish. and no idea which until morning","date":"Sat Apr 13 01:34:26 MDT 2013"},{"aspect":"self_created","tweet":"Sorry to call folks out, but both Brady and NRA seem to have built their press operations shortly before the Second Amendment was written.","date":"Fri Apr 12 14:50:45 MDT 2013"},{"aspect":"self_created","tweet":"@peterogburn I wasn't ignoring his last question. But I know better than to use the word \"abortion\" on twitter when it's close to midnight.","date":"Fri Apr 12 12:41:07 MDT 2013"},{"aspect":"self_created","tweet":"Man, I am dreading reading tomorrow about how @Chris_Moody was unable to revive @ZekeJMiller outside the Viper Room.","date":"Fri Apr 12 12:25:01 MDT 2013"},{"aspect":"self_created","tweet":"@davidaxelrod Pitino","date":"Fri Apr 12 11:57:50 MDT 2013"},{"aspect":"self_created","tweet":"@literaryeric You're very kind. And clever. Never woulda thought my mom would create a fake twitter account under the name @literaryeric","date":"Fri Apr 12 11:39:04 MDT 2013"},{"aspect":"self_created","tweet":"When we were both back in Tenn., I had to explain to fellow scribes Cohen hadn't had a meltdown but was quoting Excitable Boy at hearing","date":"Fri Apr 12 10:54:46 MDT 2013"},{"aspect":"self_created","tweet":"Seriously, folks, I've told you my Steve Cohen \"Excitable Boy\" story. When this kinda news happens, don't rush to rule out weird.","date":"Fri Apr 12 10:38:47 MDT 2013"},{"aspect":"self_created","tweet":"@hjacksonAP Friday news dump: From the ages of 12 to 35, whenever I've been dumped, Time after Time gets a lot of play.","date":"Fri Apr 12 10:30:55 MDT 2013"},{"aspect":"self_created","tweet":"@TomBevanRCP Always a career hazard to check the leaderboard on Thurs and Fri. Too tempting to resign and go play.","date":"Fri Apr 12 10:18:40 MDT 2013"},{"aspect":"self_created","tweet":"MSM detractors are right on the money today. Please God, nobody compare # of stories written about Jay-Z and Gosnell.","date":"Fri Apr 12 10:17:36 MDT 2013"},{"aspect":"self_created","tweet":"@TomBevanRCP Sadly, I don't. My office tv got broken during college basketball season. Not sure how it happened.","date":"Fri Apr 12 10:15:46 MDT 2013"},{"aspect":"self_created","tweet":"Prediction: The Steve Cohen/Cyndi Lauper stuff will result in at least five reporters watching The Goonies this weekend.","date":"Fri Apr 12 10:12:07 MDT 2013"},{"aspect":"self_created","tweet":"Saddest thing about the Cohen stuff is that he was friends with Warren Zevon. Cyndi Lauper ain't no Warren.","date":"Fri Apr 12 10:10:32 MDT 2013"},{"aspect":"self_created","tweet":"I don't think as much of the Steve Cohen stuff because a. I've known him for years and b. in the South, he's known as eccentric, not weird","date":"Fri Apr 12 09:50:46 MDT 2013"},{"aspect":"self_created","tweet":"Sooooo it's Mitch Cleland?","date":"Fri Apr 12 08:18:48 MDT 2013"},{"aspect":"self_created","tweet":"No journalism lectures in Playbook today? Did somebody meet the Dalai Lama on the Red Line and find inner peace?","date":"Fri Apr 12 08:09:46 MDT 2013"},{"aspect":"self_created","tweet":"If you wear a cowboy hat as much as Ken Salazar does, you should really leave your last day on horseback.","date":"Fri Apr 12 07:41:31 MDT 2013"},{"aspect":"self_created","tweet":"What do you think the rest of Monty Brewster's life was like? I say either guv of NY or set himself on fire in free-basing accident.","date":"Fri Apr 12 07:10:37 MDT 2013"},{"aspect":"self_created","tweet":"@dcbigjohn @moirabagley @buzzfeedandrew saw it in the theater with my mom. Cried like a baby. Also, it's after midnight so #fridaynewsdump","date":"Fri Apr 12 00:57:11 MDT 2013"},{"aspect":"self_created","tweet":"@dcbigjohn @moirabagley @buzzfeedandrew it was created to out me as a great lover of Steel Magnolias.","date":"Fri Apr 12 00:42:40 MDT 2013"},{"aspect":"self_created","tweet":"@treswatson and somehow watched assistant ProgressKY marry Karen Sypher. And I'm done.","date":"Thu Apr 11 21:40:02 MDT 2013"},{"aspect":"self_created","tweet":"@Marty2634 agreed","date":"Thu Apr 11 21:38:30 MDT 2013"},{"aspect":"self_created","tweet":"@Marty2634 Showed glimpses of greatness to come despite injuries. Gotta remember, he was only 6'2\" like a week ago. Gonna be a star.","date":"Thu Apr 11 21:20:47 MDT 2013"},{"aspect":"self_created","tweet":"@Marty2634 Marty, you trolling me, buddy? I thought it proved there is some weird deal where God and Satan alternate who will win each year","date":"Thu Apr 11 21:16:38 MDT 2013"},{"aspect":"self_created","tweet":"And that, folks, is how you beat a joke to death without mercy.","date":"Thu Apr 11 20:57:18 MDT 2013"},{"aspect":"self_created","tweet":"@treswatson recruited Rashard Carruth, made Jorts sit in a toilet stall, was actually Rodrick Rhodes and didn't guard the inbound pass.","date":"Thu Apr 11 20:48:09 MDT 2013"},{"aspect":"self_created","tweet":"@treswatson and stole Sean Sutton's gold chains. Pinned it on Shawn Kemp.","date":"Thu Apr 11 20:34:50 MDT 2013"},{"aspect":"self_created","tweet":"Billy Clyde Gillispie was playing night golf with ProgressKY.","date":"Thu Apr 11 20:18:01 MDT 2013"},{"aspect":"self_created","tweet":"John Prine originally wrote Paradise about ProgressKY. Changed it to Peabody Coal to make it more uplifting.","date":"Thu Apr 11 20:15:59 MDT 2013"},{"aspect":"self_created","tweet":"@treswatson Yes! Good one. ProgressKY also ruined Sam Bowie's knees and tore both D.A. and Noel's ACLs.","date":"Thu Apr 11 20:13:53 MDT 2013"},{"aspect":"self_created","tweet":"Can't remember the last time I read something that made me this happy http://t.co/WrcLijw2Ig","date":"Thu Apr 11 19:56:37 MDT 2013"},{"aspect":"self_created","tweet":"ProgressKY made Ali throw his Gold Medal in the Ohio River.","date":"Thu Apr 11 19:38:17 MDT 2013"},{"aspect":"self_created","tweet":"ProgressKY stomped on Aminu Timberlake.","date":"Thu Apr 11 18:18:20 MDT 2013"},{"aspect":"self_created","tweet":"ProgressKY was a redshirt walk-on at Robert Morris.","date":"Thu Apr 11 18:01:02 MDT 2013"},{"aspect":"self_created","tweet":"The two quotes I attach to Cheney right now are \"Have a beautiful day\" and \"Follow your heart.\" Talk about playing to type","date":"Thu Apr 11 14:07:02 MDT 2013"},{"aspect":"self_created","tweet":"Look, I understand your frustration. I used to be an international hip hop superstar too. -- NotJayCarney","date":"Thu Apr 11 13:56:31 MDT 2013"},{"aspect":"self_created","tweet":"Gibbs might've taken him though. Got some redneck mean in him.","date":"Thu Apr 11 13:40:41 MDT 2013"},{"aspect":"self_created","tweet":"God help me. It's unprofessional and so, so wrong, but surely you too would kinda like to see @PressSec  and Jay-Z throw down.","date":"Thu Apr 11 13:39:45 MDT 2013"},{"aspect":"self_created","tweet":"@pb65 Well, we'll see how it shakes out. Thanks for writing. Great hat. Don't let the Cards fans get you down.","date":"Thu Apr 11 12:56:46 MDT 2013"},{"aspect":"self_created","tweet":"@pb65 That's strange. Where you at in the Bluegrass? Seems to me like it would look much worse for Dems. Especially locally.","date":"Thu Apr 11 12:46:53 MDT 2013"},{"aspect":"self_created","tweet":"@pb65 I'm not sure I understand. Mind to rephrase?","date":"Thu Apr 11 12:29:33 MDT 2013"},{"aspect":"self_created","tweet":"I will say Team McConnell is teaching one good political lesson: Don't wait for an opponent to start fighting. Go hard at what you do have.","date":"Thu Apr 11 12:20:55 MDT 2013"},{"aspect":"self_created","tweet":"And I don't have a damn clue what's been happening in Augusta","date":"Thu Apr 11 12:12:50 MDT 2013"},{"aspect":"self_created","tweet":"I mean at this point I'm waiting for Jesse to imply that ProgressKY was the reason the Commonwealth stayed neutral during the Civil War.","date":"Thu Apr 11 12:10:19 MDT 2013"},{"aspect":"self_created","tweet":"Day one of the Bluegrass story was a clinic by McConnell. But I'm not sure they're projecting a lot of strength/toughness at this point.","date":"Thu Apr 11 12:08:04 MDT 2013"},{"aspect":"self_created","tweet":"@ScottJenningsKY Can we get round-the-clock protection for Ali, Moonlite BBQ, Rupp and Keeneland?","date":"Thu Apr 11 11:57:11 MDT 2013"},{"aspect":"self_created","tweet":"For their next phase, ProgressKY will burn down My Old Kentucky Home, mix bourbon with diet coke and proclaim Duke the best bball team.","date":"Thu Apr 11 11:47:52 MDT 2013"},{"aspect":"self_created","tweet":"Try to keep in mind that he didn't pass the bar, but he knows a lil' bit.","date":"Thu Apr 11 11:45:02 MDT 2013"},{"aspect":"self_created","tweet":"@ScottJenningsKY Dude, I just assumed you were Progress KY. For a minute I even thought you were Ashley Judd.","date":"Thu Apr 11 11:39:37 MDT 2013"},{"aspect":"self_created","tweet":"Dems in my home state do work hard to lose elections it seems. ProgressKY should be on McConnell's payroll. With Aqua Budha.","date":"Thu Apr 11 11:26:19 MDT 2013"},{"aspect":"self_created","tweet":"Question is would Raylan Givens arrest ProgressKY or get 'em to pull so he could take 'em down.","date":"Thu Apr 11 11:22:24 MDT 2013"},{"aspect":"self_created","tweet":"I also believe my late grandfather consistently shoots in the 60s at said course. And since it's Heaven, Grandma tells him to play more.","date":"Thu Apr 11 06:24:24 MDT 2013"},{"aspect":"self_created","tweet":"It's a golfer's cliche, but I believe Heaven's golf course looks like Augusta. I'd add 17 from Sawgrass and Pebble's ocean views.","date":"Thu Apr 11 06:18:22 MDT 2013"},{"aspect":"self_created","tweet":"Happy Masters! There's a brilliant act of journalism in this story: golf handicaps of the alleged are included\nhttp://t.co/Zc7WUKcXA7","date":"Thu Apr 11 05:38:53 MDT 2013"},{"aspect":"self_created","tweet":"Prayers with the firefighters in Georgia","date":"Wed Apr 10 15:47:08 MDT 2013"},{"aspect":"self_created","tweet":"@Brendan_Buck I know who you're talking about. Guy has zero sense of humor.","date":"Wed Apr 10 15:29:45 MDT 2013"},{"aspect":"self_created","tweet":"And before you get concerned, America, remember that what can't be solved by twitter fights, can be easily remedied with tv appearances.","date":"Wed Apr 10 15:25:49 MDT 2013"},{"aspect":"self_created","tweet":"Unemployed, soldiers, etc., just chill. Some of our top people are tweet-fighting their way to solutions as we speak.","date":"Wed Apr 10 15:13:04 MDT 2013"},{"aspect":"self_created","tweet":"So, and correct me if I'm wrong, but it would seem the president's budget needs me to keep smoking.","date":"Wed Apr 10 13:22:29 MDT 2013"},{"aspect":"self_created","tweet":"How can you tell college basketball season is over and there's still a month until Derby? \"Gestapo\" got used today. Still no challenger.","date":"Wed Apr 10 13:15:36 MDT 2013"},{"aspect":"self_created","tweet":"@OKnox @reidepstein No.","date":"Wed Apr 10 12:53:19 MDT 2013"},{"aspect":"self_created","tweet":"@reidepstein It's how I checked to see if the coin was real. Or... It's what I did when I thought it was made of chocolate.","date":"Wed Apr 10 12:51:57 MDT 2013"},{"aspect":"self_created","tweet":"Is Toomey the first person to ever successfully stop Schumer from getting in front of a camera?","date":"Wed Apr 10 12:14:26 MDT 2013"},{"aspect":"self_created","tweet":"Happy birthday to @NerlensNoel3","date":"Wed Apr 10 12:08:17 MDT 2013"},{"aspect":"self_created","tweet":"@SabrinaSiddiqui @ryangrim Always reminds me of Uncle Frank in Home Alone. \"Look what you did, you little jerk.\"","date":"Wed Apr 10 11:58:21 MDT 2013"},{"aspect":"self_created","tweet":"\"I didn't have this gun, the King of England could just walk in here any time he wants, and start shoving you around,\" -- Homer S.","date":"Wed Apr 10 10:13:45 MDT 2013"},{"aspect":"self_created","tweet":"It's been like 20 minutes. Has Doritos not responded?!","date":"Wed Apr 10 09:54:50 MDT 2013"},{"aspect":"self_created","tweet":"Whole brain mapping thing never made sense to me. It's still north of the shoulders, right?","date":"Wed Apr 10 09:05:56 MDT 2013"},{"aspect":"self_created","tweet":"@Rick_Gorka Yeah, if N.Korea does something provocative during final round of Masters, I'm going reverse Red Dawn.","date":"Wed Apr 10 08:55:06 MDT 2013"},{"aspect":"self_created","tweet":"@samsteinhp And bless you for spreading this wonderful news. \"You owe me a Blaupunkt!\"","date":"Wed Apr 10 08:40:59 MDT 2013"},{"aspect":"self_created","tweet":"Totally cool with all the week's news happening today if it means we can all agree to go quiet for Masters coverage on Thurs and Fri","date":"Wed Apr 10 08:39:48 MDT 2013"},{"aspect":"self_created","tweet":"Sorry if I alarmed some folks on the metro this morning. Can't hear \"Roland the Headless Thompson Gunner\" without singing along.","date":"Wed Apr 10 07:50:30 MDT 2013"},{"aspect":"self_created","tweet":"Please tell me I'm not the only person who doesn't care about Weiner.","date":"Wed Apr 10 07:37:53 MDT 2013"},{"aspect":"self_created","tweet":"The cherry blossoms look familiar. Deals on legislation not so much. Where am I? What have y'all done with Washington?","date":"Wed Apr 10 07:28:15 MDT 2013"},{"aspect":"self_created","tweet":"Yes! Welcome to the Wildcats, Dominique Hawkins!","date":"Wed Apr 10 06:27:45 MDT 2013"},{"aspect":"self_created","tweet":"Tobacco tax?! Well good morning, Sam.","date":"Wed Apr 10 05:28:07 MDT 2013"},{"aspect":"self_created","tweet":"@chrisgeidner @weelaura Santa doesn't stop being Santa just because Christmas is over.","date":"Tue Apr 09 20:05:40 MDT 2013"},{"aspect":"self_created","tweet":"Tough night for the Wizards. Good night for @John_Wall, but Melo, man, Melo.","date":"Tue Apr 09 19:28:09 MDT 2013"},{"aspect":"self_created","tweet":"Political discourse in 2013 and the age of twitter: http://t.co/TAA5TTaean","date":"Tue Apr 09 14:58:27 MDT 2013"},{"aspect":"self_created","tweet":"RT @BleacherReport: Looks like Papa John went pretty hard celebrating Louisville's victory in the National Championship (via @BroBible)  ...","date":"Tue Apr 09 14:24:37 MDT 2013"},{"aspect":"self_created","tweet":"fakeBreaking: NOBODY has bugged Tagg. Nobody.","date":"Tue Apr 09 13:47:18 MDT 2013"},{"aspect":"self_created","tweet":"Any number of Kentuckians are suspect. After all, the Justified season finale was last week. Gotta do something 'til Derby.","date":"Tue Apr 09 13:44:33 MDT 2013"},{"aspect":"self_created","tweet":"Most cities, you spend the day talking about bugs nobody has seen or verified, you're regarded as a heroin addict.","date":"Tue Apr 09 13:31:25 MDT 2013"},{"aspect":"self_created","tweet":"@TheRickWilson The new economy. Peanut Butter is the new Grey Poupon.","date":"Tue Apr 09 13:29:10 MDT 2013"},{"aspect":"self_created","tweet":"We've come up with a camera so tiny, it fits into this oversized novelty hat.\" -- Kent Brockman","date":"Tue Apr 09 13:16:40 MDT 2013"},{"aspect":"self_created","tweet":"@OKnox Ain't even 4 o'clock yet. And everybody knows that's the buggin' hour.","date":"Tue Apr 09 13:13:43 MDT 2013"},{"aspect":"self_created","tweet":"RT @RalstonReports: Is there any way we can implicate Pitino in this bugging scandal, thus causing retro forfeiture of title game? #plan ...","date":"Tue Apr 09 13:08:28 MDT 2013"},{"aspect":"self_created","tweet":"We moved past the \"was it a leak?\" portion of this game in record time.","date":"Tue Apr 09 12:59:15 MDT 2013"},{"aspect":"self_created","tweet":"Just a clinic today in how to respond, embrace and spin something like, what most are now calling, the \"bugging.\"","date":"Tue Apr 09 12:55:23 MDT 2013"},{"aspect":"self_created","tweet":"Watergate '13 and the Nixonian left(?) aside, I'm just so freaking happy that we're not talking about Pitino.","date":"Tue Apr 09 12:46:18 MDT 2013"},{"aspect":"self_created","tweet":"RT @rebeccagberg: McConnell tells reporters he plans to filibuster gun control compromise because it didn’t receive bipartisan support a ...","date":"Tue Apr 09 12:33:12 MDT 2013"},{"aspect":"self_created","tweet":"So everyone is ruling out the possibility that Drew Thornton recorded McConnell's staff? (now, that's an obscure reference, y'all)","date":"Tue Apr 09 12:19:48 MDT 2013"},{"aspect":"self_created","tweet":"\"This 'anything to win: laws and rules be damned' mentality has to stop.\" Man, we got a year and a half to go still.","date":"Tue Apr 09 12:00:53 MDT 2013"},{"aspect":"self_created","tweet":"Can't we go one day without a Watergate reference? Mix it up, folks. Throw in a Paula Jones joke.","date":"Tue Apr 09 11:35:14 MDT 2013"},{"aspect":"self_created","tweet":"RT @KySportsRadio: Alex Poythress responded to the UL title win by going into the gym after the game and getting in extra work: http://t ...","date":"Tue Apr 09 09:19:10 MDT 2013"},{"aspect":"self_created","tweet":"I turn 36 at the end of this month. Probably once every two months or so, I eat candy for dinner.","date":"Tue Apr 09 09:01:55 MDT 2013"},{"aspect":"self_created","tweet":"Of course the McConnell oppo stuff is ugly. Oppo usually is. Truth is, I'm surprised in this case it wasn't much, much worse.","date":"Tue Apr 09 08:42:20 MDT 2013"},{"aspect":"self_created","tweet":"The Dem oppo tape goes like this: \"Dude, he's a Louisville fan.\" \"I know. He wasn't even at the White House when the Cats won.\"","date":"Tue Apr 09 08:31:24 MDT 2013"},{"aspect":"self_created","tweet":"I would be far more surprised if the FBI wasn't looking into leaked McConnell tape","date":"Tue Apr 09 08:19:37 MDT 2013"},{"aspect":"self_created","tweet":"I have a million questions, but this make me chuckle \"…at Fancy Farm. We'll all take pink fuzzy socks.\"","date":"Tue Apr 09 07:51:51 MDT 2013"},{"aspect":"self_created","tweet":"God bless The Masters","date":"Tue Apr 09 04:53:01 MDT 2013"},{"aspect":"self_created","tweet":"Louisville fans: 8 > 3. Get someone from UK to explain that to you.","date":"Tue Apr 09 04:06:12 MDT 2013"},{"aspect":"self_created","tweet":"Best part about anti-Louisville tweets: Folks with chin-strap beards rarely tell you to stay classy.","date":"Mon Apr 08 14:56:17 MDT 2013"},{"aspect":"self_created","tweet":"Some good and decent Kentuckians will root for the 'ville out of state pride. I am not one of them. I hate Louisville. Go Michigan.","date":"Mon Apr 08 14:43:14 MDT 2013"},{"aspect":"self_created","tweet":"PPP finds 78 percent of Bluegrass residents rooting for the 'ville. I call skewed.","date":"Mon Apr 08 14:35:40 MDT 2013"},{"aspect":"self_created","tweet":"After playing a round with Condi Rice at Augusta, Phil Mickelson noted she drained a 40-foot putt on 18 http://t.co/1fzoQrw12p","date":"Mon Apr 08 13:40:28 MDT 2013"},{"aspect":"self_created","tweet":"If Tiger wins the Masters, he'll be 3/4 winning tournaments since teaming up with potus.","date":"Mon Apr 08 13:36:45 MDT 2013"},{"aspect":"self_created","tweet":"area flack dumbfounded, unsure how this is news","date":"Mon Apr 08 13:17:41 MDT 2013"},{"aspect":"self_created","tweet":"Area reporter/area flack jokes are good for a chuckle today. Most days they make me violently angry. Off the record for a no comment?!","date":"Mon Apr 08 13:03:06 MDT 2013"},{"aspect":"self_created","tweet":"@SethDavisHoops just declared Pitino \"good people.\" Feel free to write your own \"he's Lanny's son\" joke.","date":"Mon Apr 08 12:57:38 MDT 2013"},{"aspect":"self_created","tweet":"@SethDavisHoops Porcini's","date":"Mon Apr 08 12:55:07 MDT 2013"},{"aspect":"self_created","tweet":"@Philip_Elliott @CondoleezzaRice Soooooooo freaking jealous of the jacket. Second only to the presidential bomber jacket","date":"Mon Apr 08 12:25:39 MDT 2013"},{"aspect":"self_created","tweet":"RT @Philip_Elliott: Secretary @CondoleezzaRice spotted at #Augusta National today: AP PHOTO: http://t.co/MOXFGlMdoQ","date":"Mon Apr 08 12:24:58 MDT 2013"},{"aspect":"self_created","tweet":"I don't know why and hadn't thought about it in years, but as a kid, I watched Back to the Beach more than 100 times. RIP Annette Funicello","date":"Mon Apr 08 12:09:57 MDT 2013"},{"aspect":"self_created","tweet":"@OKnox A Q never answered: If Europe isn't working in Europe, why follow their trade models?","date":"Mon Apr 08 12:07:45 MDT 2013"},{"aspect":"self_created","tweet":"I see reports that someone named Jenna Jameson was arrested for battery. No idea who she is, but wish reports ID'ed her as \"Romney backer.\"","date":"Mon Apr 08 10:36:13 MDT 2013"},{"aspect":"self_created","tweet":"Go Michigan. I don't care to hear \"15 Shining Moments.\"","date":"Mon Apr 08 08:01:20 MDT 2013"},{"aspect":"self_created","tweet":"@RalstonReports It's like Dawson's Creek here. Lawmakers seen strolling the banks of the Potomac in deep though as \"Dust in the Wind\" plays.","date":"Tue Apr 02 10:34:42 MDT 2013"},{"aspect":"self_created","tweet":"Washington has now eclipsed Amsterdam as the world capital of soul-searching.","date":"Tue Apr 02 10:28:17 MDT 2013"},{"aspect":"self_created","tweet":"RT @MrMichaelLee: John Wall on misfiring President Obama: “I said you was shooting like I was shooting the first month I came back.\" #wi ...","date":"Mon Apr 01 22:27:48 MDT 2013"},{"aspect":"self_created","tweet":"RT @UKCoachCalipari: Go Big Blue! Let's go @UKHoopCats! #WeAreUK","date":"Mon Apr 01 17:46:22 MDT 2013"},{"aspect":"self_created","tweet":"Didn't get to it today, but I still plan to try and convince a group of tourists the Wash Monument is two diff colors because of sequester","date":"Mon Apr 01 16:18:25 MDT 2013"},{"aspect":"self_created","tweet":"@RealClearScott Heath Shuler still owns this category.","date":"Mon Apr 01 16:16:07 MDT 2013"},{"aspect":"self_created","tweet":"This was such a fun twitter day. Then Ezra happened.","date":"Mon Apr 01 16:11:23 MDT 2013"},{"aspect":"self_created","tweet":"Sorry, but I got one more: Let's Move! being changed to Let's Move Closer to the Basket!","date":"Mon Apr 01 15:20:46 MDT 2013"},{"aspect":"self_created","tweet":"RT @MrMichaelLee: Bradley Beal on visiting White House & meeting President Obama: \"I wanted to offer some political advice...lower t ...","date":"Mon Apr 01 13:52:56 MDT 2013"},{"aspect":"self_created","tweet":"@OKnox @ZekeJMiller @franksesno @AriFleischer @BenLaBolt Also a Middlebury alum: Snake from The Simpsons","date":"Mon Apr 01 13:51:27 MDT 2013"},{"aspect":"self_created","tweet":"@rexchapman Bit rusty? My man, you have got a future as White House press secretary.","date":"Mon Apr 01 13:38:13 MDT 2013"},{"aspect":"self_created","tweet":"RT @rexchapman: Bit rusty. Love that he loves hoops. RT @samyoungman Can I get your breakdown on this performance by President Obama: ht ...","date":"Mon Apr 01 13:37:15 MDT 2013"},{"aspect":"self_created","tweet":"@rexchapman Can I get your expert breakdown on this performance by President Obama: http://t.co/4Qv2TIXnbI","date":"Mon Apr 01 13:04:21 MDT 2013"},{"aspect":"self_created","tweet":"Per my recent understanding of basketball, I think potus now has to debate immigration reform with Robert Morris.","date":"Mon Apr 01 12:48:58 MDT 2013"},{"aspect":"self_created","tweet":"This should come with the same disclaimer as the Kevin Ware video http://t.co/4Qv2TIXnbI","date":"Mon Apr 01 12:02:51 MDT 2013"},{"aspect":"self_created","tweet":"@itgurl_29 Not elated. Just having some fun amid the depressing dysfunction of this town. Thanks for the cussing and insults though.","date":"Mon Apr 01 11:39:44 MDT 2013"},{"aspect":"self_created","tweet":"Last one: potus just eclipsed Gene Hackman and Barbara Hershey making out at #6 on my list of all-time basketball tragedies.","date":"Mon Apr 01 11:28:47 MDT 2013"},{"aspect":"self_created","tweet":"When told of potus's performance, Mitt Romney suggested potus might want to try loosening his grip on the bat. #notreally","date":"Mon Apr 01 11:15:50 MDT 2013"},{"aspect":"self_created","tweet":"“Hey, Ray, why don’t you teach this kid how to shoot?”  Sports writers doing something on potus's 2-22 day, PLEASE call Rondo for comment.","date":"Mon Apr 01 11:14:09 MDT 2013"},{"aspect":"self_created","tweet":"I keep coming back to his trash-talker reputation. Only thing I can figure is in private games, potus turns into a teenaged werewolf.","date":"Mon Apr 01 11:10:42 MDT 2013"},{"aspect":"self_created","tweet":"Steve Alford just offered POTUS a scholarship at UCLA.","date":"Mon Apr 01 11:02:42 MDT 2013"},{"aspect":"self_created","tweet":"I'm gonna go out on a limb and guess that Arnie Duncan and Reggie Love have thrown a lot of games over the last five years.","date":"Mon Apr 01 11:00:17 MDT 2013"},{"aspect":"self_created","tweet":"And he has a reputation as a trash-talker?! The man is gifted with words, but it's hard to talk lemon with a shot like that.","date":"Mon Apr 01 10:48:00 MDT 2013"},{"aspect":"self_created","tweet":"I've seen potus throw a baseball, bowl, swing a golf club and now this. Law school was the right move.","date":"Mon Apr 01 10:37:29 MDT 2013"},{"aspect":"self_created","tweet":"Worst part about POTUS's shooting woes: Last night, unaccording to N.Korea media reports, Kim Jong-Un scored 178 points in a pick-up game.","date":"Mon Apr 01 10:28:07 MDT 2013"},{"aspect":"self_created","tweet":"I would still take potus on the Wizards over Jordan Crawford.","date":"Mon Apr 01 10:11:36 MDT 2013"},{"aspect":"self_created","tweet":"@John_Wall get the hell away from POTUS! That kind of shooting slump can be contagious.","date":"Mon Apr 01 10:03:46 MDT 2013"},{"aspect":"self_created","tweet":"POTUS shot 2-22?! Sounds like he could supply enough bricks to cover whatever infrastructure projects he wants.","date":"Mon Apr 01 09:48:10 MDT 2013"},{"aspect":"self_created","tweet":"Of all the WH pool reports I did, the Easter Egg hunt was most daunting. Chaos I cared nothing about but soooo many others did.","date":"Mon Apr 01 09:29:46 MDT 2013"},{"aspect":"self_created","tweet":"Before you April Fool me, please keep in mind Louisville is about to win a  tournament UK didn't make. So don't poke angry inner redneck.","date":"Mon Apr 01 08:19:04 MDT 2013"},{"aspect":"self_created","tweet":"@John_Wall little kids are easier to cross up than Steve Nash. Keep it up, man. See you at tomorrow's game.","date":"Mon Apr 01 08:03:49 MDT 2013"},{"aspect":"self_created","tweet":"@John_Wall @whitehouse Given the way you've been playing, I fully expect you to win the WH Easter egg roll.","date":"Mon Apr 01 07:18:09 MDT 2013"},{"aspect":"self_created","tweet":"Happy to see that Kevin Ware's surgery was successful.","date":"Sun Mar 31 21:06:41 MDT 2013"},{"aspect":"self_created","tweet":"Welcome back, @kwiltj!","date":"Sun Mar 31 20:53:12 MDT 2013"},{"aspect":"self_created","tweet":"@MattMackowiak Then I guess it will be a big 15-second party at Porcini's. I still have hope for Michicuse State.","date":"Sun Mar 31 20:39:23 MDT 2013"},{"aspect":"self_created","tweet":"@MattMackowiak Happy for them really. No ill will there.","date":"Sun Mar 31 20:36:52 MDT 2013"},{"aspect":"self_created","tweet":"Just a heads up, I'll be viciously undermining any efforts to canonize Pitino this week.","date":"Sun Mar 31 20:26:10 MDT 2013"},{"aspect":"self_created","tweet":"This week, I'm a Shocker.","date":"Sun Mar 31 19:00:31 MDT 2013"},{"aspect":"self_created","tweet":"Good luck to Ryan Harrow. Now, @UKCoachCalipari offer Hawkins a scholarship","date":"Sun Mar 31 18:26:07 MDT 2013"},{"aspect":"self_created","tweet":"Love it! @John_Wall  with the three-ball icing on the cake","date":"Sun Mar 31 18:21:32 MDT 2013"},{"aspect":"self_created","tweet":"@Marty2634 Hey man! Not this year. Weak draft. Next year UK could have eight in the first round. Can't wait!","date":"Sun Mar 31 17:46:49 MDT 2013"},{"aspect":"self_created","tweet":"Never wanna see a kid get injured. Hate it for Ware and his teammates. But you'll have to break both my legs to get me to root for UofL","date":"Sun Mar 31 17:42:49 MDT 2013"},{"aspect":"self_created","tweet":"@JohnJHarwood @tonyfratto I'm happy to explain my contempt in detail including Laettner stepping on Aminu, the Maggette double-standard, etc","date":"Sun Mar 31 17:29:42 MDT 2013"},{"aspect":"self_created","tweet":"Rooting hard for Michicuse State.","date":"Sun Mar 31 17:26:16 MDT 2013"},{"aspect":"self_created","tweet":"Where are you, asteroid?","date":"Sun Mar 31 16:49:35 MDT 2013"},{"aspect":"self_created","tweet":"Just left church, a buddy's daughter was baptized. good stuff. might've added a prayer to request one meteor for UofL/Duke. heads up","date":"Sat Mar 30 17:35:09 MDT 2013"},{"aspect":"self_created","tweet":"This tournament is a preview of my every March for eternity should I end up in Hell. I wish to write in \"Asteroid\" in my brackets.","date":"Sat Mar 30 11:29:37 MDT 2013"},{"aspect":"self_created","tweet":"Really?! If Alford is the guy, I have to assume that Dick Morris was on the short list.","date":"Sat Mar 30 10:31:16 MDT 2013"},{"aspect":"self_created","tweet":"#fridaynewsdump Peeps are gross.","date":"Fri Mar 29 16:17:35 MDT 2013"},{"aspect":"self_created","tweet":"Happy birthday to Robert Gibbs and @sppeoples. And a big good morning to all you trash-talking, no-ring-having IU fans.","date":"Fri Mar 29 06:05:02 MDT 2013"},{"aspect":"self_created","tweet":"@chrisswartout I'm the same way -- with a UF exception. Blame Noah.","date":"Thu Mar 28 18:07:09 MDT 2013"},{"aspect":"self_created","tweet":"How hard is it for me to watch a Kentucky-less tournament? Two minutes into Ariz./Ohio State I flipped over to, gulp, Caddyshack II","date":"Thu Mar 28 17:55:46 MDT 2013"},{"aspect":"self_created","tweet":"@perrybaconjr @kenvogel But Perry, I agree with everything you said. I just think it was gonna be much uglier than most knew.","date":"Thu Mar 28 16:58:50 MDT 2013"},{"aspect":"self_created","tweet":"@perrybaconjr @kenvogel I just watched Andrew Wiggins's mix-tape. I say if he commits to UK, we give him a Senate seat.","date":"Thu Mar 28 16:58:17 MDT 2013"},{"aspect":"self_created","tweet":"Now that Judd ain't running, you Washington folks got 10 seconds to git off our property.","date":"Wed Mar 27 16:37:20 MDT 2013"},{"aspect":"self_created","tweet":"Good luck in the NIT, Ms. Judd","date":"Wed Mar 27 16:24:34 MDT 2013"},{"aspect":"self_created","tweet":"My actual Kentuckian take: Never knew if she'd run. Never thought for a second she could win.","date":"Wed Mar 27 16:20:38 MDT 2013"},{"aspect":"self_created","tweet":"If Kentucky native Hunter Thompson was still alive, we could speculate about him running.","date":"Wed Mar 27 16:13:00 MDT 2013"},{"aspect":"self_created","tweet":"Now let's start guessing if Kentucky native Johnny Depp will run.","date":"Wed Mar 27 16:04:29 MDT 2013"},{"aspect":"self_created","tweet":"Prolly the right call. She needs at least one more year in college to work on her mid-range jumper.","date":"Wed Mar 27 15:59:04 MDT 2013"},{"aspect":"self_created","tweet":"@rickklein My hat's off to you, sir.","date":"Tue Mar 26 10:54:39 MDT 2013"},{"aspect":"self_created","tweet":"@jaketapper Tried to leap to Tiger's defense, and all I came up with is \"but dude, he's so fun to watch when he's on fire.\"","date":"Tue Mar 26 10:52:21 MDT 2013"},{"aspect":"self_created","tweet":"@rickklein Best promotional tweet I've ever seen.","date":"Tue Mar 26 10:42:36 MDT 2013"},{"aspect":"self_created","tweet":"I like to imagine that while SCOTUS hears arguments, @SteveScully and @cspan folks walk around office punching holes in the walls.","date":"Tue Mar 26 10:36:29 MDT 2013"},{"aspect":"self_created","tweet":"Manti T'eo just proposed to @RepJackKimble","date":"Tue Mar 26 09:57:41 MDT 2013"},{"aspect":"self_created","tweet":"State of Congress: Fake congressional twitter accounts don't seem fake","date":"Tue Mar 26 09:56:48 MDT 2013"},{"aspect":"self_created","tweet":"Just for the sake of comedy, I wish the Hot Cops were working security outside SCOTUS.","date":"Tue Mar 26 09:41:22 MDT 2013"},{"aspect":"self_created","tweet":"Reporters at SCOTUS, remember to verify sexuality with the if-your-hand-is-bigger-than-your-face test.","date":"Tue Mar 26 09:32:54 MDT 2013"},{"aspect":"self_created","tweet":"Until you've free-based a pair of Cole Haan loafers, I don't wanna hear it.","date":"Tue Mar 26 09:28:04 MDT 2013"},{"aspect":"self_created","tweet":"Scenes SCOTUS really make me miss Rodney Dangerfield. Picture Al Czervik at the top of the steps declaring \"Hey everybody...\"","date":"Tue Mar 26 09:16:04 MDT 2013"},{"aspect":"self_created","tweet":"RT @SalenaZitoTrib: Guy in coffee shop this AM watching Supreme Court spectacle on TV says \"So when are we going to talk about the jobs?\"","date":"Tue Mar 26 08:45:43 MDT 2013"},{"aspect":"self_created","tweet":"Reading your tweets about the scene at SCOTUS, I have to believe we are minutes away from the greatest dance party in history.","date":"Tue Mar 26 08:42:10 MDT 2013"},{"aspect":"self_created","tweet":"@John_Wall !!! Congrats on the new career high!","date":"Mon Mar 25 19:33:29 MDT 2013"},{"aspect":"self_created","tweet":"I have a hard time imagining Randy Whitman saying anything other than \"I'm sorry. Did you say the two yutes?\"","date":"Mon Mar 25 19:31:24 MDT 2013"},{"aspect":"self_created","tweet":"RT @WashWizards: '@John_Wall concludes his best offensive half of the season with an acrobatic layup!  He has 26 pts as we head to half  ...","date":"Mon Mar 25 18:12:08 MDT 2013"},{"aspect":"self_created","tweet":"LA Kings are at the White House tomorrow. Gretzky was traded to LA in 1988. Discovered that while sipping after-dinner Sanka at 4 pm.","date":"Mon Mar 25 17:29:34 MDT 2013"},{"aspect":"self_created","tweet":"Tiger ain't lost since he played with potus, and, man, I can't find a good joke there...","date":"Mon Mar 25 11:48:27 MDT 2013"},{"aspect":"self_created","tweet":"@AaronBlakeWP y'all won't do better than Tubby","date":"Mon Mar 25 10:53:32 MDT 2013"},{"aspect":"self_created","tweet":"@MZHemingway Fair enuff. And this exchange goes down as Exhibit A of what my life is like when Kentucky doesn't make the tournament","date":"Mon Mar 25 10:00:33 MDT 2013"},{"aspect":"self_created","tweet":"@MZHemingway Media invention might be a stretch. Still, larger point being that national attitudes toward Tinky Winky have changed.","date":"Mon Mar 25 09:54:06 MDT 2013"},{"aspect":"self_created","tweet":"@MZHemingway Sorry. Been 14 years since \"a journal published by his ministry did contain an article alleging\" Tinky Winky was gay.","date":"Mon Mar 25 09:46:18 MDT 2013"},{"aspect":"self_created","tweet":"@stevebenen I keep waiting for a Tinky Winky \"It gets better\" ad.","date":"Mon Mar 25 09:14:28 MDT 2013"},{"aspect":"self_created","tweet":"Been 14 years since the late Jerry Falwell took aim at Tinky Winky, the purple gay Teletubby.","date":"Mon Mar 25 09:04:45 MDT 2013"},{"aspect":"self_created","tweet":"America, we gotta take notice. If we don't debate and address our issues like adults, Jim Carrey and Jenny McCarthy will weigh in.","date":"Mon Mar 25 08:27:00 MDT 2013"},{"aspect":"self_created","tweet":"Been 17 years since Newt's lesbian half-sister officiated a gay wedding on Friends. Yeah, Friends was on 17 years ago.","date":"Mon Mar 25 07:53:04 MDT 2013"},{"aspect":"self_created","tweet":"@PentagonPresSec I take that to mean you're not running for Senate.","date":"Sun Mar 24 21:23:18 MDT 2013"},{"aspect":"self_created","tweet":"What? They don't award points for talking? Shhhhhhhh","date":"Sun Mar 24 20:30:55 MDT 2013"},{"aspect":"self_created","tweet":"I don't care if it's the University of Phoenix -- somebody please stop Louisville.","date":"Sun Mar 24 19:43:51 MDT 2013"},{"aspect":"self_created","tweet":"Kansas vs. UNC and no Kentucky means for the 4 billionth time in my life, I'm grateful Red Dawn is on the teevee.","date":"Sun Mar 24 16:23:50 MDT 2013"},{"aspect":"self_created","tweet":"Still a great trip, @John_Wall. Still shakin' my head over LA. And thanks for giving me some ball to cheer this March.","date":"Sun Mar 24 16:01:26 MDT 2013"},{"aspect":"self_created","tweet":"Not great timing, but you gotta love this kind of strut from a PG: “Go to the basket and I swear to God, I’ll knock your…out.” @John_Wall","date":"Sun Mar 24 15:59:50 MDT 2013"},{"aspect":"self_created","tweet":"Saw Ralph Reed on the teevee this morning and less than five minutes later I was watching Hot Tub Time Machine.","date":"Sun Mar 24 12:32:10 MDT 2013"},{"aspect":"self_created","tweet":"Brackets could be better, but I'm golden as long as Tagg wins it all.","date":"Sun Mar 24 07:24:58 MDT 2013"},{"aspect":"self_created","tweet":"@mattbeynon I quit watching after 30 seconds (aka a Pitino marathon)","date":"Sat Mar 23 15:26:11 MDT 2013"},{"aspect":"self_created","tweet":"@mattbeynon My skin is crawling. We're gonna have to bleach everything Pitino touches.","date":"Sat Mar 23 15:23:01 MDT 2013"},{"aspect":"self_created","tweet":"Great @MrMichaelLee story on @John_Wall  blowing up lately, owning the Lakers last night. \"I think I’m growing before my eyes...\"","date":"Sat Mar 23 15:08:24 MDT 2013"},{"aspect":"self_created","tweet":"@John_Wall, @WashWizards amazing win last night!","date":"Sat Mar 23 07:30:28 MDT 2013"},{"aspect":"self_created","tweet":"@NolteNC Hate that for you, man. Hope it was at least a good dream.","date":"Sat Mar 23 07:15:02 MDT 2013"},{"aspect":"self_created","tweet":"@John_Wall dude, this March belongs to you!","date":"Fri Mar 22 23:03:53 MDT 2013"},{"aspect":"self_created","tweet":"@UMRebelCJ @NativeFlash22 Disappointing. But happy for Robert Morris.","date":"Fri Mar 22 20:31:14 MDT 2013"},{"aspect":"self_created","tweet":"@UMRebelCJ @NativeFlash22 UK 87 -- Ole Miss 74. Henderson 5-19. It's cool though. I don't think of Ole Miss as a math school.","date":"Fri Mar 22 20:24:55 MDT 2013"},{"aspect":"self_created","tweet":"\"Otto. That's one palindrome you won't be hearing for a while.\" Sorry, Hoya fans, figured I'd never get another chance for that reference","date":"Fri Mar 22 19:31:20 MDT 2013"},{"aspect":"self_created","tweet":"@TonyFratto @BenFellerNY I'm in bizzaro world. Wizards are good, Kentucky is bad, Obama is drone happy and Cheney talks like Nora Ephron","date":"Fri Mar 22 19:25:23 MDT 2013"},{"aspect":"self_created","tweet":"Let's go Kansas/Louisville/Indiana! Y'all can do it! #reversejinxtime","date":"Fri Mar 22 19:23:00 MDT 2013"},{"aspect":"self_created","tweet":"@BenFellerNY @TonyFratto Sorry. My magic March touch is way, way off. Ask the deservedly ecstatic folks at Robert Morris.","date":"Fri Mar 22 19:21:29 MDT 2013"},{"aspect":"self_created","tweet":"@hjacksonAP I dream of living in a home with a name like Rowan Oak.","date":"Fri Mar 22 19:20:56 MDT 2013"},{"aspect":"self_created","tweet":"I was all set to root for Ole Miss. Oxford one of my top-five towns. Their fans and point guard talked me out of it.","date":"Fri Mar 22 19:09:27 MDT 2013"},{"aspect":"self_created","tweet":"@daDrumFreak Ain't never gonna stop. Hope you're still on twitter a year from now","date":"Fri Mar 22 18:56:00 MDT 2013"},{"aspect":"self_created","tweet":"@MorningBriefing @georgecondon He'll find a positive way to look at it. It's his ugliest quality.","date":"Fri Mar 22 18:40:48 MDT 2013"},{"aspect":"self_created","tweet":"Because of my dear friend @georgecondon, I decided to root for G-town. Hoya fans, feel free to blame me.","date":"Fri Mar 22 18:34:47 MDT 2013"},{"aspect":"self_created","tweet":"Rooting hard for Western Kentucky tonight. Only school in the Bluegrass that would let me graduate. Go Hilltoppers!","date":"Fri Mar 22 17:22:59 MDT 2013"},{"aspect":"self_created","tweet":"@KySportsRadio you practiced law. how does the phrase \"about to get cut\" normally get treated?","date":"Fri Mar 22 17:16:47 MDT 2013"},{"aspect":"self_created","tweet":"@Will_Schulze The town that gave us Faulkner, and that's your response? Stay classy, Ole Miss.","date":"Fri Mar 22 16:58:18 MDT 2013"},{"aspect":"self_created","tweet":"@cpurdom Ha. I shoulda known he was one of yours. Traitor.","date":"Fri Mar 22 16:50:14 MDT 2013"},{"aspect":"self_created","tweet":"@SabrinaSiddiqui THANK YOU! @OKnox was traveling, and I started thinking doggy sunglasses were a figment of my imagination.","date":"Fri Mar 22 16:39:06 MDT 2013"},{"aspect":"self_created","tweet":"@NativeFlash22 you're fighting with a fake account. Also, our worst team in years shut you down. Dude, stick to MySpace.","date":"Fri Mar 22 16:28:07 MDT 2013"},{"aspect":"self_created","tweet":"Game on. And on and on and on and on...","date":"Fri Mar 22 09:28:42 MDT 2013"},{"aspect":"self_created","tweet":"What would it have been called? Newtorum? Sangrich? Gigli?","date":"Fri Mar 22 08:48:53 MDT 2013"},{"aspect":"self_created","tweet":"@mpoindc I can't see them getting through first presser, let alone winning Michigan. Maybe makes Romney look steady","date":"Fri Mar 22 08:11:16 MDT 2013"},{"aspect":"self_created","tweet":"@mpoindc I honestly don't think it would've lasted long enough to hurt Romney.","date":"Fri Mar 22 08:05:16 MDT 2013"},{"aspect":"self_created","tweet":"@mpoindc It actually could've changed race. Newtorum explodes spectacularly in less than a week, Romney gets nom sooner","date":"Fri Mar 22 08:02:42 MDT 2013"},{"aspect":"self_created","tweet":"@mattbeynon Meanwhile, inside Santorum hq: \"He got bit by a what?!\"","date":"Fri Mar 22 07:38:39 MDT 2013"},{"aspect":"self_created","tweet":"@mattbeynon y'all would've walked when you saw the bill for Ellis's diamond encrusted sweater vest","date":"Fri Mar 22 07:35:02 MDT 2013"},{"aspect":"self_created","tweet":"Guessing Santorum would've done a break-up by post-it after the first \"Calista and I and Rick...\"","date":"Fri Mar 22 07:29:18 MDT 2013"},{"aspect":"self_created","tweet":"I'll take the zoos, you take the bowling alleys. Are we sure this would have \"toppled\" Romney?","date":"Fri Mar 22 07:22:05 MDT 2013"},{"aspect":"self_created","tweet":"@shepworth so you didn't want him to play for Kansas?","date":"Wed Mar 20 11:25:31 MDT 2013"},{"aspect":"self_created","tweet":"RT @KyleTucker_CJ: That's an unprecedented six McDonald's All-Americans in UK's 2013 class. No. 1 recruit at four of five positions. Mercy.","date":"Wed Mar 20 11:20:49 MDT 2013"},{"aspect":"self_created","tweet":"Julius Randle just announced he's going to Kentucky next year. All non-UK fans, really enjoy this tournament.","date":"Wed Mar 20 11:19:50 MDT 2013"},{"aspect":"self_created","tweet":"@PhilipRucker happy birthday, murphy bed","date":"Wed Mar 20 08:35:47 MDT 2013"},{"aspect":"self_created","tweet":"This is normally my favorite time of year. But worst flu ever and UK bball woes have combined to make me a 35-yo infant.","date":"Wed Mar 20 08:30:18 MDT 2013"},{"aspect":"self_created","tweet":"@hjacksonAP It will be a reckoning. We'll be back next year. And we're bringing hell with us.","date":"Wed Mar 20 07:07:57 MDT 2013"},{"aspect":"self_created","tweet":"@hjacksonAP Translation: No more Mr. Nice Guy. Get your transfer papers ready.","date":"Wed Mar 20 07:02:08 MDT 2013"},{"aspect":"self_created","tweet":"Kathy Ireland is 50?!","date":"Wed Mar 20 06:58:01 MDT 2013"},{"aspect":"self_created","tweet":"@hjacksonAP @RealClearScott we laid down plastic","date":"Tue Mar 19 19:57:04 MDT 2013"},{"aspect":"self_created","tweet":"@BigBlueJesus we are humble. Turn off thine basketball locusts.","date":"Tue Mar 19 19:51:08 MDT 2013"},{"aspect":"self_created","tweet":"Somebody just hit me in the face with a pie, and we'll call it a night.","date":"Tue Mar 19 19:02:39 MDT 2013"},{"aspect":"self_created","tweet":"@TonyFratto Pleae pass heroin instead.","date":"Tue Mar 19 18:28:33 MDT 2013"},{"aspect":"self_created","tweet":"Good Lord. My proud team is guest-starring in a movie that will air on abc family. The child coach took the mic...","date":"Tue Mar 19 18:18:04 MDT 2013"},{"aspect":"self_created","tweet":"@fakegimel why didn't we take a page from Forrest Gump's 'Bama crowds? Archie gets the ball, and the crowd spells \"STOP!\"","date":"Tue Mar 19 18:12:45 MDT 2013"},{"aspect":"self_created","tweet":"Wow. Jimmy Dykes just made sense. If you play for UK, and you're rattled at Robert Morris, \"go somewhere else. This is not for you.\"","date":"Tue Mar 19 17:52:18 MDT 2013"},{"aspect":"self_created","tweet":"RT @BigBlueJesus: I feel like a drunk Billy Gillispie is going to stagger onto the court like Dennis Hopper at any moment.","date":"Tue Mar 19 17:42:48 MDT 2013"},{"aspect":"self_created","tweet":"Ya know, it's the little things, like the camera angle, that surprise you when you get to hell. #bbn","date":"Tue Mar 19 17:40:17 MDT 2013"},{"aspect":"self_created","tweet":"Ok, I've turned out all the lights and crawled into the fetal position. It's NIT time, baby!","date":"Tue Mar 19 17:08:38 MDT 2013"},{"aspect":"self_created","tweet":"Let's go, Wildcats (sniffle). Let's (sob) get this win tonight in the (gulp) NIT. So psyched I'm crying. Don't look at me.","date":"Tue Mar 19 14:14:07 MDT 2013"},{"aspect":"self_created","tweet":"@KarlRove Kentucky still has a shot to make the tournament, right?","date":"Sun Mar 17 18:03:26 MDT 2013"},{"aspect":"self_created","tweet":"RT @KySportsRadio: Selection Chair says UK \"double digit\" losses on road kept them out. This after they told me in Indy, victory margin  ...","date":"Sun Mar 17 17:59:43 MDT 2013"},{"aspect":"self_created","tweet":"Nate Silver ain't got nuthin' on Joe Lunardi.","date":"Sun Mar 17 17:45:24 MDT 2013"},{"aspect":"self_created","tweet":"@evanvucci Just trying to save the rest of the country from a Denzel \"Man on Fire\" Kentucky season next year.","date":"Sun Mar 17 17:16:04 MDT 2013"},{"aspect":"self_created","tweet":"Yeah, we had a bad year. Your team did too. Did your team win it all last year? Lose best player to ACL tear? No? Then calm down.","date":"Sun Mar 17 16:59:31 MDT 2013"},{"aspect":"self_created","tweet":"@RalstonReports I'm making a list...","date":"Sun Mar 17 16:42:30 MDT 2013"},{"aspect":"self_created","tweet":"@stevensdc @ErinMcPike @mikememoli Pretty sure my money in '03-'04 paid for every tv in there.","date":"Sat Mar 16 18:55:43 MDT 2013"},{"aspect":"self_created","tweet":"\"You can't put a price on freedom. Always never forget that.\" -- Sterling Archer","date":"Sat Mar 16 17:00:14 MDT 2013"},{"aspect":"self_created","tweet":"Serious question: Does the GOP have a Rahm or an Al Davis? One thing I haven't heard since November is anyone saying \"just win.\"","date":"Sat Mar 16 16:38:27 MDT 2013"},{"aspect":"self_created","tweet":"That's it for me. Twitter is a serious bummer this afternoon. Have a good weekend, and Go Cats!","date":"Fri Mar 15 14:57:13 MDT 2013"},{"aspect":"self_created","tweet":"@OKnox @jonward11 @MajorCBS I don't even want one anymore. Gotta go through way too much shirt for it.","date":"Fri Mar 15 14:54:34 MDT 2013"},{"aspect":"self_created","tweet":"@DylanByers @TVietor08 I guarantee they're jealous. Most of them have never been on the record.","date":"Fri Mar 15 14:21:26 MDT 2013"},{"aspect":"self_created","tweet":"@Tejanarusa You liked the Monkees, didn't you?","date":"Fri Mar 15 14:14:10 MDT 2013"},{"aspect":"self_created","tweet":"@GrahamBlog Huh. Pegged you as a Stones guy. So you think Ashley Judd is gonna run?","date":"Fri Mar 15 14:01:43 MDT 2013"},{"aspect":"self_created","tweet":"@GrahamBlog Stones or Beatles?","date":"Fri Mar 15 13:50:27 MDT 2013"},{"aspect":"self_created","tweet":"Portman has had a rough day on twitter. Walk in the park compared to the hell that awaits when he announces be just got into Dave Matthews.","date":"Fri Mar 15 13:30:43 MDT 2013"},{"aspect":"self_created","tweet":"Hope y'all will forgive the comedy routine. Apparently I'm not as ok with the whole jerky thing as I thought.","date":"Fri Mar 15 12:59:03 MDT 2013"},{"aspect":"self_created","tweet":"@Rick_Gorka Nice trip down memory lane, but it just wasn't the same without a smile and the finger.","date":"Fri Mar 15 12:05:31 MDT 2013"},{"aspect":"self_created","tweet":"Hearing Tagg wrote the speech. And tied the guv's tie.","date":"Fri Mar 15 11:57:17 MDT 2013"},{"aspect":"self_created","tweet":"@Rick_Gorka I got time to smoke before we go?","date":"Fri Mar 15 11:52:12 MDT 2013"},{"aspect":"self_created","tweet":"Lech Walesa get cut from the remix?","date":"Fri Mar 15 11:45:43 MDT 2013"},{"aspect":"self_created","tweet":"Don't worry, old friends. I'm poised and ready to tweet some snark when he gets to the part about trade agreements. cc: @Rick_Gorka","date":"Fri Mar 15 11:43:16 MDT 2013"},{"aspect":"self_created","tweet":"Without Men to match my mountains, it's not a greatest hits album.","date":"Fri Mar 15 11:39:52 MDT 2013"},{"aspect":"self_created","tweet":"Did he not say gnawgahyde?","date":"Fri Mar 15 11:37:55 MDT 2013"},{"aspect":"self_created","tweet":"What you might not know, he's also a fan of the great hymns of America. And for the record, I'm one of the great Hims of America.","date":"Fri Mar 15 11:35:38 MDT 2013"},{"aspect":"self_created","tweet":"I feel like I should be standing way back, smoking a cigarette and cursing Kid Rock","date":"Fri Mar 15 11:33:20 MDT 2013"},{"aspect":"self_created","tweet":"Probably not a stretch to assume that every word from Trump since WHCA '11 has been one long \"jerk store\" retort.","date":"Fri Mar 15 07:24:38 MDT 2013"},{"aspect":"self_created","tweet":"Good morning, folks. A favor, please. If you know Corliss Williamson, pls ask him about Clinton rooting for UofL while Arkansas was playing","date":"Fri Mar 15 04:56:17 MDT 2013"},{"aspect":"self_created","tweet":"@meredithshiner signed secretly behind closed doors","date":"Thu Mar 14 23:20:44 MDT 2013"},{"aspect":"self_created","tweet":"RT @meredithshiner: Reminded by a friend that it was only 2000 when Howard Dean was viewed as super liberal for supporting civil unions.","date":"Thu Mar 14 23:20:22 MDT 2013"},{"aspect":"self_created","tweet":"\"Follow your heart.\" That's so Cheney.","date":"Thu Mar 14 22:53:25 MDT 2013"},{"aspect":"self_created","tweet":"@AshleyJudd if Nashville rocks like Rupp, they'll be alright. They play to the energy level around them.","date":"Thu Mar 14 22:50:48 MDT 2013"},{"aspect":"self_created","tweet":"@moirabagley Had she said it midflight, they would have tried to get out and walk.","date":"Thu Mar 14 21:01:13 MDT 2013"},{"aspect":"self_created","tweet":"@DavidMDrucker just brutal. that whole Adidas line is some kind of deranged Buttafuoco tribute.","date":"Thu Mar 14 20:58:20 MDT 2013"},{"aspect":"self_created","tweet":"\"Our wives are not walking through that door!\" #nottheoneIwastalkingabout","date":"Thu Mar 14 20:17:52 MDT 2013"},{"aspect":"self_created","tweet":"The Clinton/Pitino tweet I just composed and deleted was hilarious.","date":"Thu Mar 14 20:08:07 MDT 2013"},{"aspect":"self_created","tweet":"My only guess is that a wistful Amy Fisher is working for Adidas.","date":"Thu Mar 14 19:07:26 MDT 2013"},{"aspect":"self_created","tweet":"Being Biden Episode 3: The vice president explains how he was the first person to ever get a barbed wire tattoo. #pleaseGod","date":"Thu Mar 14 18:55:40 MDT 2013"},{"aspect":"self_created","tweet":"I have a new lamp. When you turn it on, a little golfer sinks a putt and I smile. In other words, I love lamp.","date":"Thu Mar 14 17:42:03 MDT 2013"},{"aspect":"self_created","tweet":"RT @wildcatnews: Hard to believe it's been 20 years ago since @jamalmashburn led UK to '93 Final Four in New Orleans. Tip of hat to one  ...","date":"Thu Mar 14 15:20:21 MDT 2013"},{"aspect":"self_created","tweet":"@AntDeRosa before then it was just a crazy Amsterdam playground game for kids with bad parents","date":"Thu Mar 14 14:11:47 MDT 2013"},{"aspect":"self_created","tweet":"@JimmyOrr apologies to whomever sent: I got a tweet yesterday that read \"Paaaaapallll training, sir!\"","date":"Thu Mar 14 14:05:30 MDT 2013"},{"aspect":"self_created","tweet":"@ktumulty @Newt_Gingrich Nice. I imagine it's a flawless swing. Ya know, fundamentally.","date":"Thu Mar 14 13:21:12 MDT 2013"},{"aspect":"self_created","tweet":"Last year's CPAC, Callista disclosed that Newt is a golfer. Been a year and I still can't picture it.","date":"Thu Mar 14 13:14:04 MDT 2013"},{"aspect":"self_created","tweet":"Wondered this morning if a self-immolating Tunisian fruit vendor would've broken through msnbc host tweets. Totally depressed since.","date":"Thu Mar 14 13:01:01 MDT 2013"},{"aspect":"self_created","tweet":"@ZekeJMiller kinda like Solyndra hq","date":"Thu Mar 14 08:06:28 MDT 2013"},{"aspect":"self_created","tweet":"@ShawnaNBCNews or a blast","date":"Thu Mar 14 07:51:06 MDT 2013"},{"aspect":"self_created","tweet":"I am curious. Any of you conservative media sites search White House visitor logs for @ezraklein?","date":"Thu Mar 14 06:05:19 MDT 2013"},{"aspect":"self_created","tweet":"Higgs? Phenomenal Owensboro High School running back, played for UK and the Dolphins","date":"Thu Mar 14 05:47:17 MDT 2013"},{"aspect":"self_created","tweet":"One caveat: those of you playing the home version of the blame game, yeah you, you can't come in. Try the Newseum.","date":"Wed Mar 13 21:20:46 MDT 2013"},{"aspect":"self_created","tweet":"Well, thanks for proving there's nothing we can't fight about. My bottom line: It's our house and officials here best not forget it.","date":"Wed Mar 13 21:17:38 MDT 2013"},{"aspect":"self_created","tweet":"@samsteinhp still his house. And I'm not having this argument with reporters who see it when they please.","date":"Wed Mar 13 21:07:04 MDT 2013"},{"aspect":"self_created","tweet":"The guy in Neb who has worked and saved for years to show his family our nation's capital doesn't care abt sequesters. Let him in his house","date":"Wed Mar 13 21:03:07 MDT 2013"},{"aspect":"self_created","tweet":"Yeah, I hear you. Sequester this, sequester that. Allow me to reply: IT'S OUR HOUSE!","date":"Wed Mar 13 20:52:51 MDT 2013"},{"aspect":"self_created","tweet":"Here's why WH tour thing bothers me: While their elected reps are screwing things up, Americans aren't. So let 'em in their house.","date":"Wed Mar 13 20:46:42 MDT 2013"},{"aspect":"self_created","tweet":"Man, two days of watching smoke has really put me in a bonfire kinda mood. Anybody burned down Cap Lounge lately?","date":"Wed Mar 13 19:58:32 MDT 2013"},{"aspect":"self_created","tweet":"The giveaway was Diego Maradona's hand hanging from his neck.","date":"Wed Mar 13 13:42:37 MDT 2013"},{"aspect":"self_created","tweet":"It really is a beautiful process. Still, if I was in the square, I would have to loudly request the new pope play some Skynyrd.","date":"Wed Mar 13 13:36:34 MDT 2013"},{"aspect":"self_created","tweet":"There was already a Pope Francis. His last name was Sinatra.","date":"Wed Mar 13 13:23:49 MDT 2013"},{"aspect":"self_created","tweet":"I shall name my first and second born after the first person to tell the pope: \"Lighten up, Francis.\"","date":"Wed Mar 13 13:20:44 MDT 2013"},{"aspect":"self_created","tweet":"Very kind of the new pope to go with Francis so people like me can make \"Stripes\" jokes","date":"Wed Mar 13 13:17:41 MDT 2013"},{"aspect":"self_created","tweet":"At 76, the man had to choose between becoming pope or signing 5-year contract with the Redskins","date":"Wed Mar 13 13:15:45 MDT 2013"},{"aspect":"self_created","tweet":"oh the old Chicago Bulls intro would be perfect for this","date":"Wed Mar 13 13:12:18 MDT 2013"},{"aspect":"self_created","tweet":"new pope refusing to come out until 1,000 brown M&Ms are delivered to his dressing room. God help you if there's a green one.","date":"Wed Mar 13 13:08:37 MDT 2013"},{"aspect":"self_created","tweet":"please please please come out in a Nixon mask","date":"Wed Mar 13 13:06:36 MDT 2013"},{"aspect":"self_created","tweet":"as I've told many before, Pope Sam has a nice ring to it","date":"Wed Mar 13 13:05:39 MDT 2013"},{"aspect":"self_created","tweet":"If he comes out with Axl on one side and @Slash on the other, I'll convert.","date":"Wed Mar 13 13:02:37 MDT 2013"},{"aspect":"self_created","tweet":"If he chooses the name Pope The Ultimate Warrior the First, I'll convert.","date":"Wed Mar 13 12:55:58 MDT 2013"},{"aspect":"self_created","tweet":"@Philip_Elliott @RickSantorum even stranger, the second the smoke started, Santorum jumped on a plane to Iowa.","date":"Wed Mar 13 12:54:51 MDT 2013"},{"aspect":"self_created","tweet":"As a protestant, I feel like a House Republican. This election meant nothing to me.","date":"Wed Mar 13 12:41:08 MDT 2013"},{"aspect":"self_created","tweet":"Just something about the Swiss Guard that makes me wanna fight one of 'em","date":"Wed Mar 13 12:37:59 MDT 2013"},{"aspect":"self_created","tweet":"if freakin' Rodman walks out on that balcony, I'm maxing out to Satan","date":"Wed Mar 13 12:24:57 MDT 2013"},{"aspect":"self_created","tweet":"I know it's a long shot, but please please choose the name Pope Joey Joe-Joe Shabadoo the First","date":"Wed Mar 13 12:23:01 MDT 2013"},{"aspect":"self_created","tweet":"Awww yeah. Look at that chimney. New pope: \"Dave's not here, man.\"","date":"Wed Mar 13 12:18:51 MDT 2013"},{"aspect":"self_created","tweet":"@moirabagley alright, baby panda headed your way. on one condition: no Dukies allowed to pet it","date":"Wed Mar 13 11:08:00 MDT 2013"},{"aspect":"self_created","tweet":"@moirabagley @SenRandPaul what's the traditional gift for the one-week filibuster anniversary? Paper? Green paper sent to McConnell?","date":"Wed Mar 13 10:18:27 MDT 2013"}]}