{"user_name":"markknoller","user_timeline":[{"aspect":"self_created","tweet":"Pres Obama confers with his Asst for Homeland Security & Counterterrorism after arrest tonight of bombing suspect. http://t.co/al1sX2ozwN","date":"Fri Apr 19 21:34:36 MDT 2013"},{"aspect":"self_created","tweet":"Party politics tomorrow for VP Biden. He addresses Michigan Dem Party's 2013 Jefferson-Jackson Dinner at the Cobo Center in Detroit.","date":"Fri Apr 19 20:47:45 MDT 2013"},{"aspect":"self_created","tweet":"Next Friday, Pres Obama holds talks with Jordan's King Abdullah - and he attends the WH Correspondents Dinner next Saturday night.","date":"Fri Apr 19 20:46:01 MDT 2013"},{"aspect":"self_created","tweet":"Also next week: Pres Obama goes to Texas for a Dem fundraiser Wednesday and to attend dedication of George W Bush Center on Thursday.","date":"Fri Apr 19 20:45:02 MDT 2013"},{"aspect":"self_created","tweet":"No public events on Pres Obama's schedule this weekend. Next week: Pres Obama hosts Science Fair on Monday & Teacher of the Year Tuesday.","date":"Fri Apr 19 20:44:00 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama also signed a Disaster Declaration to help Massachusetts fund repairs in response to winter storm & flooding Feb 8-9.","date":"Fri Apr 19 20:34:43 MDT 2013"},{"aspect":"self_created","tweet":"FEMA now authorized to identify, mobilize, and provide equipment and resources to alleviate emergency in West, Texas.","date":"Fri Apr 19 20:27:52 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama has issued an Emergency Declaration tonight authorizing federal assistance in response to fertilizer plant in West, Texas.","date":"Fri Apr 19 20:24:31 MDT 2013"},{"aspect":"self_created","tweet":"A weary-looking Pres Obama hails law enforcement capture of 2nd bombing suspect. Photo by Jeff Goldman/CBSNews. http://t.co/RQhkHT8lwd","date":"Fri Apr 19 20:22:37 MDT 2013"},{"aspect":"self_created","tweet":"But this is also the most rapid delivery of a presidential pledge to track down suspects of a heinous attack.","date":"Fri Apr 19 20:18:24 MDT 2013"},{"aspect":"self_created","tweet":"It was also a tough week politically for Pres Obama with the Senate defeat of the gun violence proposals he called for repeatedly.","date":"Fri Apr 19 20:16:53 MDT 2013"},{"aspect":"self_created","tweet":"\"All in all this has been a tough week,\" said Pres. Obama. But he said it showed the character of America.","date":"Fri Apr 19 20:14:01 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama also reaffirmed support for the victims of the fertilizer explosion in West, Texas.","date":"Fri Apr 19 20:12:53 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama pledges to provide all the resources at his disposal to find out why the bombings happened and who if anyone helped.","date":"Fri Apr 19 20:11:04 MDT 2013"},{"aspect":"self_created","tweet":"Tonight there are many unanswered questions, says the president. And the families of those killed and those wounded deserve answers.","date":"Fri Apr 19 20:09:50 MDT 2013"},{"aspect":"self_created","tweet":"\"We will determine what happened,\" Pres Obama vows to discover the motives of the Boston Marathon bombers.","date":"Fri Apr 19 20:08:45 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama hails Boston PD and other State and local police orgs for responding \"with bravery and professionalism.\"","date":"Fri Apr 19 20:06:35 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama waited till Boston news conference ended on the arrest of the 2nd bombing suspect.","date":"Fri Apr 19 20:04:04 MDT 2013"},{"aspect":"self_created","tweet":"Secy of State Kerry just departed for Turkey, to attend intl conference on aid to opposition groups in Syria. US to pledge some $100million.","date":"Fri Apr 19 20:02:32 MDT 2013"},{"aspect":"self_created","tweet":"US Attorney confirms decision not to give bombing read bombing suspect Miranda rights under public safety exemption.","date":"Fri Apr 19 19:52:32 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama to make a statement in the  WH Briefing Room at 945pm/ET.","date":"Fri Apr 19 19:41:47 MDT 2013"},{"aspect":"self_created","tweet":"Official tells Lambidakis that official of the High Value Detainee group was on the scene for the arrest.","date":"Fri Apr 19 19:32:43 MDT 2013"},{"aspect":"self_created","tweet":"CBS' Stephanie Lambidakis quotes Justice Dept official: No Miranda warning read to captured suspect. Govt invoking public safety exception.","date":"Fri Apr 19 19:31:35 MDT 2013"},{"aspect":"self_created","tweet":"Tweet from Boston PD: \"CAPTURED!!! The hunt is over. The search is done. The terror is over. And justice has won. Suspect in custody.\"","date":"Fri Apr 19 18:59:04 MDT 2013"},{"aspect":"self_created","tweet":"Boston Mayor Meninon tweets: \"We got him.\"","date":"Fri Apr 19 18:54:47 MDT 2013"},{"aspect":"self_created","tweet":"AMTRAK resuming limited service between NY and Boston tonight. Will return to regular service on Saturday.","date":"Fri Apr 19 18:20:49 MDT 2013"},{"aspect":"self_created","tweet":"\"The two leaders agreed to continue...cooperation on counter-terrorism and security issues going forward,\" said a WH statement.","date":"Fri Apr 19 17:20:18 MDT 2013"},{"aspect":"self_created","tweet":"WH says Pres Obama also thanked Putin for cooperation on counter-terrorism matters, even in the wake of the Boston bombings.","date":"Fri Apr 19 17:19:27 MDT 2013"},{"aspect":"self_created","tweet":"WH says Pres Obama conferred by phone tonight with Russia's Pres. Putin, who offered his nation's condolences for loss of life in Boston.","date":"Fri Apr 19 17:18:01 MDT 2013"},{"aspect":"self_created","tweet":"INTERPOL says alert asks its 190 members nations to notify US if they've ever come across explosive devices similar to ones used in Boston.","date":"Fri Apr 19 16:47:45 MDT 2013"},{"aspect":"self_created","tweet":"At request of US, INTERPOL issues international security alert called \"Orange Notice\" for information on bombs like ones used in Boston.","date":"Fri Apr 19 16:46:04 MDT 2013"},{"aspect":"self_created","tweet":"It's unusual for the WH to announce such a briefing while its underway, but the urgency and national interest prompted the announcement.","date":"Fri Apr 19 08:21:21 MDT 2013"},{"aspect":"self_created","tweet":"Official says Pres Obama was also updated during the night on the developments in the bombing case and pursuit of suspects.","date":"Fri Apr 19 08:19:12 MDT 2013"},{"aspect":"self_created","tweet":"As of 1013am/ET, says WH official, the top-level briefing for Pres Obama was still underway.","date":"Fri Apr 19 08:18:36 MDT 2013"},{"aspect":"self_created","tweet":"The 945am briefing for Pres Obama in the WH Situation Room included Atty Gen Holder, FBI Dir Mueller, Natl Security Adviser Donilon.","date":"Fri Apr 19 08:16:59 MDT 2013"},{"aspect":"self_created","tweet":"WH official says Pres Obama was briefed this morning on the Boston/Watertown developments in pursuit of the Marathaon bombing suspects.","date":"Fri Apr 19 08:15:34 MDT 2013"},{"aspect":"self_created","tweet":"Atty General Holder and FBI Dir Mueller heading to WH to update Pres Obama on the pursuit of the bombing suspects.","date":"Fri Apr 19 07:33:56 MDT 2013"},{"aspect":"self_created","tweet":"Similar media appeal from Mass State Police: please do not broadcast locations of homes, cars being searched...compromises officer safety.","date":"Fri Apr 19 07:18:55 MDT 2013"},{"aspect":"self_created","tweet":"FAA imposes Temporary Flight Restriction over Boston area. A 3 1/2 mile radius up to 3,000 feet.","date":"Fri Apr 19 07:12:48 MDT 2013"},{"aspect":"self_created","tweet":"Urgent appeal tweet from Boston P.D. to media: Do Not Compromise Officer Safety by Broadcasting Tactical Positions of Homes Being Searched.","date":"Fri Apr 19 07:11:04 MDT 2013"},{"aspect":"self_created","tweet":"@vicnewyork Yes. He's a White House staffer who serves at the pleasure of the president.","date":"Thu Apr 18 20:30:37 MDT 2013"},{"aspect":"self_created","tweet":"Only WH photog @petesouza gets the access to take photo like this at interfaith service today in Boston. http://t.co/R5Y0v0eu6A","date":"Thu Apr 18 19:54:58 MDT 2013"},{"aspect":"self_created","tweet":"@BrianWilsonDC Aww. Thanks Brian. Nice of you to say.","date":"Thu Apr 18 19:35:00 MDT 2013"},{"aspect":"self_created","tweet":"Also tomorrow: VP Biden has talks at WH with Deputy Prime Minister Taro Aso of Japan. No press coverage.","date":"Thu Apr 18 19:25:31 MDT 2013"},{"aspect":"self_created","tweet":"Tomorrow at the WH: No public events on the president's schedule as of this writing. Speech at the Univ of Kansas previously cancelled.","date":"Thu Apr 18 19:24:06 MDT 2013"},{"aspect":"self_created","tweet":"WH photo of Pres Obama conferring with medical personnel during visit with bombing victims at Mass General today. http://t.co/5uFWwWXACj","date":"Thu Apr 18 16:21:18 MDT 2013"},{"aspect":"self_created","tweet":"@BrianWilsonDC Won't ask what word you might suggest. Good to hear from you.","date":"Thu Apr 18 15:05:47 MDT 2013"},{"aspect":"self_created","tweet":"@SerenityRock an able to leap tall buildings in a single bound.","date":"Thu Apr 18 14:55:40 MDT 2013"},{"aspect":"self_created","tweet":"The scaffolding nearly to the top of the Washington Monument as Marine One lands at WH. (Photo by Jeff Goldman/CBS) http://t.co/H32zlFlDdv","date":"Thu Apr 18 14:32:39 MDT 2013"},{"aspect":"self_created","tweet":"Great photo of the Rose Garden in bloom from esteemed CBS Botany Editor Jeff Goldman, who won't tweet on his own. http://t.co/mHKMf7lDcD","date":"Thu Apr 18 14:27:50 MDT 2013"},{"aspect":"self_created","tweet":"As one mild-mannered reporter to another, Happy Birthday, Superman.","date":"Thu Apr 18 14:25:35 MDT 2013"},{"aspect":"self_created","tweet":"...justice and the American Way.","date":"Thu Apr 18 14:24:56 MDT 2013"},{"aspect":"self_created","tweet":"And who, disguised as Clark Kent, mild-mannered reporter for a great metropolitan newspaper, fights a never ending battle for truth...","date":"Thu Apr 18 14:24:41 MDT 2013"},{"aspect":"self_created","tweet":"Superman - who can change the course of mighty rivers, bend steel in his bare hands.","date":"Thu Apr 18 14:23:40 MDT 2013"},{"aspect":"self_created","tweet":"Superman. Strange visitor from another planet with powers and abilities far beyond those of mortal man.","date":"Thu Apr 18 14:16:27 MDT 2013"},{"aspect":"self_created","tweet":"How thoughtful. @USNatArchives posts Happy Birthday wishes to Superman. http://t.co/oJCcylcqTH (Different date on Krypton calendar)","date":"Thu Apr 18 14:14:57 MDT 2013"},{"aspect":"self_created","tweet":"Pres & Mrs Obama on way back to DC from Boston visit.","date":"Thu Apr 18 13:10:37 MDT 2013"},{"aspect":"self_created","tweet":"With the approval of Pres Obama, Majority Leader pulling gun bill from the Senate floor. Will return to it at a later date.","date":"Thu Apr 18 12:58:07 MDT 2013"},{"aspect":"self_created","tweet":"While the Pres visited bombing victims at Mass General, Mrs Obama did likewise at Boston Children’s Hospital & Brigham & Women’s Hospital.","date":"Thu Apr 18 12:50:09 MDT 2013"},{"aspect":"self_created","tweet":"The Obamas now at Mass General Hospital visiting with patients, families and staff of those wounded in bombings Monday.","date":"Thu Apr 18 11:17:25 MDT 2013"},{"aspect":"self_created","tweet":"Before the interfaith service, Pres & Mrs Obama visited with the family of Krystle Campbell, 29 year old woman killed in Monday's bombing.","date":"Thu Apr 18 11:15:44 MDT 2013"},{"aspect":"self_created","tweet":"From the Cathedral, Pres Obama crossed street to visit with volunteers from the Boston Marathon, who came to the aid of wounded runners.","date":"Thu Apr 18 10:49:43 MDT 2013"},{"aspect":"self_created","tweet":"Another standing ovation as Pres Obama says this time next year the world will return for the 118th Boston Marathon. \"Bet on it!\" he says.","date":"Thu Apr 18 10:23:21 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama decries bombers calling them \"small stunted individuals who would destroy instead of build.\"","date":"Thu Apr 18 10:21:57 MDT 2013"},{"aspect":"self_created","tweet":"\"We may be momentarily knocked off our feet, but we’ll get back up...we will finish the race.” says the pres.","date":"Thu Apr 18 10:19:48 MDT 2013"},{"aspect":"self_created","tweet":"Pres gets standing ovation: \"it should be pretty clear by now\" that those responsible \"picked the wrong city to do it. Not here in Boston.\"","date":"Thu Apr 18 10:18:31 MDT 2013"},{"aspect":"self_created","tweet":"Your resolve is the greatest rebuke to those responsible for the marathon bombings, says the president.","date":"Thu Apr 18 10:17:06 MDT 2013"},{"aspect":"self_created","tweet":"\"You will run again. Of that I have no doubt, you will run again,\" Pres Obama tells people of Boston.","date":"Thu Apr 18 10:15:56 MDT 2013"},{"aspect":"self_created","tweet":"\"Boston’s your hometown, but we claim it a little bit too,\" the President tells Interfaith Service for bombing victims.","date":"Thu Apr 18 10:10:31 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama: We come together today to reaffirm that the spirit of this city is undaunted and the spirit of this country remains undipped.","date":"Thu Apr 18 10:08:53 MDT 2013"},{"aspect":"self_created","tweet":"Gov Deval Patrick: We will recover and repair, we will grieve our losses and heal. we will rise and endure.","date":"Thu Apr 18 10:02:58 MDT 2013"},{"aspect":"self_created","tweet":"While en route Boston on AF-1, Pres Obama phoned Texas Gov Rick Perry to offer any federal resources in response to disaster in West, Texas.","date":"Thu Apr 18 09:38:28 MDT 2013"},{"aspect":"self_created","tweet":"Other members of MA congressional delegation also given a ride to Boston on AF-1, as was Vickie Kennedy, widow of late Sen Ted Kennedy.","date":"Thu Apr 18 09:27:35 MDT 2013"},{"aspect":"self_created","tweet":"Massachusetts Senators Elizabeth Warren and Mo Cowan flew were guests aboard Air Force One for the flight to Boston & today's service.","date":"Thu Apr 18 09:26:00 MDT 2013"},{"aspect":"self_created","tweet":"Nice line. \"We are shaken, but we are not forsaken,\" said Rev. Nancy Taylor at the Interfaith Service.","date":"Thu Apr 18 09:22:20 MDT 2013"},{"aspect":"self_created","tweet":"@JamesVGrimaldi Nope. Pres Obama invited Romney to a post-election lunch at the WH on Nov 29 2012. http://t.co/kSzkLq0cNo","date":"Thu Apr 18 09:18:09 MDT 2013"},{"aspect":"self_created","tweet":"As a former Governor of Massachusetts, former GOP pres cand Mitt Romney attending Interfaith Service this morning in Boston.","date":"Thu Apr 18 08:24:53 MDT 2013"},{"aspect":"self_created","tweet":"While in Boston today, Pres Obama will meet privately with bombing victims and with first responders to the explosions.","date":"Thu Apr 18 08:09:15 MDT 2013"},{"aspect":"self_created","tweet":"Spokesman says Pres Obama briefed this AM on the West, Texas disaster before receiving his update on the Boston bombings investigation.","date":"Thu Apr 18 08:08:10 MDT 2013"},{"aspect":"self_created","tweet":"\"As residents continue to respond to this tragedy,\" says Pres Obama of West, Texas, \"they will have the support of the American people.\"","date":"Thu Apr 18 08:05:38 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says his Administration, including FEMA, working with state & local authorities \"to make sure there are no unmet needs.\"","date":"Thu Apr 18 08:04:53 MDT 2013"},{"aspect":"self_created","tweet":"In written statement, Pres Obama says his prayers go out to the people of West, Texas in wake of deadly blast at fertilizer plant.","date":"Thu Apr 18 08:03:55 MDT 2013"},{"aspect":"self_created","tweet":".@DanaPerino Reminds me of then Pres GWBush with the Beach Volleyball stars at the Beijing Olympics in '08. http://t.co/Iw2Vxt4vky","date":"Thu Apr 18 06:52:48 MDT 2013"},{"aspect":"self_created","tweet":".@DanaPerino promised a smile and delivered with this photo of former Pres George HW Bush yesterday. http://t.co/eyWbMgMe3d","date":"Thu Apr 18 06:45:39 MDT 2013"},{"aspect":"self_created","tweet":"CBS & other networks to provide live coverage of the 11am service at the Cathedral of the Holy Cross in Boston.","date":"Thu Apr 18 06:09:38 MDT 2013"},{"aspect":"self_created","tweet":"Jay Carney says Pres Obama will use his remarks at the service convey a message of \"resolve\" and solidarity with the people of Boston.","date":"Thu Apr 18 06:07:26 MDT 2013"},{"aspect":"self_created","tweet":"Pres and Mrs Obama leave shortly for Boston to attend 11AM/ET Interfaith Service for victims of the Boston Marathon bombings.","date":"Thu Apr 18 06:06:21 MDT 2013"},{"aspect":"self_created","tweet":"@iefap1940 @aspirational12 I called it a legislative defeat for the president. Not for the American people. Go easy on the name calling.","date":"Thu Apr 18 06:04:45 MDT 2013"},{"aspect":"self_created","tweet":"@LarryJustice2 Thanks for the kind words. much appreciated.","date":"Thu Apr 18 06:02:51 MDT 2013"},{"aspect":"self_created","tweet":"The declaration authorizes DHS & FEMA to coordinate disaster relief efforts in Boston and to help alleviate \"hardship & suffering.\"","date":"Wed Apr 17 21:59:25 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama issues Emergency Declaration for Massachusetts in response to explosions on April 15th.","date":"Wed Apr 17 21:57:31 MDT 2013"},{"aspect":"self_created","tweet":"Senate Dems at Pres Obama's dinner: Bennet, Coons, Durbin, Feinstein, Landrieu, Murray, Reed, Shaheen, Stabenow, Warner, Whitehouse, Wyden.","date":"Wed Apr 17 19:55:18 MDT 2013"},{"aspect":"self_created","tweet":"WH official says Pres Obama had a \"productive discussion\" with 12 Democratic Senators. He vowed to continue fight to reduce gun violence.","date":"Wed Apr 17 19:53:14 MDT 2013"},{"aspect":"self_created","tweet":"Back at the WH tomorrow, Pres Obama hosts a reception marking Greek Independence Day. No press coverage.","date":"Wed Apr 17 19:24:51 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama will address the 11AM service at Boston's Cathedral of the Holy Cross.","date":"Wed Apr 17 19:23:53 MDT 2013"},{"aspect":"self_created","tweet":"Tomorrow, Pres and Mrs Obama fly to Boston to attend interfaith service for those killed or wounded in the Boston bombings.","date":"Wed Apr 17 19:20:08 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama's private dinner with a dozen Senate Democrats lasted about 2 1/4 hrs.","date":"Wed Apr 17 19:17:23 MDT 2013"},{"aspect":"self_created","tweet":"You can read the text of the Senate resolution calling for pardon of Jack Johnson. http://t.co/JLXBPVJGUc:","date":"Wed Apr 17 18:58:51 MDT 2013"},{"aspect":"self_created","tweet":"WH photog @petesouza posts Pres Obama with Sandy Hook families before Rose Garden statement on Senate gun vote. https://t.co/yPQHN7vqdH","date":"Wed Apr 17 18:27:36 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama has granted only 39 pardons, fewer that any pres since James Garfield, who granted no pardons during his 200 days in office.","date":"Wed Apr 17 18:15:23 MDT 2013"},{"aspect":"self_created","tweet":"Bill sponsor Sen John McCain calls on Pres Obama to \"right this historical wrong by granting Jack Johnson a posthumous pardon.\"","date":"Wed Apr 17 18:08:58 MDT 2013"},{"aspect":"self_created","tweet":"In a racially-motivated case in 1913, Johnson was found guilty of violating the Mann  Act and was imprisoned for a year.","date":"Wed Apr 17 18:07:10 MDT 2013"},{"aspect":"self_created","tweet":"By unanimous consent, Senate passes resolution urging Pres Obama to pardon Jack Johnson, first African-American heavyweight boxing champ.","date":"Wed Apr 17 18:03:28 MDT 2013"},{"aspect":"self_created","tweet":"You can read the articles in the latest edition of the North Pacific Anadromous Fish Commission newsletter at http://t.co/wcaW09zagU","date":"Wed Apr 17 17:56:19 MDT 2013"},{"aspect":"self_created","tweet":"@FairTaxNancy Me too.","date":"Wed Apr 17 17:48:38 MDT 2013"},{"aspect":"self_created","tweet":"Amendment to limit size of ammo clips defeated 46-54. 10 Senate Democrats voted against, 1 Republican voted in favor.","date":"Wed Apr 17 17:44:57 MDT 2013"},{"aspect":"self_created","tweet":"Anadromous Fish. I learn something new every day.","date":"Wed Apr 17 17:37:24 MDT 2013"},{"aspect":"self_created","tweet":"The Anadromous Fish Commission created by US treaty with Canada, Japan, Korea & Russia to promote conservation of anadromous fish.","date":"Wed Apr 17 17:36:29 MDT 2013"},{"aspect":"self_created","tweet":"I had to look up Anadromous Fish too: they include sturgeon, herring, temperate river bass and smelts, et al.","date":"Wed Apr 17 17:33:28 MDT 2013"},{"aspect":"self_created","tweet":"Overshadowed by other news: Pres Obama today made 2 appointments to the US Section of the North Pacific Anadromous Fish Commission.","date":"Wed Apr 17 17:31:17 MDT 2013"},{"aspect":"self_created","tweet":"15 Democrats voted against amendment to reinstate assault weapons ban. One Republican, Mark Kirk, R-IL., voted for it.","date":"Wed Apr 17 17:16:53 MDT 2013"},{"aspect":"self_created","tweet":"@allan_fabian Any place that serves tater tots.","date":"Wed Apr 17 17:13:55 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama has arrived at posh Jefferson Hotel for his dinner tonight with 12 Senate Democrats. Follows 2 recent dinners with GOP Senators.","date":"Wed Apr 17 17:05:38 MDT 2013"},{"aspect":"self_created","tweet":"As Pres Obama was speaking, Senate voted 40-60 to defeat amendment to reinstate ban on sale of military-style assault weapons.","date":"Wed Apr 17 16:13:07 MDT 2013"},{"aspect":"self_created","tweet":"Also at the president's side for his statement were parents of five children murdered at Sandy Hook Elementary December 14th.","date":"Wed Apr 17 16:03:46 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama's sense of defeat reflected in his calling this \"a pretty shameful day for Washington.\"","date":"Wed Apr 17 16:00:13 MDT 2013"},{"aspect":"self_created","tweet":"The Senate vote was a major legislative defeat for Pres Obama, who made 13 speeches on gun violence proposals since Sandy Hook shootings.","date":"Wed Apr 17 15:58:57 MDT 2013"},{"aspect":"self_created","tweet":"Sooner or later we are gonna get this right, says Pres Obama of gun violence bill: \"the memories of these children demand it...\"","date":"Wed Apr 17 15:56:58 MDT 2013"},{"aspect":"self_created","tweet":"\"I see this just as Round One,\" says the president of the defeat of the background check measure.","date":"Wed Apr 17 15:53:27 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says his efforts to reduce gun violence not over. He vows to continue to pursue \"meaningful changes.\"","date":"Wed Apr 17 15:51:23 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama calls this a \"pretty shameful day for Washington.\"","date":"Wed Apr 17 15:50:29 MDT 2013"},{"aspect":"self_created","tweet":"\"Who are we here to represent,\" says Pres Obama of Senate vote against bill supported by 90% of Americans.","date":"Wed Apr 17 15:50:10 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says opponents of the background check measure were worried they'd be painted as anti-2nd Amendment in next election.","date":"Wed Apr 17 15:48:32 MDT 2013"},{"aspect":"self_created","tweet":"Most Senators could offer no good reason to vote against the background check measure, says Pres Obama. “it came down to politics.”","date":"Wed Apr 17 15:47:49 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says the gun lobby and its allies \"willfully lied\" about the gun buyer background check measure.","date":"Wed Apr 17 15:46:15 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says the defeated measure showed respect both for gun owners and victims of gun violence.","date":"Wed Apr 17 15:44:59 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says \"a minority\" that included 90% of Republicans blocked background check measure from passage.","date":"Wed Apr 17 15:43:40 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama flanked by VP Biden, Gabby Giffords and the Barden family as he begins statement on Senate vote.","date":"Wed Apr 17 15:41:51 MDT 2013"},{"aspect":"self_created","tweet":"\"We are not going away,\" says Barden. \"Our determination grows stronger.\"","date":"Wed Apr 17 15:40:38 MDT 2013"},{"aspect":"self_created","tweet":"Barden says he and his family return home \"disappointed, but not defeated\" by vote against expanded background checks.","date":"Wed Apr 17 15:39:17 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama being preceded at presidential lectern by Mark Barden, father of 1st grader Daniel killed at Sandy Hook 4 months ago.","date":"Wed Apr 17 15:37:53 MDT 2013"},{"aspect":"self_created","tweet":"GOP alternative background check measure also defeated by failing to reach 60 vote threshold. Senate now voting on assault weapons ban.","date":"Wed Apr 17 15:32:42 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama to be making his statement on the Senate background check vote to reporters in the Rose Garden shortly.","date":"Wed Apr 17 15:24:58 MDT 2013"},{"aspect":"self_created","tweet":"Giffords made the comments in fundraising message to supporters for her anti-gun violence group: Americans for Responsible Solutions","date":"Wed Apr 17 15:21:03 MDT 2013"},{"aspect":"self_created","tweet":"Giffords, shot in the head 2 years ago, says if Senate refuses to change gun laws \"then we need to change the members of the Senate.\"","date":"Wed Apr 17 15:17:29 MDT 2013"},{"aspect":"self_created","tweet":"Former Rep Gabby Giffords decries Senate for doing the \"unthinkable\" by defeating gun background check measure.","date":"Wed Apr 17 15:15:25 MDT 2013"},{"aspect":"self_created","tweet":"Cox says NRA will still work with Dems and GOPs who are committed to protecting our children in schools & prosecuting violent criminals.","date":"Wed Apr 17 15:11:02 MDT 2013"},{"aspect":"self_created","tweet":"In statement, NRA's Cox says background check measure would have criminalized some private transfers of firearms between honest citizens.","date":"Wed Apr 17 15:09:50 MDT 2013"},{"aspect":"self_created","tweet":"NRA Exec Dir Chris Cox hails Senate defeat of \"misguided\" gun buyer background check measure. Says it would not reduce violent crime.","date":"Wed Apr 17 15:08:21 MDT 2013"},{"aspect":"self_created","tweet":"By changing his vote to oppose the background check measure, Majority Leader Reid can bring it back to the floor again.","date":"Wed Apr 17 15:03:55 MDT 2013"},{"aspect":"self_created","tweet":"The 5 Dem Senators voting against background check measure: Baucus/MT, Begich/AK, Heitkamp/ND, Pryor/AR & Reid/NV (for procedural reasons)","date":"Wed Apr 17 14:56:56 MDT 2013"},{"aspect":"self_created","tweet":"@vancitydan it needed 60votes to overcome a pending filibuster against the measure.","date":"Wed Apr 17 14:54:20 MDT 2013"},{"aspect":"self_created","tweet":"@bobj152 which meant it needed 60 votes to pass. but your point is well taken.","date":"Wed Apr 17 14:51:28 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama to make statement on the defeat of the background check legislation at 530pm/ET, says WH.","date":"Wed Apr 17 14:48:04 MDT 2013"},{"aspect":"self_created","tweet":"5 Dems voted against gun buyer background checks bill; 4 Republicans voted in favor. Vote was 54-46, but needed 60 to pass.","date":"Wed Apr 17 14:46:21 MDT 2013"},{"aspect":"self_created","tweet":"FBI concerned about \"unintended consequences\" from inaccurate press reports.","date":"Wed Apr 17 12:56:08 MDT 2013"},{"aspect":"self_created","tweet":"FBI urging media \"to exercise caution and attempt to verify information through appropriate official channels before reporting.“","date":"Wed Apr 17 12:55:16 MDT 2013"},{"aspect":"self_created","tweet":"FBI reiterates: \"Contrary to widespread reporting, there have been no arrests made in connection with the Boston Marathon attack.\"","date":"Wed Apr 17 12:53:06 MDT 2013"},{"aspect":"self_created","tweet":"Boston Police Dept just tweeted: \"Despite reports to the contrary there has not been an arrest in the Marathon attack.\"","date":"Wed Apr 17 12:47:14 MDT 2013"},{"aspect":"self_created","tweet":"It's hard to watch when reporting gets so breathless and even frantic.","date":"Wed Apr 17 12:38:13 MDT 2013"},{"aspect":"self_created","tweet":"This is the kind of story in which being right sometimes takes a back seat to being first to report a development.","date":"Wed Apr 17 12:20:26 MDT 2013"},{"aspect":"self_created","tweet":"Conflicting reports out of Boston on whether a suspect has been identified and taken into custody.","date":"Wed Apr 17 12:18:47 MDT 2013"},{"aspect":"self_created","tweet":"Carney calls it \"absurd and false and wrong\" to say a vote for gun buyer background checks is a vote for establishing national gun registry.","date":"Wed Apr 17 11:13:29 MDT 2013"},{"aspect":"self_created","tweet":"Carney unwilling to concede defeat on gun background check vote later today. Says still a chance for 60 Senators to do the right thing.","date":"Wed Apr 17 10:58:33 MDT 2013"},{"aspect":"self_created","tweet":"Carney also reaffirmed Pres Obama's pledge to find out who planted the bombs, why they did it, and bring them to justice.","date":"Wed Apr 17 10:39:39 MDT 2013"},{"aspect":"self_created","tweet":"On Boston bombings, Carney reaffirmed that \"full weight of the federal government is behind the investigation led by the FBI.","date":"Wed Apr 17 10:38:12 MDT 2013"},{"aspect":"self_created","tweet":"Carney confirms the suspicious letter was received at the off-site mail facility at which mail addressed to WH is screened.","date":"Wed Apr 17 10:34:37 MDT 2013"},{"aspect":"self_created","tweet":"At WH, Jay Carney confirms letter addressed to Pres Obama containing suspicious substance is undergoing FBI analysis.","date":"Wed Apr 17 10:33:22 MDT 2013"},{"aspect":"self_created","tweet":"All mail sent to the White House undergoes screening at a remote location.","date":"Wed Apr 17 09:38:54 MDT 2013"},{"aspect":"self_created","tweet":"Interesting reading. @USNatArchives posts declassified Top Secret pages on the Bay of Pigs invasion in 1961. http://t.co/Sq1odtI9Cy","date":"Wed Apr 17 08:10:07 MDT 2013"},{"aspect":"self_created","tweet":"On @CBSThisMorning, Rice said \"normally these jihadist groups, the biggest ones like al Qaeda, would take some kind of responsibility.\"","date":"Wed Apr 17 07:57:50 MDT 2013"},{"aspect":"self_created","tweet":"\"I do think it's odd,\" says former Secy of State Condoleezza Rica that no one has yet claimed responsibility for Boston bombings.","date":"Wed Apr 17 07:56:51 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama will receive another briefing this morning on the Boston bombings from Atty Gen Holder, FBI Dir Mueller and other officials.","date":"Wed Apr 17 06:25:34 MDT 2013"},{"aspect":"self_created","tweet":"WH again this morning says Pres Obama received updates overnight on the FBI-led investigation of the Boston bombings.","date":"Wed Apr 17 06:24:27 MDT 2013"},{"aspect":"self_created","tweet":"Just in from @jacksonjk: Senate to begin votes tomorrow on gun violence measures including background checks, assault weapons & ammo clips.","date":"Tue Apr 16 18:21:54 MDT 2013"},{"aspect":"self_created","tweet":"In a written statement on the death of Summerall, McManus says his voice was synonymous with big sports events.","date":"Tue Apr 16 18:09:09 MDT 2013"},{"aspect":"self_created","tweet":"CBS Sports Chairman @cbsmcmanus says \"no one is more closely associated with the great legacy & tradition of CBS Sports than Pat Summerall.\"","date":"Tue Apr 16 18:07:56 MDT 2013"},{"aspect":"self_created","tweet":"During his career at CBS Sports, from 1962-94, Pat Summerall called 13 Super Bowls, 26 Masters and 21 US Open Tennis Championships.","date":"Tue Apr 16 18:06:40 MDT 2013"},{"aspect":"self_created","tweet":"@sleuth123 Different ways. Some people apply for jobs. Others get offers.","date":"Tue Apr 16 17:25:47 MDT 2013"},{"aspect":"self_created","tweet":"VP Biden tomorrow does another event on proposals to reduce gun violence: a Google+ Hangout with mayors. At 245p/ET. Live on WH website.","date":"Tue Apr 16 17:24:01 MDT 2013"},{"aspect":"self_created","tweet":"It's the 7th annual event designed to help wounded military personnel \"restore their physical and emotional well-being.\"","date":"Tue Apr 16 17:20:59 MDT 2013"},{"aspect":"self_created","tweet":"Also tomorrow: Pres Obama welcomes the Wounded Warrior Project’s Soldier Ride to the White House cycling event.","date":"Tue Apr 16 17:19:55 MDT 2013"},{"aspect":"self_created","tweet":"On some issues, Pres Obama needs to lobby for support of members of his party as much as with Republicans.","date":"Tue Apr 16 17:18:42 MDT 2013"},{"aspect":"self_created","tweet":"@bgershon Hey Bernie, thanks for the retweet.","date":"Tue Apr 16 17:17:26 MDT 2013"},{"aspect":"self_created","tweet":"After two recent dinners with Republican Senators, Pres Obama has dinner Wednesday evening at local restaurant with 12 Democratic Senators.","date":"Tue Apr 16 17:16:26 MDT 2013"},{"aspect":"self_created","tweet":"Again no press coverage, but WH posts own photo of Pres Obama's Oval Office meeting with Sens Schumer & McCain. http://t.co/lV5jQczZe8","date":"Tue Apr 16 15:50:33 MDT 2013"},{"aspect":"self_created","tweet":"@sleuth123 Most major news organizations including CBS News have internship programs.","date":"Tue Apr 16 15:48:47 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says the immigration bill doesn't contain all he wants but he will do all he can to help it become a reality asap.","date":"Tue Apr 16 15:28:12 MDT 2013"},{"aspect":"self_created","tweet":"In written statement, Pres Obama says compromise bill \"would provide a pathway to earned citizenship\" for 11 million in the US illegally.","date":"Tue Apr 16 15:26:17 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says Gang of 8 immigration reform bill \"largely consistent with the principles that I have repeatedly laid out.\"","date":"Tue Apr 16 15:25:01 MDT 2013"},{"aspect":"self_created","tweet":"WH announces Pres Obama will visit Boston on Thursday to attend and address interfaith service for victims of yesterday's bombings.","date":"Tue Apr 16 15:19:33 MDT 2013"},{"aspect":"self_created","tweet":"Schumer plans to introduce immigration bill in the Senate today, begin hearings next week & see it on the floor in late May or early June.","date":"Tue Apr 16 14:35:09 MDT 2013"},{"aspect":"self_created","tweet":"Schumer says the path to citizenship in the bill is not amnesty. He says business & labor orgs are \"on board.\"","date":"Tue Apr 16 14:31:55 MDT 2013"},{"aspect":"self_created","tweet":"\"We're able to convince people it is good for the American economy,\" McCain says of immigration reform legislation.","date":"Tue Apr 16 14:29:56 MDT 2013"},{"aspect":"self_created","tweet":"McCain says overwhelming majority of Americans now willing to agree to give illegal immigrants a path to citizenship in US.","date":"Tue Apr 16 14:29:04 MDT 2013"},{"aspect":"self_created","tweet":"Schumer says Pres Obama \"enthusiastic\" about getting an immigration reform bill done, even if he doesn't support every provision.","date":"Tue Apr 16 14:24:35 MDT 2013"},{"aspect":"self_created","tweet":"Schumer/McCain brief Pres Obama on Gang of 8 immigration reform bill. They say he doesn't fully agree, but supports compromise process.","date":"Tue Apr 16 14:22:43 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama to discuss prospects for immigration reform bill in meeting shortly with Senators McCain (R-AZ) and Schumer (D-NY).","date":"Tue Apr 16 13:29:35 MDT 2013"},{"aspect":"self_created","tweet":"WH didnt allow press coverage but posts own photo of Pres Obama's mtg w/ Crown Prince Mohammed bin Zayed of UAE. http://t.co/Nqjv4oSNIM","date":"Tue Apr 16 13:20:03 MDT 2013"},{"aspect":"self_created","tweet":"The fiscal cliff bill enacted Jan 2 contained $43-million in tax breaks for NASCAR racetrack owners. Bill signed into law by Autopen Jan 2.","date":"Tue Apr 16 13:17:55 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama calls Brad Keselowski's race car \"spiffy\" and laments that Secret Service wouldn't let him take it for a spin.","date":"Tue Apr 16 13:06:36 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says entire NASCAR family shares with him \"the incredible sense of loss\" from yesterday's bombings in Boston.","date":"Tue Apr 16 13:03:24 MDT 2013"},{"aspect":"self_created","tweet":"At NASCAR event, Pres Obama again vows to find those responsible for \"yesterday’s cowardly act\" in Boston & bring them to justice.","date":"Tue Apr 16 13:02:16 MDT 2013"},{"aspect":"self_created","tweet":"Best parking place in DC. Brad Keselowski's #2 Miller Lite Ford Fusion parked at the South Portico of the WH for NASCAR ceremony.","date":"Tue Apr 16 12:52:51 MDT 2013"},{"aspect":"self_created","tweet":"WH posts photo of Pres Obama's Oval Office briefing today on Boston bombings with FBI Director & US Atty Gen. et al. http://t.co/eckdKUlVRv","date":"Tue Apr 16 12:18:58 MDT 2013"},{"aspect":"self_created","tweet":"@TheeMaMaBear Investigators don't know yet.","date":"Tue Apr 16 12:00:01 MDT 2013"},{"aspect":"self_created","tweet":"@wccoradio @JordanaWCCO Thanks. Was good to be with you.","date":"Tue Apr 16 11:56:24 MDT 2013"},{"aspect":"self_created","tweet":"Deputy Mayor  @howiewolf tweets photo of Boston flag flying at NY City Hall today. http://t.co/D5CRYd4AoO","date":"Tue Apr 16 10:40:26 MDT 2013"},{"aspect":"self_created","tweet":"\"On this anniversary,\" says the pres. of founding of Israel 65 yrs ago, \"we reaffirm the unbreakable alliance between our two nations.\"","date":"Tue Apr 16 10:27:47 MDT 2013"},{"aspect":"self_created","tweet":"Marking 65th anniversary of founding of Israel, Pres Obama reaffirms \"Israel has had no greater friend and ally than the United States.\"","date":"Tue Apr 16 10:26:02 MDT 2013"},{"aspect":"self_created","tweet":"@lap58 Thanks for the kind words. Much appreciated. Glad you find my tweets worthwhile.","date":"Tue Apr 16 10:17:25 MDT 2013"},{"aspect":"self_created","tweet":"@Hooch01Kathy @michellemalkin WH announced the president's delegation last evening. http://t.co/M8knxYRmPn","date":"Tue Apr 16 10:13:08 MDT 2013"},{"aspect":"self_created","tweet":"@Hooch01Kathy @michellemalkin Tweeted last night. Pres sending delegation headed by former Secys of State Shultz and Baker.","date":"Tue Apr 16 09:56:57 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama made statement on Boston bombings after meeting with FBI Dir Mueller, Atty Gen Holder, Homeland Security Secy Napolitano et al.","date":"Tue Apr 16 09:47:41 MDT 2013"},{"aspect":"self_created","tweet":"@lap58 No problem. You raised a good question that merited a response.","date":"Tue Apr 16 09:40:10 MDT 2013"},{"aspect":"self_created","tweet":"For first time, Pres Obama publicly referred to the Boston explosions as \"bombings\" and an \"act of terrorism.\"","date":"Tue Apr 16 09:36:55 MDT 2013"},{"aspect":"self_created","tweet":"We don’t yet have a sense of motive for the Boston bombings, says Pres Obama, and everything else is speculation.","date":"Tue Apr 16 09:36:09 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says we don't yet know who carried out the bombings or why and whether a terror group is responsible or a malevolent individual.","date":"Tue Apr 16 09:34:29 MDT 2013"},{"aspect":"self_created","tweet":"\"This was a heinous and cowardly act,\" says Pres Obama just now at WH. Says FBI investigating bombings as \"act of terrorism.\"","date":"Tue Apr 16 09:33:26 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama issues proclamation directing flags be flown at half-staff through April 20 as \"mark of respect\" for Boston victims.","date":"Tue Apr 16 08:48:17 MDT 2013"},{"aspect":"self_created","tweet":"@daveweigel @ron_fournier As reporters, we struggle to accurately describe the nature of a bombing & the president's words provide guidance.","date":"Tue Apr 16 08:46:11 MDT 2013"},{"aspect":"self_created","tweet":"@JCWPolitics No motive or agenda other than to report on what the president says and the words he uses or doesn't. SOP.","date":"Tue Apr 16 08:34:12 MDT 2013"},{"aspect":"self_created","tweet":"@lap58 Who ridiculed? Just reported on what the president said and what he didn't say.","date":"Tue Apr 16 08:32:38 MDT 2013"},{"aspect":"self_created","tweet":"@daveweigel @ron_fournier It's our job to care about the words the president uses or not. Campaign or not.","date":"Tue Apr 16 08:25:16 MDT 2013"},{"aspect":"self_created","tweet":"On this Emancipation Day in DC, @USNatArchives links to history of slavery & emancipation here. http://t.co/DRWGJ5wbiR","date":"Tue Apr 16 08:22:57 MDT 2013"},{"aspect":"self_created","tweet":"WH official says Pres Obama made clear to aides he expects to be kept up to date on any Boston developments.","date":"Tue Apr 16 06:19:51 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama updated overnight on the investigation of the Boston bombings. Will be further updated today by FBI Dir Mueller.","date":"Tue Apr 16 06:18:56 MDT 2013"},{"aspect":"self_created","tweet":"On the lighter side tomorrow, Pres Obama hosts South Lawn event to honor Brad Keselowski and his NASCAR Sprint Cup Series championship.","date":"Mon Apr 15 19:00:22 MDT 2013"},{"aspect":"self_created","tweet":"WH says US \"firmly committed to continuing to deepen the US-UAE partnership through close and regular consultations.\" But no press coverage.","date":"Mon Apr 15 18:59:03 MDT 2013"},{"aspect":"self_created","tweet":"US regards UAE as an important friend and partner in the Persian Gulf. WH says the leaders will discuss their \"strong & enduring ties.\"","date":"Mon Apr 15 18:58:04 MDT 2013"},{"aspect":"self_created","tweet":"Tomorrow at the WH: Pres Obama has private talks & a working lunch with Crown Prince Mohammed Bin Zayed of the United Arab Emirates.","date":"Mon Apr 15 18:54:57 MDT 2013"},{"aspect":"self_created","tweet":"The announcement sends clear message to NKorea's Kim Jong Un that reflects \"importance of the U.S.-ROK alliance.\"","date":"Mon Apr 15 18:14:18 MDT 2013"},{"aspect":"self_created","tweet":"WH announces that Pres Obama will welcome South Korean Pres Park Geun-hye to WH talks on May 7th. Marks 60th anniv of US/Korea alliance.","date":"Mon Apr 15 18:12:53 MDT 2013"},{"aspect":"self_created","tweet":"Also in the Pres Delegation to the funeral: Barbara Stephenson, Charge d’Affaires at US Embassy to UK; Louis Susman, former US Amb to UK.","date":"Mon Apr 15 18:08:29 MDT 2013"},{"aspect":"self_created","tweet":"Both Shultz and Baker served as Secy of State during Thatcher's term as British Prime Minister.","date":"Mon Apr 15 18:06:54 MDT 2013"},{"aspect":"self_created","tweet":"Shultz was Secy of State under Pres Reagan from 1982-1989. Baker served as Secy under Pres GHWBush, from 1989 to 1992.","date":"Mon Apr 15 18:06:16 MDT 2013"},{"aspect":"self_created","tweet":"WH announces former Secretaries of State George Shultz & James Baker will head Presidential Delegation to funeral of Margaret Thatcher.","date":"Mon Apr 15 18:02:23 MDT 2013"},{"aspect":"self_created","tweet":"CBS' Bob Orr reports there's been no credible claim of responsibilities for the Boston bombings.","date":"Mon Apr 15 17:08:49 MDT 2013"},{"aspect":"self_created","tweet":"Sr official tells @MajorCBS that Pres Obama considers the bombings in Boston to be an act of terrorism, though he didn't use those words.","date":"Mon Apr 15 16:50:29 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama also did not use the words 'bomb\" or 'bombings' in his statement on \"the events in Boston\" tonight.","date":"Mon Apr 15 16:43:40 MDT 2013"},{"aspect":"self_created","tweet":"Pedestrians barred from sidewalk and street in front of WH as part of expanded security precautions by Secret Service.","date":"Mon Apr 15 16:30:06 MDT 2013"},{"aspect":"self_created","tweet":"\"This is a terrible day for all Americans,\" says Boehner, \"but we will carry on in the American spirit & come together w/ grace & strength.”","date":"Mon Apr 15 16:27:27 MDT 2013"},{"aspect":"self_created","tweet":"Tweet from @SpeakerBoehner: Flags over US Capitol lowered to half-staff for victims of Boston explosions.","date":"Mon Apr 15 16:21:34 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama reaffirms that \"every single federal resource\" will be made available to help Mass & Boston authorities respond to the incident.","date":"Mon Apr 15 16:16:17 MDT 2013"},{"aspect":"self_created","tweet":"Pres. Obama stops short of calling the explosions acts of terrorism.","date":"Mon Apr 15 16:15:08 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama vows that investigators will get to the bottom of explosions in Boston and those responsible will feel \"full weight of justice.\"","date":"Mon Apr 15 16:14:47 MDT 2013"},{"aspect":"self_created","tweet":"\"We still do not know who did this,\" says Pres Obama of what happened in Boston, \"and people should not jump to conclusions.\"","date":"Mon Apr 15 16:13:53 MDT 2013"},{"aspect":"self_created","tweet":"\"Out of abundance of caution,\" Secret Service has expanded security perimeter around the White House complex. \"Not unusual,\" says spksmn.","date":"Mon Apr 15 15:59:45 MDT 2013"},{"aspect":"self_created","tweet":"FAA reduces Temporary Flight Restriction over Boston explosion area. Also lifts \"ground stop\" on flights bound for Logan.","date":"Mon Apr 15 15:53:41 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama to appear in WH Briefing Room at 610pm/ET to make a statement on the situation in Boston.","date":"Mon Apr 15 15:47:51 MDT 2013"},{"aspect":"self_created","tweet":"WH says Pres Obama also updated on Boston by Homeland Security Secy Janet Napolitano.","date":"Mon Apr 15 15:30:16 MDT 2013"},{"aspect":"self_created","tweet":"WH posts photo of Pres Obama on the phone with FBI Dir Robt Mueller getting update on Boston situation. http://t.co/55cq8Gjcw3","date":"Mon Apr 15 15:27:37 MDT 2013"},{"aspect":"self_created","tweet":"As precaution, FAA implements “ground stop” at Boston’s Logan Airport. Flights bound for Boston are holding at departure airports.","date":"Mon Apr 15 15:03:19 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama offering concern for victims & says Administration ready to provide needed support to Mass & Boston in response.","date":"Mon Apr 15 14:39:04 MDT 2013"},{"aspect":"self_created","tweet":"WH says Pres Obama has spoken by phone with Boston Mayor Tom Menino and Mass Gov Deval Patrick about the explosions.","date":"Mon Apr 15 14:37:55 MDT 2013"},{"aspect":"self_created","tweet":"VP Biden comment about \"bombings\" in Boston just an assumption based on what he was seeing on TV.","date":"Mon Apr 15 14:36:56 MDT 2013"},{"aspect":"self_created","tweet":"WH official says Pres Obama notified of incident in Boston. He authorized federal assistance in the investigation and response.","date":"Mon Apr 15 14:00:32 MDT 2013"},{"aspect":"self_created","tweet":"Spksmn Jay Carney says WH has long-desired a dialogue with Venezuela on drug trafficking, counterterrorism & other issues.","date":"Mon Apr 15 11:13:54 MDT 2013"},{"aspect":"self_created","tweet":"WH applauds Venezuela on peaceful election but supports audit of close results as \"prudent.\"","date":"Mon Apr 15 11:13:07 MDT 2013"},{"aspect":"self_created","tweet":"Boehner's office says House delegation will fly commercial to London since House use of military aircraft suspended due to sequestration.","date":"Mon Apr 15 10:10:02 MDT 2013"},{"aspect":"self_created","tweet":"WH has yet to announce a Presidential Delegation to the Thatcher funeral.","date":"Mon Apr 15 10:08:28 MDT 2013"},{"aspect":"self_created","tweet":"House Delegation to Thatcher funeral includes Reps. Marsha Blackburn, R-TN., Michele Bachmann, R-MN and George Holding, R-NC.","date":"Mon Apr 15 10:08:01 MDT 2013"},{"aspect":"self_created","tweet":"Speaker Boehner sending House Delegation to funeral of former British Prime Minister Margaret Thatcher this week.","date":"Mon Apr 15 10:04:45 MDT 2013"},{"aspect":"self_created","tweet":"The NSC statement also says Donilon's talks with Putin helping to prepare for US-Russia Summit in early September.","date":"Mon Apr 15 08:48:19 MDT 2013"},{"aspect":"self_created","tweet":"Statement says the Donilon mtg with Russian leaders laying groundwork for Pres Obama's talks with Putin at the G8 Summit in UK in June.","date":"Mon Apr 15 08:47:17 MDT 2013"},{"aspect":"self_created","tweet":"WH says National Security Advisor Tom Donilon held \"comprehensive & constructive\" talks today in Russia w/ Pres Putin & other officials.","date":"Mon Apr 15 08:44:57 MDT 2013"},{"aspect":"self_created","tweet":"@14smiu Well it must be legal - if he used it in pro Tournament play, right? What's next - a gyroscope in the golf club?","date":"Sun Apr 14 18:00:46 MDT 2013"},{"aspect":"self_created","tweet":"Finally. 60 MINUTES. 56 minutes late.","date":"Sun Apr 14 17:57:38 MDT 2013"},{"aspect":"self_created","tweet":"THey at least out to give a tie and pocket hankie combo with the Green Jacket too.","date":"Sun Apr 14 17:53:59 MDT 2013"},{"aspect":"self_created","tweet":"\"Anybody seen a 40-long for Scott?\"","date":"Sun Apr 14 17:47:55 MDT 2013"},{"aspect":"self_created","tweet":"What's taking so long? Can't they find a jacket to fit the winner?","date":"Sun Apr 14 17:46:54 MDT 2013"},{"aspect":"self_created","tweet":"And they cited Tiger for slow play.","date":"Sun Apr 14 17:44:19 MDT 2013"},{"aspect":"self_created","tweet":"Seems like they're playing in slow motion.","date":"Sun Apr 14 17:36:05 MDT 2013"},{"aspect":"self_created","tweet":"Also tomorrow: Pres Obama accepts credentials from 5 new Ambassadors to the US from Argentina, China, Tunisia, Georgia and El Salvador.","date":"Sun Apr 14 17:24:59 MDT 2013"},{"aspect":"self_created","tweet":"As we wait: Tomorrow at the WH: a sports event: Pres Obama hosts reception for BCS National Champion University of Alabama Crimson Tide.","date":"Sun Apr 14 17:23:22 MDT 2013"},{"aspect":"self_created","tweet":"Don't they ever stop a golf tournament on account of rain?","date":"Sun Apr 14 17:17:52 MDT 2013"},{"aspect":"self_created","tweet":"Would love to have the umbrella concession at the Masters tonight.","date":"Sun Apr 14 17:11:34 MDT 2013"},{"aspect":"self_created","tweet":"The leader may be 9-under, but now they're all 6 over.","date":"Sun Apr 14 17:07:43 MDT 2013"},{"aspect":"self_created","tweet":"Do players in other pro sports use umbrellas? Ever seen a linebacker head out to the field with an umbrella?","date":"Sun Apr 14 17:06:52 MDT 2013"},{"aspect":"self_created","tweet":"They ought to give out clocks with those green jackets.","date":"Sun Apr 14 17:05:51 MDT 2013"},{"aspect":"self_created","tweet":"Playoff. Instead of green jackets, ought to give these guys a watch. Off by 7 means off by 7.","date":"Sun Apr 14 17:02:23 MDT 2013"},{"aspect":"self_created","tweet":"Oh no. They're talking about overtime play. How about just flipping a coin?","date":"Sun Apr 14 16:58:08 MDT 2013"},{"aspect":"self_created","tweet":"Knoller to Masters. 6 minutes guys. Tick tock.","date":"Sun Apr 14 16:55:19 MDT 2013"},{"aspect":"self_created","tweet":"What kind of putter did Scott use?. Never saw a putter like that. Is it legal?","date":"Sun Apr 14 16:53:58 MDT 2013"},{"aspect":"self_created","tweet":"\"We met our beautiful granddaughter today,\" say the Bushes, \"Jenna and Mila are healthy.  And our family is elated.”","date":"Sun Apr 14 14:26:12 MDT 2013"},{"aspect":"self_created","tweet":"Bush statement says the child is named for her grandmothers: Margaret Laura \"Mila\" Hager, born last night in NYC.","date":"Sun Apr 14 14:25:30 MDT 2013"},{"aspect":"self_created","tweet":"Former Pres GWBush and Laura announce birth of grandchild by daughter Jenna and husband Henry Hager.","date":"Sun Apr 14 14:24:37 MDT 2013"},{"aspect":"self_created","tweet":"@DamianBennett @jtLOL @PruPaine @instapundit You'r right. some days it sure seems that way.","date":"Sun Apr 14 11:52:16 MDT 2013"},{"aspect":"self_created","tweet":"Immigration reform. Sen. Marco Rubio, R-FL., is on each of the network Sunday talk shows today.","date":"Sun Apr 14 08:05:23 MDT 2013"},{"aspect":"self_created","tweet":"No press coverage.","date":"Sun Apr 14 07:40:52 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama playing basketball this morning at the FBI gym.","date":"Sun Apr 14 07:40:03 MDT 2013"},{"aspect":"self_created","tweet":"@LoganMurphy1 You might think, but I'm only half-way through denial. Still have anger, bargaining depression to go before acceptance.","date":"Sat Apr 13 17:37:27 MDT 2013"},{"aspect":"self_created","tweet":"@worm_66 yeah, I know. slow as molasses.","date":"Sat Apr 13 16:56:09 MDT 2013"},{"aspect":"self_created","tweet":"@KAC87 When I want drama, I'll watch a Humphrey Bogart movie. Don't get caught up in the \"drama\" of horse racing. But thanks anyway.","date":"Sat Apr 13 16:48:16 MDT 2013"},{"aspect":"self_created","tweet":"@kglonews Like saying no sunrise scheduled today.","date":"Sat Apr 13 16:39:22 MDT 2013"},{"aspect":"self_created","tweet":"I heard a couple of players got cited for slow playing. About time. Golf should be over by 630pm/ET.","date":"Sat Apr 13 16:31:24 MDT 2013"},{"aspect":"self_created","tweet":"Some \"masters\" these players. They can't even finish their rounds in time for the news.","date":"Sat Apr 13 16:30:35 MDT 2013"},{"aspect":"self_created","tweet":"Is March Madness over yet? I've lost track. Can we watch the news on weekends now?","date":"Sat Apr 13 16:04:18 MDT 2013"},{"aspect":"self_created","tweet":".@jrambob His foursome includes 3 WH aides including his most frequent golf partner, WH Trip Director Marvin Nicholson.","date":"Sat Apr 13 10:57:18 MDT 2013"},{"aspect":"self_created","tweet":"On a mild Spring day in DC, Pres Obama is playing a round of golf at Andrews. Third Saturday in a row.","date":"Sat Apr 13 10:45:43 MDT 2013"},{"aspect":"self_created","tweet":"The commercial doesnt show Pacino or identify him. It just uses an audio clip of Pacino's motivational remarks to his team.","date":"Sat Apr 13 08:00:32 MDT 2013"},{"aspect":"self_created","tweet":"In an article Feb 19th, @latimes says Jeep paid Pacino and Warner Bros for the right to use an audio clip from the Oliver Stone movie.","date":"Sat Apr 13 07:57:08 MDT 2013"},{"aspect":"self_created","tweet":"It sounded like Al Pacino doing the Jeep commercial. @latimes says its part of Pacino's speech from the football movie \"Any Given Sunday.\"","date":"Sat Apr 13 07:55:37 MDT 2013"},{"aspect":"self_created","tweet":"@ThomasHCrown Thanks. Meant \"parent.\"","date":"Sat Apr 13 07:17:33 MDT 2013"},{"aspect":"self_created","tweet":"\"The president’s budget isn’t a compromise,\" says Walorski, \"it’s a blank check for more spending and more debt.\"","date":"Sat Apr 13 07:07:47 MDT 2013"},{"aspect":"self_created","tweet":"Further, Walorski the Obama budget \"would spend $964 billion more of your hard-earned money than it is already planning to spend.\"","date":"Sat Apr 13 07:06:46 MDT 2013"},{"aspect":"self_created","tweet":"Speaking for the GOP, Rep. Jackie Walorski of IN., says \"the last thing American families can afford is more tax hikes from Washington.","date":"Sat Apr 13 07:05:29 MDT 2013"},{"aspect":"self_created","tweet":"Republicans using their Weekly Address to slam Pres Obama's new budget saying \"taxes would go up on just about every American.\"","date":"Sat Apr 13 07:02:26 MDT 2013"},{"aspect":"self_created","tweet":"WH invited Wheeler to deliver the address in place of the pres. She & her husband wrote the remarks & taped it yesterday morning at the WH.","date":"Sat Apr 13 06:58:07 MDT 2013"},{"aspect":"self_created","tweet":"\"We have to convince the Senate to come together and pass commonsense gun responsibility reforms,\" says Wheeler.","date":"Sat Apr 13 06:51:35 MDT 2013"},{"aspect":"self_created","tweet":"\"Please help us do something before our tragedy becomes your tragedy,\" says Francine Wheeler in the president's address.","date":"Sat Apr 13 06:17:51 MDT 2013"},{"aspect":"self_created","tweet":"Only a mother could talk first hand about the profound loss of a child in a senseless shooting rampage in a school.","date":"Sat Apr 13 06:16:42 MDT 2013"},{"aspect":"self_created","tweet":"The 6-year old son of Francine Wheeler, Ben, was among the children shot dead at Sandy Hook Elementary 4 months ago this weekend.","date":"Sat Apr 13 06:15:00 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama has already made 13 speeches on gun violence, so he asked mom of slain 1st grader to deliver his Weekly Address today.","date":"Sat Apr 13 06:13:48 MDT 2013"},{"aspect":"self_created","tweet":"Only way for politicians to know first hand how ridiculously complex the tax code is - is to fill out their own returns.","date":"Fri Apr 12 22:33:59 MDT 2013"},{"aspect":"self_created","tweet":"Neither Pres Obama or VP Biden prepared their own tax returns. Both used accounting firms.","date":"Fri Apr 12 22:26:01 MDT 2013"},{"aspect":"self_created","tweet":"Alternative Minimum Tax added $21,000 to the Obama's federal taxes. AMT added nearly $6,000 to the Biden's taxes.","date":"Fri Apr 12 22:17:26 MDT 2013"},{"aspect":"self_created","tweet":"Though he would wear that cowboy hat, Pres Bush carried his pilot's helmet in his arms as well. http://t.co/rMyMUoSp9E","date":"Fri Apr 12 18:34:32 MDT 2013"},{"aspect":"self_created","tweet":"Pres GWBush was okay with hats: like the white Stetson given leaders arriving in Calgary in '02 for the G8 Summit. http://t.co/FlZxiZ2Z5U","date":"Fri Apr 12 18:20:22 MDT 2013"},{"aspect":"self_created","tweet":"Few forget the ribbing given Dem Pres Cand Mike Dukakis when he donned a helmet in 1988 while riding in a tank. http://t.co/0UrTQnt3N2","date":"Fri Apr 12 18:15:33 MDT 2013"},{"aspect":"self_created","tweet":"Perhaps Pres Obama wasn't happy with his appearance wearing the hat he received on his 2009 visit to Egypt. http://t.co/TzlVegEe5O","date":"Fri Apr 12 18:10:24 MDT 2013"},{"aspect":"self_created","tweet":"\"That’s politics 101,\" said the president, holding the helmet in his hands: \"You never look good wearing something on your head.\"","date":"Fri Apr 12 18:08:27 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama offered the no hats advice today upon being presented with a US Navy helmet during a CINC's Trophy event in the East Room.","date":"Fri Apr 12 18:07:32 MDT 2013"},{"aspect":"self_created","tweet":"From Pres Obama's Presidential Political rulebook: No hats. \"You don’t put stuff on your head if you’re President.\"","date":"Fri Apr 12 18:06:24 MDT 2013"},{"aspect":"self_created","tweet":"Fave Jonathan Winters role: police officer \"Norman\" in \"The Russians Are Coming (x2)\" who led the battle cry \"we have got to get organized.\"","date":"Fri Apr 12 18:00:02 MDT 2013"},{"aspect":"self_created","tweet":"Organizing for Action can use all the Obama Campaign's fundraising records & apparatus to generate funds to support his 2nd term policies.","date":"Fri Apr 12 07:58:43 MDT 2013"},{"aspect":"self_created","tweet":"Actually, its Organizing for Action, and the group reports receiving nearly 110,000 contributions in the 1st quarter. Avg donation was $44.","date":"Fri Apr 12 07:57:15 MDT 2013"},{"aspect":"self_created","tweet":"The current incarnation of the Obama Campaign, now called Organizing for America, raised nearly $4.9-million in the 1st quarter of the year.","date":"Fri Apr 12 07:55:31 MDT 2013"},{"aspect":"self_created","tweet":"When it was stolen, the truckload of equipment had been parked in a motel parking lot in advance of a presidential event nearby.","date":"Fri Apr 12 07:44:54 MDT 2013"},{"aspect":"self_created","tweet":"The stolen gear included microphones, cables, speakers and even the presidential lectern, presidential seal and TelePrompTer.","date":"Fri Apr 12 07:41:58 MDT 2013"},{"aspect":"self_created","tweet":"Yesterday, in Richmond, Va., a federal judge sentenced Eric Brown to 7 years in prison for the theft of the president's audio equipment.","date":"Fri Apr 12 07:40:57 MDT 2013"},{"aspect":"self_created","tweet":"You may recall that in October 2011, a truck load of audio equipment belonging to the White House Communications Agency was stolen.","date":"Fri Apr 12 07:39:01 MDT 2013"},{"aspect":"self_created","tweet":"@DouglasLucas He got grilled pretty good on Administration decisions and policies.","date":"Thu Apr 11 17:22:18 MDT 2013"},{"aspect":"self_created","tweet":"VP's office says no press coverage of Biden's remarks at the CIA event. No surprise.","date":"Thu Apr 11 16:42:02 MDT 2013"},{"aspect":"self_created","tweet":"Brennan survived a tough confirmation process last month. Senate voted 63-34 on March 7th. Brennan former WH advisor on homeland security.","date":"Thu Apr 11 16:41:01 MDT 2013"},{"aspect":"self_created","tweet":"Also tomorrow: VP Biden makes remarks at CIA Headquarters as part of welcome ceremony for new CIA Director John Brennan.","date":"Thu Apr 11 16:39:32 MDT 2013"},{"aspect":"self_created","tweet":"Tomorrow at the WH: Only 1 event scheduled so far: Pres Obama presents Commander-in-Chief's trophy to US Naval Academy football team.","date":"Thu Apr 11 16:36:43 MDT 2013"},{"aspect":"self_created","tweet":"The president said the US would also live up to its alliances in the region against NKorean aggression.","date":"Thu Apr 11 14:33:19 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama also said US would try to resolve NKorea situation \"diplomatically\" but will take \"all necessary steps\" to protect Americans.","date":"Thu Apr 11 14:32:19 MDT 2013"},{"aspect":"self_created","tweet":"The UN chief also calls on China and others with influence on NKorea to try to help resolve the situation peacefully.","date":"Thu Apr 11 14:29:33 MDT 2013"},{"aspect":"self_created","tweet":"Ban Ki-moon says he's deeply concerned about NKorea and urges its leaders to refrain from further provocative measures and rhetoric.","date":"Thu Apr 11 14:27:44 MDT 2013"},{"aspect":"self_created","tweet":"On the Middle East: Pres Obama said there's a window of opportunity for Israelis and Palestinians to get back to the peace table.","date":"Thu Apr 11 14:24:32 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says the humanitarian crisis in Syria has gotten worse & US will work to eliminate some of carnage inflicted on civilians.","date":"Thu Apr 11 14:23:16 MDT 2013"},{"aspect":"self_created","tweet":"During photo op in Oval Office with Ban Ki-moon, Pres Obama also says we're at a \"critical juncture\" with Syria.","date":"Thu Apr 11 14:22:10 MDT 2013"},{"aspect":"self_created","tweet":"In mtg w/ UN Secy Gen Ban Ki-moon, Pres Obama again calls on NKorea to end its belligerence. No one wants a war on the peninsula, he says.","date":"Thu Apr 11 14:20:52 MDT 2013"},{"aspect":"self_created","tweet":"A word you don't hear much but is spoken at every Medal of Honor ceremony in describing the recipient: intrepidity.","date":"Thu Apr 11 12:59:04 MDT 2013"},{"aspect":"self_created","tweet":"Can't think of any more moving or solemn presidential ceremonies than a Medal of Honor presentation.","date":"Thu Apr 11 12:49:09 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama presents the Medal of Honor, in a wooden showcase, to Father Kapaun's nephew Ray, born after his uncle died.","date":"Thu Apr 11 12:42:02 MDT 2013"},{"aspect":"self_created","tweet":"Medal citation says Chaplain Kapaun \"distinguished himself with acts of gallantry and intrepidity\" in the Korean War in November 1950.","date":"Thu Apr 11 12:38:53 MDT 2013"},{"aspect":"self_created","tweet":"Audience in the East Room for the Medal ceremony included former American POWs once held in North Korea like Father Kapaun.","date":"Thu Apr 11 12:36:45 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama spoke of Father Kapaun's death in a \"hell hole\" of a death house in the prison campaign, given no food or water.","date":"Thu Apr 11 12:35:04 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama spoke of the profound care Chaplain (Capt) Kapaun showed for US personnel in a North Korean prison camp in which they were held.","date":"Thu Apr 11 12:33:22 MDT 2013"},{"aspect":"self_created","tweet":"\"We honor an American solider who didn't fire a gun,\" says the Pres., but who put his own life at risk so other soldiers might live.","date":"Thu Apr 11 12:31:05 MDT 2013"},{"aspect":"self_created","tweet":"This is the 11th Medal of Honor Pres Obama has bestowed on his watch, the 6th bestowed posthumously.","date":"Thu Apr 11 12:29:12 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says fellow soldiers who served with Chaplain Kapaun in the Korean War \"a saint.\"","date":"Thu Apr 11 12:27:17 MDT 2013"},{"aspect":"self_created","tweet":"At Medal of Honor ceremony, Pres Obama calls the story of Chaplain Emil Kapaun \"amazing.\" Says he was called \"a shepherd in combat boots.\"","date":"Thu Apr 11 12:25:59 MDT 2013"},{"aspect":"self_created","tweet":"First Lady to deliver commencement speeches this season at Eastern Kentucky Univ., Bowie State Univ., & MLK Jr HS in Nashville.","date":"Thu Apr 11 10:39:45 MDT 2013"},{"aspect":"self_created","tweet":"Carney said the president told the Sandy Hook fams that the \"bipartisan progress\" in the Senate was \"not possible\" without their efforts.","date":"Thu Apr 11 10:32:44 MDT 2013"},{"aspect":"self_created","tweet":"WH/Carney just said Pres Obama phoned Sandy Hook families to congrat them on Senate cloture vote and credit them for \"bipartisan progress.\"","date":"Thu Apr 11 10:31:32 MDT 2013"},{"aspect":"self_created","tweet":"@dlb703 how do you know if my face is straight?","date":"Thu Apr 11 10:27:30 MDT 2013"},{"aspect":"self_created","tweet":"How about lunch? @nancycordes reports Senate Dems and GOPs having lunch together following cloture vote this morning. Unusual, she says.","date":"Thu Apr 11 10:26:34 MDT 2013"},{"aspect":"self_created","tweet":"On the president's budget: Carney says \"it's a serious offer to try to find common ground with Republicans.\"","date":"Thu Apr 11 10:23:56 MDT 2013"},{"aspect":"self_created","tweet":"On Syria, WH says Pres Obama awaits recommendations on ways to increase \"non-lethal assistance\" to those seeking to overthrow Assad.","date":"Thu Apr 11 10:17:24 MDT 2013"},{"aspect":"self_created","tweet":"More from @nancycordes on Senate 68-31 cloture vote: 16 Republicans voted to proceed to votes, 2 Dems voted against.","date":"Thu Apr 11 10:10:35 MDT 2013"},{"aspect":"self_created","tweet":"On Senate gun violence vote, Carney says the pres has no doubt the voices of Newtown families \"may well have been decisive.”","date":"Thu Apr 11 10:06:30 MDT 2013"},{"aspect":"self_created","tweet":"On Social Security, says Carney, Pres Obama knows he has to make tough choices and Dems will have to accept some things they don’t like.","date":"Thu Apr 11 10:04:23 MDT 2013"},{"aspect":"self_created","tweet":"What's in a name? @CharlieKayeCBS reports World Meteorological Assn's hurricane committee is retiring the name Sandy.","date":"Thu Apr 11 10:00:44 MDT 2013"},{"aspect":"self_created","tweet":"Carney defends Obama proposal to slow cost of living increases for Social Security. Says it comes at \"specific behest\" of GOP leaders.","date":"Thu Apr 11 09:58:13 MDT 2013"},{"aspect":"self_created","tweet":"At WH briefing, Jay Carney welcomes Senate vote to proceed on gun violence proposals. \"Encourage by bipartisan progress,\" he says.","date":"Thu Apr 11 09:53:10 MDT 2013"},{"aspect":"self_created","tweet":".@nancycordes reports Senate votes 68-31 to bypass filibuster and proceed to votes on gun violence bill and amendments.","date":"Thu Apr 11 09:42:11 MDT 2013"},{"aspect":"self_created","tweet":"WH official says the pres and Senators has a \"constructive, wide-ranging discussion\" on the deficit, immigration reform & gun violence.","date":"Wed Apr 10 19:34:48 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama's WH dinner with GOP Senators is over. Ran just over 2 1/2 hours. Menu included green salad, steak and sauted vegetables.","date":"Wed Apr 10 19:33:01 MDT 2013"},{"aspect":"self_created","tweet":"Here's the Army fact sheet on Chaplain Kapaun and the gallantry that led to his Medal of Honor. http://t.co/dPORasV42y","date":"Wed Apr 10 18:34:06 MDT 2013"},{"aspect":"self_created","tweet":"Also tomorrow, Pres. Obama meets with UN Secretary General Ban Ki-moon to discuss heightened belligerence & threats by North Korea.","date":"Wed Apr 10 18:30:06 MDT 2013"},{"aspect":"self_created","tweet":"The Government reported youth unemployment is 24.2% - even as the national unemployment rate declined to 7.6% in March.","date":"Wed Apr 10 18:28:43 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama also has a conference call tomorrow with 100 local elected officials to discuss programs to boost youth employment.","date":"Wed Apr 10 18:26:02 MDT 2013"},{"aspect":"self_created","tweet":"Also tomorrow, Pres Obama discusses the economy, his budget and other issues in meeting with CEOs of top financial services institutions.","date":"Wed Apr 10 18:24:48 MDT 2013"},{"aspect":"self_created","tweet":"Tomorrow's Medal of Honor ceremony is set for 210pm/ET. Live coverage on cable newsers and livestream online.","date":"Wed Apr 10 18:23:17 MDT 2013"},{"aspect":"self_created","tweet":"Tomorrow's ceremony will mark the 11th time Pres Obama has presented a Medal of Honor since taking office.","date":"Wed Apr 10 18:21:28 MDT 2013"},{"aspect":"self_created","tweet":"US soldiers who credit Chaplain Kapaul (pron: kuh-PAWN') with saving their lives, led a decades long campaign to get him the Medal of Honor.","date":"Wed Apr 10 18:19:20 MDT 2013"},{"aspect":"self_created","tweet":"Chaplain Kapaun, who died in a North Korean prison camp, will be the 6th chaplain to receive the Medal of Honor.","date":"Wed Apr 10 18:17:54 MDT 2013"},{"aspect":"self_created","tweet":"Chaplain Kapaun is being recognized for \"extraordinary heroism\" in combat in Unsan, Korea in November 1950.","date":"Wed Apr 10 18:11:35 MDT 2013"},{"aspect":"self_created","tweet":"Tomorrow at the WH: Pres Obama presides at ceremony bestowing posthumous Medal of Honor on US Army Chaplain Capt Emil Kapaun.","date":"Wed Apr 10 18:09:47 MDT 2013"},{"aspect":"self_created","tweet":"The dinner taking place in the WH Family Dining Room in the residence instead of a posh hotel restaurant like last time.","date":"Wed Apr 10 16:40:16 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama now dining with 12 Republican Senators to discuss his new budget, gun violence proposals, immigration reform & other issues.","date":"Wed Apr 10 16:38:49 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says Jewel has \"a keen understanding of what it means to be good stewards of our natural resources.\"","date":"Wed Apr 10 16:36:48 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama hails bipartisan Senate vote, 87-11, confirming Sally Jewel to be Secretary of the Interior.","date":"Wed Apr 10 16:35:34 MDT 2013"},{"aspect":"self_created","tweet":"RT @SharylAttkisson: GAO:Renewable energy initiatives overlap w 679 fed programs  23 agencies & 140 sub-agencies.$15 billion spent o ...","date":"Wed Apr 10 13:40:43 MDT 2013"},{"aspect":"self_created","tweet":"Notice WH statement offers relief to the Iranian people, not the to the Government of Iran.","date":"Wed Apr 10 13:15:32 MDT 2013"},{"aspect":"self_created","tweet":"WH offering disaster aid to Iranian people in wake of recent earthquake and aftershocks in southern Iran.","date":"Wed Apr 10 13:13:18 MDT 2013"},{"aspect":"self_created","tweet":"@jerseymaiden @zstixxjdz During the Bush Admin, funding for the Iraq War was approved as Supplemental Appropriations, not the annual budget.","date":"Wed Apr 10 12:58:15 MDT 2013"},{"aspect":"self_created","tweet":".@zstixxjdz Yeah. the unfunded liabilities for Medicare, Social Security and other off-budget obligations is about $60-Trillion.","date":"Wed Apr 10 12:11:47 MDT 2013"},{"aspect":"self_created","tweet":"We interrupt today's Budget tweets to bring you a Cherry Blossom photo by CBS Cherry Blossom Editor Jeff Goldman. http://t.co/3puaCvhe6k","date":"Wed Apr 10 12:08:06 MDT 2013"},{"aspect":"self_created","tweet":"WH also says the tobacco tax hike would serve to discourage youth smoking as well.","date":"Wed Apr 10 11:53:42 MDT 2013"},{"aspect":"self_created","tweet":"US Treasury estimates the tobacco tax, if enacted, would raiser $78-billion in new revenue over ten years.","date":"Wed Apr 10 11:53:12 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama's proposed tobacco tax hike would increase federal tax on cigarettes from just under $1.01 per pack to about $1.95 per pack.","date":"Wed Apr 10 11:52:27 MDT 2013"},{"aspect":"self_created","tweet":"Hatch says Pres Obama is \"falsely claiming $1.8-trillion in deficit reduction\" and is not the kind of leadership America deserves.","date":"Wed Apr 10 10:59:17 MDT 2013"},{"aspect":"self_created","tweet":"Hatch calls the new Budget \"a rehash of the same tax hikes, spending increases and deceptive budget gimmicks.\"","date":"Wed Apr 10 10:57:38 MDT 2013"},{"aspect":"self_created","tweet":"Citing new spending, taxes & debt, Orrin Hatch, ranking GOP on Senate Finance Committee, calls Pres Obama's new budget a \"disappointment.\"","date":"Wed Apr 10 10:56:35 MDT 2013"},{"aspect":"self_created","tweet":"Also, Obama budget projects next ten years of deficit will total $5.271-trillion.","date":"Wed Apr 10 09:49:20 MDT 2013"},{"aspect":"self_created","tweet":"Obama budget projects National Debt will climb to over $25-trillion over ten years. That's 97% of projected GDP of $26-trillion in 2023.","date":"Wed Apr 10 09:48:01 MDT 2013"},{"aspect":"self_created","tweet":"“The president got his tax hikes in January, we don’t need to be raising taxes on the American people,\" says Speaker Boehner.","date":"Wed Apr 10 09:23:46 MDT 2013"},{"aspect":"self_created","tweet":"Boehner says Pres Obama deserves \"some credit for some incremental entitlement reforms.\" But he shouldn't hold them hostage for tax hikes.","date":"Wed Apr 10 09:22:51 MDT 2013"},{"aspect":"self_created","tweet":"Speaker Boehner slams Pres Obama's budget for never coming to balance. \"You can’t continue to spend money that you don’t have.\"","date":"Wed Apr 10 09:21:20 MDT 2013"},{"aspect":"self_created","tweet":"If you're serious about deficit reduction, says the pres., there's no excuse to keep tax loopholes open for big corps and wealthy.","date":"Wed Apr 10 09:10:03 MDT 2013"},{"aspect":"self_created","tweet":"\"If we want to keep Medicare working as well as it has, we have to make some changes...but they don't have to be drastic,\" says the pres.","date":"Wed Apr 10 09:08:39 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says his plan to fund more infrastructure & make sure hard work pays off \"should not be partisan...should not be controversial.\"","date":"Wed Apr 10 09:07:09 MDT 2013"},{"aspect":"self_created","tweet":"He says his budget \"replaces the foolish across-the-board spending cuts that are already hurting our economy.\"","date":"Wed Apr 10 09:05:23 MDT 2013"},{"aspect":"self_created","tweet":"He says his budget will raise taxes on tobacco products that harm our young people.","date":"Wed Apr 10 09:04:22 MDT 2013"},{"aspect":"self_created","tweet":"Pres Obama says his budget makes the \"investments\" to help make America \"a magnet for new jobs.\"","date":"Wed Apr 10 09:03:24 MDT 2013"}]}