{"user_name":"ReutersZengerle","user_timeline":[{"aspect":"self_created","tweet":"Sen Grassley:\"Given the events of this week, it is important for us to understand the gaps and loopholes in our immigration system.\" #Boston","date":"Fri Apr 19 08:43:54 MDT 2013"},{"aspect":"self_created","tweet":"Seen reports brothers lived with their parents in Boston. But ABC has suspect's dad - from Russia - \"hell will break loose\" if he dies. ??","date":"Fri Apr 19 08:38:29 MDT 2013"},{"aspect":"self_created","tweet":"Was thinking as I came to work this morning (in DC) that Boston is reminding me a bit of the DC sniper hunt back in 2002.","date":"Fri Apr 19 08:34:59 MDT 2013"},{"aspect":"self_created","tweet":"Homeland Security Secretary Janet Napolitano cancelled her appearance today at a Senate hearing on immigration reform. Busy elsewhere!","date":"Fri Apr 19 08:30:15 MDT 2013"},{"aspect":"self_created","tweet":"Sen Grassley, who opposes comprehensive immigration reform, is tying Boston events to the need to go slow on immigration effort.","date":"Fri Apr 19 08:28:01 MDT 2013"},{"aspect":"self_created","tweet":"@WTOPtraffic ah the 123 backup in Mclean appears to be from Chain Bridge.","date":"Fri Apr 19 07:43:44 MDT 2013"},{"aspect":"self_created","tweet":"@WTOPtraffic huge backup on 123 in McLean. Is the GW jammed?","date":"Fri Apr 19 07:25:26 MDT 2013"},{"aspect":"self_created","tweet":"Yes MT “@greenfield64: Question to be asked at some pt: how civilians acquire arsenal of explosives that --reportedly--included grenades?”","date":"Fri Apr 19 06:38:21 MDT 2013"},{"aspect":"self_created","tweet":"Yes! And quick MT “@djrothkopf: Remarkable story of police work identifying, tracking suspects-info age & traditional tools at work.”","date":"Fri Apr 19 06:32:05 MDT 2013"},{"aspect":"self_created","tweet":"@nelikli and thanks!","date":"Fri Apr 19 06:16:54 MDT 2013"},{"aspect":"self_created","tweet":"@nelikli yes, that's what meant - seems quite unlikely.","date":"Fri Apr 19 06:16:43 MDT 2013"},{"aspect":"self_created","tweet":"RT @reuterspictures: SWAT teams enter a suburban neighborhood to search for the #bostonbomb suspect - http://t.co/fKVBJckltY LIVE http:/ ...","date":"Fri Apr 19 06:15:12 MDT 2013"},{"aspect":"self_created","tweet":"So the story is these two brothers came to the US to go to high school - no parents or other relatives? #Boston","date":"Fri Apr 19 06:11:59 MDT 2013"},{"aspect":"self_created","tweet":"RT @BuzzFeedAndrew: I think everyone's hoping Jeff Bauman will get to look into the eyes of the person who blew up his legs again under  ...","date":"Thu Apr 18 21:00:06 MDT 2013"},{"aspect":"self_created","tweet":"Er, men? RT “@TIME: What holds women back from the #TIME100? by @Catherine_Mayer on @TIMEIdeas | http://t.co/RxKL7r2xQ7”","date":"Thu Apr 18 20:44:47 MDT 2013"},{"aspect":"self_created","tweet":"Lot of senators - Rs and Ds - are thoughtful & impressive MT “@washingtonpost: This not yr founding fathers' Senate http://t.co/1KyhXiyvom”","date":"Thu Apr 18 20:42:17 MDT 2013"},{"aspect":"self_created","tweet":"Awful MT “@fmanjoo: This pic is incredibly awful. Martin Richard, 8-yr-old victim, circled in blue. Suspect in red. http://t.co/919ckr3jBv”","date":"Thu Apr 18 20:16:02 MDT 2013"},{"aspect":"self_created","tweet":"D's salivating RT “@WestWingReport: New name joins top tier of GOP 2016 candidates, says WWR partners at UVA: http://t.co/beAFGDsF2r”","date":"Thu Apr 18 20:13:16 MDT 2013"},{"aspect":"self_created","tweet":"!!!! RT “@HeardontheHill: TRUE STORY: @TomCoburn fell into a fountain up to his neck lat a gala last night http://t.co/uqmiYOgJis”","date":"Thu Apr 18 20:10:12 MDT 2013"},{"aspect":"self_created","tweet":"OK, my son insists that Super Mario (Balotelli) is on Time's most influential list \"because he's awesome.\" True?","date":"Thu Apr 18 19:59:54 MDT 2013"},{"aspect":"self_created","tweet":"Avoid him RT “@BuzzFeedAndrew: Seriously. Come on. Man witnessed both Boston bombing and West Texas explosion. http://t.co/GgYUnL8nAC”","date":"Thu Apr 18 19:04:23 MDT 2013"},{"aspect":"self_created","tweet":"RT @Reuters: Reuters published an obituary of George Soros in error. Reuters withdrew the article as soon as it appeared.","date":"Thu Apr 18 18:48:09 MDT 2013"},{"aspect":"self_created","tweet":"RT @THEHermanCain: Reuters wants you to know that Georges Soros is dead. Except he isn't. They should probably stop running his obituary ...","date":"Thu Apr 18 18:41:22 MDT 2013"},{"aspect":"self_created","tweet":"Background checks for Elvis impersonators?","date":"Thu Apr 18 13:58:40 MDT 2013"},{"aspect":"self_created","tweet":"RT @streitfeldcnn: Tourist O/H on the Hill: \"Is it like Coke and Pepsi fighting each other, the House and the Senate?\"","date":"Thu Apr 18 13:02:32 MDT 2013"},{"aspect":"self_created","tweet":"Striking how much less Benghazi has come up in this Senate hearing with Kerry compared with yesterday's hearing before a House panel.","date":"Thu Apr 18 09:47:20 MDT 2013"},{"aspect":"self_created","tweet":"Paul also makes case that aid can be stolen by foreign leaders, while there is money needed at home for bridges, other serious things, etc.","date":"Thu Apr 18 09:27:09 MDT 2013"},{"aspect":"self_created","tweet":"Sen. Rand Paul questions Kerry about why US is sending aid to Egypt, when there isn't money to keep holding White House tours.","date":"Thu Apr 18 09:25:29 MDT 2013"},{"aspect":"self_created","tweet":"But proving his deep Boston roots, Kerry notes that \"Sweet Adeline\" was the favorite song of Ted Kennedy's grandfather, \"Honey Fitz.\"","date":"Thu Apr 18 09:19:19 MDT 2013"},{"aspect":"self_created","tweet":"Kerry corrects self on Caroline/Adeline. blames it odd feeling of praising the Yankees.\"I'm not used to giving the evil empire credit.\"","date":"Thu Apr 18 09:18:30 MDT 2013"},{"aspect":"self_created","tweet":"Sen. Boxer, in foreign relations hearing, addresses Newtown families: \"I want to say how sorry I am for a do-nothing Senate\"","date":"Thu Apr 18 08:22:52 MDT 2013"},{"aspect":"self_created","tweet":"Kerry on Iran, asks for patience two months before election - says still believes diplomatic solution is the best answer.","date":"Thu Apr 18 08:04:41 MDT 2013"},{"aspect":"self_created","tweet":"Kerry said \"Sweet Adeline,\" instead of \"Sweet Caroline\" when talking about Yankees fans saluting Boston. Long week.","date":"Thu Apr 18 07:58:36 MDT 2013"},{"aspect":"self_created","tweet":"Kerry notes 11 of top 15 US trading partners are former beneficiaries of US aid. Says: \"Development is not charity. It's an investment.\"","date":"Thu Apr 18 07:56:29 MDT 2013"},{"aspect":"self_created","tweet":"Kerry: \"It's a privilege to be back here though still a little surreal to be on this side of the desk.\" on testifying to Foreign Relations.","date":"Thu Apr 18 07:44:53 MDT 2013"},{"aspect":"self_created","tweet":"This morning, SecState Kerry testifies before committee he used to chair. \"Welcome back, Mr. Secretary,\" says his successor, Sen. Menendez.","date":"Thu Apr 18 07:33:55 MDT 2013"},{"aspect":"self_created","tweet":"RT @rickygervais: If you watch @TheDailyShow tonight and see me mention how stupid some people on Twitter are, remember I do not mean yo ...","date":"Wed Apr 17 21:30:32 MDT 2013"},{"aspect":"self_created","tweet":"RT @andrewmseaman: One of the most deadly disasters in Texas history occurred exactly 66 years ago - a series of fertilizer explosions.  ...","date":"Wed Apr 17 21:01:49 MDT 2013"},{"aspect":"self_created","tweet":"Elvis impersonator obsessed w/\"illegal organ harvesting\" charged w/sending poison to Mississippi senator. Life or a magical realist novel?","date":"Wed Apr 17 20:55:57 MDT 2013"},{"aspect":"self_created","tweet":"This week. Waco. Whoa. RT “@TheAtlanticWire: A Fertilizer Plant Just Exploded Near Waco, Texas http://t.co/FI2sH94b4Z”","date":"Wed Apr 17 20:46:13 MDT 2013"},{"aspect":"self_created","tweet":"Purple tree. http://t.co/ow92hm78rU","date":"Wed Apr 17 16:49:33 MDT 2013"},{"aspect":"self_created","tweet":"Manchin says his amendment isn't dead: \"Now that everyone’s got whatever they’re getting out of their system ...we’ve got to come together.\"","date":"Wed Apr 17 16:11:28 MDT 2013"},{"aspect":"self_created","tweet":"Blumenthal, Conn senator, says today is his saddest day in public life. He has been shepherding the Newtown families.","date":"Wed Apr 17 15:36:10 MDT 2013"},{"aspect":"self_created","tweet":"Schumer: \"We will win this fight,\" tells families their actions will give strength, courage, rectitude. Says things change in Washington.","date":"Wed Apr 17 15:34:48 MDT 2013"},{"aspect":"self_created","tweet":"Schumer, after gun measure fails, \"let me salute the families who have lit a candle rather than cursing the darkness.\"","date":"Wed Apr 17 15:32:08 MDT 2013"},{"aspect":"self_created","tweet":"Manchin: tells \"every family of violence\" he will not give up on \"common-sense\" gun measures.","date":"Wed Apr 17 15:29:54 MDT 2013"},{"aspect":"self_created","tweet":"Reid says Senate Republicans are \"ignoring the voices if 90% of American people\" by voting against expanded background checks.","date":"Wed Apr 17 15:26:46 MDT 2013"},{"aspect":"self_created","tweet":"Before talking to the press, Sens Reid and Manchin are shaking hands with people who survived mass shootings or lost loved ones in them.","date":"Wed Apr 17 15:22:26 MDT 2013"},{"aspect":"self_created","tweet":"+20 RT “@chucktodd: Love when folks generalize my industry thanks to the actions of a few”","date":"Wed Apr 17 15:12:15 MDT 2013"},{"aspect":"self_created","tweet":"Certainly no impact on crowds of Capitol tourists of \"ricin scare.\" http://t.co/AYGqHDJTFY","date":"Wed Apr 17 13:49:54 MDT 2013"},{"aspect":"self_created","tweet":"RT @wolfblitzer: Just boarded flight to Phoenix & someone said: 'Thanks for all the good entertainment over the years.' Entertainment?","date":"Wed Apr 17 13:44:32 MDT 2013"},{"aspect":"self_created","tweet":"I should say, undeterred by the \"ricin threat,\" Vice President Biden says he is coming to the Capitol to preside over the 4 pm gun vote.","date":"Wed Apr 17 13:41:09 MDT 2013"},{"aspect":"self_created","tweet":"Undeterred by the ricin threat, VP Joe Biden is coming over to the Capitol to preside over the Senate's gun vote today.","date":"Wed Apr 17 13:40:35 MDT 2013"},{"aspect":"self_created","tweet":"Just learned: The Hart Senate office building was closed for 3 mths in 2001 due to anthrax, the largest building ever decontaminated.","date":"Wed Apr 17 13:22:50 MDT 2013"},{"aspect":"self_created","tweet":"Kerry on North Korea: \"Until we get to denuclearization, we're not going to go down the road of providing aid to them of any kind.\"","date":"Wed Apr 17 10:39:03 MDT 2013"},{"aspect":"self_created","tweet":"Many - a majority of? - Republicans on House Foreign Affairs Committee are asking Kerry about Benghazi.","date":"Wed Apr 17 10:25:29 MDT 2013"},{"aspect":"self_created","tweet":"Sen. Carl Levin says a staffer at his regional office in Saginaw, Michigan, received a  suspicious-looking letter earlier today.","date":"Wed Apr 17 10:22:45 MDT 2013"},{"aspect":"self_created","tweet":"The London Marathon is on Sunday.","date":"Wed Apr 17 10:09:41 MDT 2013"},{"aspect":"self_created","tweet":"Kerry on 'leading from behind.'\"Let me kill this idea of leading from behind. I don't know where it comes from. I don't know what it means.\"","date":"Wed Apr 17 10:02:44 MDT 2013"},{"aspect":"self_created","tweet":"Someone brought an infant to foreign affairs committee hearing. It's in the hallway now, crying hysterically, has been for some time.","date":"Wed Apr 17 10:00:08 MDT 2013"},{"aspect":"self_created","tweet":"Kerry, talking Syria refugee problem, notes 4th largest city in Jordan today is a tent city - it's a refugee camp.","date":"Wed Apr 17 09:56:48 MDT 2013"},{"aspect":"self_created","tweet":"Kerry: \"China is investing more in Africa than we are.... we ought to recognize where our future economic interests.. may lie.\"","date":"Wed Apr 17 09:35:56 MDT 2013"},{"aspect":"self_created","tweet":"Kerry on North Korea: \"That's the key. To work with the Chinese to change the equation that has had a bad repetition syndrome.\"","date":"Wed Apr 17 09:05:18 MDT 2013"},{"aspect":"self_created","tweet":"Kerry on if US will recognize Maduro as Venezuela pres. \"I can't give you a yes or no answer on that. We think there ought to be a recount.\"","date":"Wed Apr 17 09:03:57 MDT 2013"},{"aspect":"self_created","tweet":"Benghazi is very much still on the minds of many Republicans on the House Foreign Affairs Committee, as they question Kerry.","date":"Wed Apr 17 08:53:00 MDT 2013"},{"aspect":"self_created","tweet":"On  Benghazi, Rep. Rohrabacher, refers to \"Secretary of State Hillary\" - not Clinton - says doesn't think she was \"honestly cooperative.'","date":"Wed Apr 17 08:52:04 MDT 2013"},{"aspect":"self_created","tweet":"Kerry Boston: \"Whether it's homegrown, or foreign, we just don't know yet. And so I'm not going to contribute to any speculation on that.\"","date":"Wed Apr 17 08:45:53 MDT 2013"},{"aspect":"self_created","tweet":"On North Korea, Kerry says Dempsey is flying to China in the coming days.","date":"Wed Apr 17 08:20:35 MDT 2013"},{"aspect":"self_created","tweet":"Kerry on Israel and the Palestinians - thinks the window for a two-state solution is closing.","date":"Wed Apr 17 08:17:48 MDT 2013"},{"aspect":"self_created","tweet":"Kerry says he is flying to Istanbul on Saturday for a #Syria meeting that he will be 'very important.'","date":"Wed Apr 17 08:17:06 MDT 2013"},{"aspect":"self_created","tweet":"Kerry: friend's granddaughter fights to keep legs \"Boston is not going to be intimidated by this but we're going to find out who did this.\"","date":"Wed Apr 17 07:53:40 MDT 2013"},{"aspect":"self_created","tweet":"Kerry, emotional about Boston, says: \"It's impossible for me to express my sadness and my anger, frankly, over those terrible events. \"","date":"Wed Apr 17 07:52:04 MDT 2013"},{"aspect":"self_created","tweet":"Kerry testifies to the House Foreign Affairs committee, first time as SecState. http://t.co/5jS1PbLtrS","date":"Wed Apr 17 07:37:54 MDT 2013"},{"aspect":"self_created","tweet":"John Kerry, who is from Boston, begins his first testimony on the Hill as Secretary of State by expressing grief, anger.","date":"Wed Apr 17 07:34:33 MDT 2013"},{"aspect":"self_created","tweet":"@AntDeRosa pictures!","date":"Tue Apr 16 21:15:20 MDT 2013"},{"aspect":"self_created","tweet":"Ricin in the Senate a day after the Boston blasts? http://t.co/aE15wC1ScB","date":"Tue Apr 16 21:07:17 MDT 2013"},{"aspect":"self_created","tweet":"Two possibles for explosive devices: 1 cellphone way to detonate this. The 2nd wld be pressure cooker with a timer on it, McCaul says.","date":"Tue Apr 16 15:39:42 MDT 2013"},{"aspect":"self_created","tweet":"Michael McCaul, chairman of House Homeland Security Committee, says evidence is being reviewed at Quantico, expects results in couple days.","date":"Tue Apr 16 15:36:49 MDT 2013"},{"aspect":"self_created","tweet":"Chambliss, top R on Senate Intell: Lot of things surrounding this wld give indication may have been domestic terrorist, but can’t be assumed","date":"Tue Apr 16 15:11:16 MDT 2013"},{"aspect":"self_created","tweet":"RT @ChrisCate: Questions about whether @marcorubio can be on FL ballot for Senate & Prez in 2016 are picking up from national media. ...","date":"Tue Apr 16 15:04:02 MDT 2013"},{"aspect":"self_created","tweet":"Miracles follow tragedy MT “@AlexJamesFitz: 26,000+ people \"liked\" @Yankees FB post showing stadium w/Red Sox logo http://t.co/Xv9VNxF1R6”","date":"Tue Apr 16 15:01:16 MDT 2013"},{"aspect":"self_created","tweet":"Congress getting briefed on Boston. So far they've been told there is nothing new, no suspects, no idea if domestic or intl. V early days.","date":"Tue Apr 16 14:50:44 MDT 2013"},{"aspect":"self_created","tweet":"The Director if National Intelligence, James Clapper, is briefing the Senate Intelligence Committee. The hearing is not open to the press.","date":"Tue Apr 16 12:37:24 MDT 2013"},{"aspect":"self_created","tweet":"Gabby Giffords and her husband just went into the Democratic Senate lunch with Joe Manchin - co-sponsor of the background check bill.","date":"Tue Apr 16 11:20:30 MDT 2013"},{"aspect":"self_created","tweet":"Was that statement at least partly about Obama using the word terrorism - re Boston?","date":"Tue Apr 16 09:41:12 MDT 2013"},{"aspect":"self_created","tweet":"Obama is delivering a statement at the White House around 11:30 a.m.","date":"Tue Apr 16 09:03:59 MDT 2013"},{"aspect":"self_created","tweet":"And a sad anniversary - Virginia Tech mass shooting was six years ago today.","date":"Tue Apr 16 08:47:00 MDT 2013"},{"aspect":"self_created","tweet":"It's Emancipation Day - a holiday in Washington, D.C. There's extra security around the parade.","date":"Tue Apr 16 08:43:54 MDT 2013"},{"aspect":"self_created","tweet":"Dunford: \"There is a growing sense that Dec. 2014 is a cliff for the Afghan people.\"","date":"Tue Apr 16 07:52:35 MDT 2013"},{"aspect":"self_created","tweet":"US Senator Levin: greatest challenge to Afghan security isn't Taliban, but Pakistan-based sanctuaries for militant extremists.","date":"Tue Apr 16 07:42:53 MDT 2013"},{"aspect":"self_created","tweet":"Sen. Levin, Armed Services chair, starts hearing on Afghanistan by reflecting on Boston. Says perpetrators will feel full weight of justice.","date":"Tue Apr 16 07:39:20 MDT 2013"},{"aspect":"self_created","tweet":"Iran hit by biggest quake in 40 years, hundreds feared dead. http://t.co/XvGmVUMGDT","date":"Tue Apr 16 06:47:50 MDT 2013"},{"aspect":"self_created","tweet":"RT @Reuters: Magnitude 8 earthquake strikes Iran: USGS #breaking","date":"Tue Apr 16 04:59:53 MDT 2013"},{"aspect":"self_created","tweet":"RT @MenInBlazers: At the end of the storm\nIs a golden sky\nAnd the sweet silver song of a lark.","date":"Mon Apr 15 20:50:19 MDT 2013"},{"aspect":"self_created","tweet":"RT @MenInBlazers: When you walk through a storm\nKeep your chin up high\nAnd don't be afraid of the dark","date":"Mon Apr 15 20:50:14 MDT 2013"},{"aspect":"self_created","tweet":"Note her column on the Norway shootings MT “@Jezebel: Did WaPo's J. Rubin use Boston to make a point about abortion? http://t.co/DOFZTsR2uU”","date":"Mon Apr 15 20:41:21 MDT 2013"},{"aspect":"self_created","tweet":"Reminded that Boston Mayor Menino, just had leg surgery, recently announced he would not run for re-election. Now this.","date":"Mon Apr 15 20:35:23 MDT 2013"},{"aspect":"self_created","tweet":"Yes, re the false Boston cellphone shutdown report - we were suspicious because our colleagues cellphones were working... Yikes.","date":"Mon Apr 15 20:18:17 MDT 2013"},{"aspect":"self_created","tweet":"Wondered about that RT “@mckaycoppins: RT @AP: IRS: Boston-area taxpayers will get extensions on filing taxes: http://t.co/6jqIb78mCI  -CC”","date":"Mon Apr 15 20:12:55 MDT 2013"},{"aspect":"self_created","tweet":"@brian_tracey @ledbetreuters I don't even know what that was about. Glad you're happy, though.","date":"Mon Apr 15 20:10:51 MDT 2013"},{"aspect":"self_created","tweet":"Interesting question RT “@daveweigel: Did the \"false flag\" dude think he'd show up at the presser and Deval would say \"D'oh! Ya got me!\"”","date":"Mon Apr 15 20:06:28 MDT 2013"},{"aspect":"self_created","tweet":"RT @katierosman: NY ‚ù§ Boston\nhttp://t.co/TQnWBQ9HPO","date":"Mon Apr 15 20:03:25 MDT 2013"},{"aspect":"self_created","tweet":"RT @allthingsct: hats off to bomb techs, forensics et al. unsung heroes of many CT investigations.& probably one of the best hopes f ...","date":"Mon Apr 15 19:43:28 MDT 2013"},{"aspect":"self_created","tweet":"Yikes RT “@Deadspin: The very first question at the governor's press conference: Was this a \"false flag attack?\" http://t.co/1dWrItEIXZ”","date":"Mon Apr 15 19:36:21 MDT 2013"},{"aspect":"self_created","tweet":"RT @jonswaine: Sen. Warren just off plane at DCA when heard. Tried calling relatives who had run in past. But had 617 cell, was jammed.  ...","date":"Mon Apr 15 19:32:09 MDT 2013"},{"aspect":"self_created","tweet":"US flags back at half-staff. http://t.co/B9uN6w0ynU","date":"Mon Apr 15 18:03:27 MDT 2013"},{"aspect":"self_created","tweet":"President Obama will welcome President Park Geun-hye of the Republic of Korea to the White House on May 7.","date":"Mon Apr 15 17:44:20 MDT 2013"},{"aspect":"self_created","tweet":"OK - journalists, today is not about your marathon times. Please.","date":"Mon Apr 15 17:29:11 MDT 2013"},{"aspect":"self_created","tweet":"Separately, Obama announces who goes to Thatcher's funeral. Former Secretaries of State George Shultz and James Baker lead the delegation.","date":"Mon Apr 15 17:18:59 MDT 2013"},{"aspect":"self_created","tweet":"After Capuano speaks, Boehner calls the House to observe a moment of silence to honor today's victims in Boston.","date":"Mon Apr 15 17:00:46 MDT 2013"},{"aspect":"self_created","tweet":"Rep. Capuano of Massachusetts on the House floor, notes what happened in Boston today: \"Whatever it was, it was a terrible tragedy.\"","date":"Mon Apr 15 16:59:11 MDT 2013"},{"aspect":"self_created","tweet":"RT @daveweigel: RT @kasie: Whoever planned the attack - they did it with modern media in mind. So many cameras trained right on the victims.","date":"Mon Apr 15 16:47:32 MDT 2013"},{"aspect":"self_created","tweet":"Obama: \"I'm supremely confident that Bostonians will pull together, take care of each other, and move forward as one proud city.\"","date":"Mon Apr 15 16:44:24 MDT 2013"},{"aspect":"self_created","tweet":"If these reports are true that one person killed was a child, it sadly makes sense - a small person would be more vulnerable to a blast.","date":"Mon Apr 15 16:41:54 MDT 2013"},{"aspect":"self_created","tweet":"Boehner: This is a terrible day for all Americans, but we will carry on in the American spirit, and come together with grace and strength.”","date":"Mon Apr 15 16:37:51 MDT 2013"},{"aspect":"self_created","tweet":"The administration is being careful not to use the word \"terrorism.\" Can't say the same of legislators here on Capitol Hill.","date":"Mon Apr 15 16:35:42 MDT 2013"},{"aspect":"self_created","tweet":"House Speaker Boehner spoke to the President around 5:30 today about the tragedy in Boston.","date":"Mon Apr 15 16:21:54 MDT 2013"},{"aspect":"self_created","tweet":"Feinstein calls the Boston attack \"diabolical,\" notes not known if carried out by domestic or foreign actors. Says rpt about Saudi untrue.","date":"Mon Apr 15 16:21:03 MDT 2013"},{"aspect":"self_created","tweet":"Speaker Boehner says he expects to lead a moment of silence in the House of Representatives around 6:30 for the Boston victims.","date":"Mon Apr 15 15:46:17 MDT 2013"},{"aspect":"self_created","tweet":"Obama will address the nation shortly after 6 about Boston.","date":"Mon Apr 15 15:45:17 MDT 2013"},{"aspect":"self_created","tweet":"The U.S. Senate just had a moment of silence for Boston.","date":"Mon Apr 15 15:40:05 MDT 2013"},{"aspect":"self_created","tweet":"White House says Obama was briefed by FBI Director Mueller and DHS Sec Napolitano on Boston.","date":"Mon Apr 15 15:27:56 MDT 2013"},{"aspect":"self_created","tweet":"Gun control group has postponed 4/16 event to tie in 6th anniversary of Virginia Tech shootings by delivering caskets to NRA lobbyists.","date":"Mon Apr 15 15:19:43 MDT 2013"},{"aspect":"self_created","tweet":"The problem with these reports that cellphone service has been shut down? Colleagues in Boston say theirs are working.","date":"Mon Apr 15 15:16:42 MDT 2013"},{"aspect":"self_created","tweet":"I thought my email was down - but realized it was because I wasn't getting the usual flood of political commentary.","date":"Mon Apr 15 15:14:42 MDT 2013"},{"aspect":"self_created","tweet":"+10 MT “@greenhousenyt: You have to admire first responders. They run towards the danger, not away from it. https://t.co/uBLBOzmv6d”","date":"Mon Apr 15 14:30:39 MDT 2013"},{"aspect":"self_created","tweet":"WH official: Obama notified. Administration in contact with state and local authorities, providing assistance in investigation and response","date":"Mon Apr 15 14:00:18 MDT 2013"},{"aspect":"self_created","tweet":"I note that only because in Virginia especially, we have been remembering April 16. Hearts go out to Boston.","date":"Mon Apr 15 13:58:42 MDT 2013"},{"aspect":"self_created","tweet":"Someone asked about the date - Patriots Day, Tax Day. Also Virginia Tech 4/16, Oklahoma City 4/19, Columbine 4/20, Boston 4/15.","date":"Mon Apr 15 13:56:25 MDT 2013"},{"aspect":"self_created","tweet":"This is just so sad.","date":"Mon Apr 15 13:33:52 MDT 2013"},{"aspect":"self_created","tweet":"\"All I want is to see my family again and to start a family of my  own.\" http://t.co/ApQC3QoGlx","date":"Mon Apr 15 12:52:04 MDT 2013"},{"aspect":"self_created","tweet":"Kinda fits with being brought down by the Tea Party? Queen has given former Sen Lugar the rank of Knight Commander of the British Empire.","date":"Mon Apr 15 10:41:55 MDT 2013"},{"aspect":"self_created","tweet":"RT @MustReadTexas: NEWS: TT: Bob Perry, Prolific GOP Donor, Dead at 80 -- http://t.co/qF0y1MxtBq #txlege #txgop","date":"Sun Apr 14 20:46:26 MDT 2013"},{"aspect":"self_created","tweet":"RT @jonathanweisman: Susan Collins, eyes blazing, complained about attack ads facing at home from gun-rts grp w ties to Rand Paul.  http ...","date":"Sun Apr 14 19:49:55 MDT 2013"},{"aspect":"self_created","tweet":"I thought the giant flying cockroaches (Palmetto bugs) were bad RT “@ReformedBroker: Florida freaks me out.  http://t.co/JLP4m54pXt”","date":"Sun Apr 14 18:31:37 MDT 2013"},{"aspect":"self_created","tweet":"RT @edatpost: Ex-Rep. Charlie Wilson (D-Ohio) died Sunday at age 70 at a Florida hospital after complications from a Feb. stroke, accd t ...","date":"Sun Apr 14 15:55:35 MDT 2013"},{"aspect":"self_created","tweet":"Frown MT “@SoccerInsider: Nats pitcher Gonzalez attends D.C. United loss last night, gets pummeled by Braves today. Coincidence? Think not”","date":"Sun Apr 14 15:55:20 MDT 2013"},{"aspect":"self_created","tweet":"RT @BuzzFeedAndrew: Idiot Florida police sergeant fired for brining Trayvon Martin shooting targets to a firearms training session. http ...","date":"Sun Apr 14 15:53:17 MDT 2013"},{"aspect":"self_created","tweet":"Yikes RT “@ArletteSaenz: RT @darrenrovell Fan at the @NRA sponsored NASCAR race kills himself with a gun http://t.co/9ynqhIpqzw”","date":"Sun Apr 14 15:32:50 MDT 2013"},{"aspect":"self_created","tweet":"Joan of Arc RT “@MonicaHesse: Additional Beliebers: Marie Curie, Jane Austen, Katherine of Siena,”","date":"Sun Apr 14 15:31:29 MDT 2013"},{"aspect":"self_created","tweet":"Politics aside, I taught Sunday school for years, don't remember anything \"Christian\" that included insulting parents of a murdered child.","date":"Sun Apr 14 15:17:39 MDT 2013"},{"aspect":"self_created","tweet":"Kind of fun that the Bush 43 grandchild is a little New Yorker. Happy news!","date":"Sun Apr 14 14:34:31 MDT 2013"},{"aspect":"self_created","tweet":"RT @DanaPerino: Congratulations to the Bush family as granddaughter Mila was welcomed to the world last night! Jenna and Henry Hager are ...","date":"Sun Apr 14 14:29:49 MDT 2013"},{"aspect":"self_created","tweet":"Pope is Argentine. Maybe they'll win everything. MT “@markaugustyn: Argentinian winning the Masters this week would be highly inappropriate”","date":"Sun Apr 14 14:15:37 MDT 2013"},{"aspect":"self_created","tweet":"Wow RT “@Cmdr_Hadfield: An African river perpetually vomiting into the Indian Ocean. http://t.co/zEC1ApmI3h”","date":"Sun Apr 14 12:25:43 MDT 2013"},{"aspect":"self_created","tweet":"Things rarely simple MT “@thegarance:  here's @annanorthtweets in the @Jezebel lady blog on #Gosnell in Jan. 2011 http://t.co/5KDHpR2m4t”","date":"Sun Apr 14 12:21:24 MDT 2013"},{"aspect":"self_created","tweet":"Weiner article got kind of dull. Curious if he runs to compare his fate and Sanford's in SC. Both hurt families, and let constituents down.","date":"Sun Apr 14 10:21:22 MDT 2013"},{"aspect":"self_created","tweet":"Does he mean Newtown? MT “@AriFleischer: @EricBoehlert No sir. The amount of news for Newton was an appropriate frenzy.”","date":"Sat Apr 13 20:13:54 MDT 2013"},{"aspect":"self_created","tweet":"Nats are the coolest team! RT “@GioGonzalez47: Game ready #dcunited #vamosunited!!!‚öΩ‚öæ http://t.co/XJPKvZJFXS”","date":"Sat Apr 13 20:03:26 MDT 2013"},{"aspect":"self_created","tweet":"RT @carolrosenberg: Military: When #Guantanamo troops raided the communal cellblocks, some captives fought back with water bottles fashi ...","date":"Sat Apr 13 19:52:03 MDT 2013"},{"aspect":"self_created","tweet":"This MT “@carolrosenberg Story on #Guantanamo clashes tht set communal camp back to Bush era single-cell confinement http://t.co/RtLkngbqCP”","date":"Sat Apr 13 19:51:52 MDT 2013"},{"aspect":"self_created","tweet":"Misspelled Trayvon also RT “@EricBoehlert: he's now saying that's good thing RT @sueNaustin: @AriFleischer Why wld you call it a \"frenzy\"?”","date":"Sat Apr 13 19:46:47 MDT 2013"},{"aspect":"self_created","tweet":"!!! RT “@capitalweather: Pretty cool...NBA's LeBron James filed a weather report (flood) in S. Fl today: http://t.co/gdHKp7kRZZ”","date":"Sat Apr 13 19:45:22 MDT 2013"},{"aspect":"self_created","tweet":"Won't work as human shield for Pyongyang MT “@Amie_FR: Rodman to return to N. Korea in August via @randomdijit: http://t.co/iRCZB2WoDx”","date":"Sat Apr 13 19:43:59 MDT 2013"},{"aspect":"self_created","tweet":"It was fun to see Henry in person, and DC United games are fun, but I wish #DCU had an attack. http://t.co/i1MGFGdNFy","date":"Sat Apr 13 19:38:01 MDT 2013"},{"aspect":"self_created","tweet":"That's it. RT “@liverpool: Shots on target - Reading 5, Liverpool 15. Off target - Reading 2, Liverpool 11”","date":"Sat Apr 13 09:54:41 MDT 2013"},{"aspect":"self_created","tweet":"Killer. Killer. Killer. #LFC","date":"Sat Apr 13 09:52:08 MDT 2013"},{"aspect":"self_created","tweet":"Just just just #lfc","date":"Sat Apr 13 09:49:41 MDT 2013"},{"aspect":"self_created","tweet":"RT @nukes_of_hazard: Lamborn has no idea what hes talking about re missile defense budget. It adds $ for systems relevant to DPRK missil ...","date":"Sat Apr 13 09:07:22 MDT 2013"},{"aspect":"self_created","tweet":"JAKARTA - All 108 passengers and crew miraculously survive when 737 misses runway on Bali and lands in the sea. http://t.co/phnMBo1xYY","date":"Sat Apr 13 09:02:02 MDT 2013"},{"aspect":"self_created","tweet":"When does Sturridge start feeling cursed? #LFC","date":"Sat Apr 13 08:45:38 MDT 2013"},{"aspect":"self_created","tweet":"RT @NotTooXabi_: You are not Xabi, Studge. Let us be very clear about this. #LFC","date":"Sat Apr 13 08:44:26 MDT 2013"},{"aspect":"self_created","tweet":"@AmandaBecker @lawrencehurley oh, when I was a kid I loved LM Alcott. But my kids loved the Potter. L'Engle maybe too much w/the religious.","date":"Sat Apr 13 08:43:36 MDT 2013"},{"aspect":"self_created","tweet":"Is it me, or does Suarez seem off his game the past few weeks? #LFC","date":"Sat Apr 13 08:33:17 MDT 2013"},{"aspect":"self_created","tweet":"@lawrencehurley But mostly successful. It's a whole theme of the commentariat.","date":"Sat Apr 13 08:26:51 MDT 2013"},{"aspect":"self_created","tweet":"@lawrencehurley Successful woman.","date":"Sat Apr 13 08:25:43 MDT 2013"},{"aspect":"self_created","tweet":"Commentator: Unbelievable that Liverpool have not yet opened their account. I'll say. Kills me that Carra didn't score. #LFC","date":"Sat Apr 13 08:23:42 MDT 2013"},{"aspect":"self_created","tweet":"RT @BenSmithBBC: #LFC banners today include: 'Ding dong the witch is dead' but much more significantly 'justice for the 96, gone but not ...","date":"Sat Apr 13 07:54:24 MDT 2013"},{"aspect":"self_created","tweet":"@lawrencehurley Separately, isn't it part of your cultural identity to have to hate  JK Rowling? :-)","date":"Sat Apr 13 07:53:57 MDT 2013"},{"aspect":"self_created","tweet":"@lawrencehurley sorry no. It's a heinous imbalance, and more women read. Also this: http://t.co/hIgmRl49b7","date":"Sat Apr 13 07:49:40 MDT 2013"},{"aspect":"self_created","tweet":"How many \"disabled vehicles\" blocking roadways are cars that have run out of gas?","date":"Sat Apr 13 07:45:19 MDT 2013"},{"aspect":"self_created","tweet":"Extra-sad - more women read MT “@ilyseh: Why did JK Rowling let people think she was a dude for so long? This graph: http://t.co/DgF2WWhBvF”","date":"Sat Apr 13 07:40:26 MDT 2013"},{"aspect":"self_created","tweet":"RT @dsupervilleap: @whitehouse says Wheeler is the 1st person to deliver the address other than #Obama or #Biden since both took office  ...","date":"Sat Apr 13 06:41:11 MDT 2013"},{"aspect":"self_created","tweet":"Russia bans Americans as tit-for-tat for Magnitzky list. Includes former Cheney CoS, John Yoo, Guantanamo commanders. http://t.co/OAiF1DVu0W","date":"Sat Apr 13 06:40:28 MDT 2013"},{"aspect":"self_created","tweet":"President's weekly address today is not by Obama. It's delivered by Francine Wheeler, whose six year old son, Ben, was murdered in Newtown.","date":"Sat Apr 13 06:26:16 MDT 2013"},{"aspect":"self_created","tweet":"Snowing runs RT “@Mets: #Mets win 16-5!!! 16 runs ties most ever in Interleague game. Had 16 on 6/29/11 at Detroit.”","date":"Fri Apr 12 21:38:43 MDT 2013"},{"aspect":"self_created","tweet":"Could work as a #badbuzzfeedlists ? RT “@margafret: All the girls standing in line for the bathroom http://t.co/MDZ5kTPq6L”","date":"Fri Apr 12 21:30:32 MDT 2013"},{"aspect":"self_created","tweet":"RT @daveweigel: These 19 Gifs Will Restore Your Faith in Pol Pot #BadBuzzFeedLists","date":"Fri Apr 12 21:15:02 MDT 2013"},{"aspect":"self_created","tweet":"RT @daveweigel: 27 Adorable Dogs Who Died Because You Stopped Going to Church #BadBuzzFeedLists","date":"Fri Apr 12 21:14:41 MDT 2013"},{"aspect":"self_created","tweet":"RT @JarrettSkorup: 3 French Hens #BadBuzzFeedLists","date":"Fri Apr 12 21:12:35 MDT 2013"},{"aspect":"self_created","tweet":"Eight golf highlights #badbuzzfeedlists","date":"Fri Apr 12 21:12:05 MDT 2013"},{"aspect":"self_created","tweet":"RT @MattSaccaro: 54 Cats That Might Actually Be Catfish #BadBuzzFeedLists","date":"Fri Apr 12 21:10:54 MDT 2013"},{"aspect":"self_created","tweet":"RT @trevso_electric: 12 Women You Dated Who Were Actually Tyler Perry\n#BadBuzzFeedLists","date":"Fri Apr 12 21:08:19 MDT 2013"},{"aspect":"self_created","tweet":"Whenever I read \"Magnitzky List,\" I find myself thinking \"Maginot Line.\"","date":"Fri Apr 12 20:59:47 MDT 2013"},{"aspect":"self_created","tweet":"RT @pdacosta: Two-bit coins","date":"Fri Apr 12 20:54:48 MDT 2013"},{"aspect":"self_created","tweet":"So, any nice escapist movies out to go see this weekend?","date":"Fri Apr 12 16:21:50 MDT 2013"},{"aspect":"self_created","tweet":"Pink cherry blossom snow. http://t.co/dEZflfwfJr","date":"Fri Apr 12 11:59:36 MDT 2013"},{"aspect":"self_created","tweet":"So Chicago is good at snapping win streaks. Suppose a certain type of team aspires to that kind of thing. #Knicks (I like LeBron too)","date":"Thu Apr 11 21:06:26 MDT 2013"},{"aspect":"self_created","tweet":"Nice face, Boozer.","date":"Thu Apr 11 20:58:24 MDT 2013"},{"aspect":"self_created","tweet":"That wouldn't be a bad @Buzzfeed - regrettable pictures of White House staffers.","date":"Thu Apr 11 20:48:55 MDT 2013"},{"aspect":"self_created","tweet":"Surfboards? MT “@RyanLizza: Don't make me tweet yr beer pong pic MT @jonfavs: Please also tweet pic of you elbows deep in a bag of Cheetos.”","date":"Thu Apr 11 20:44:10 MDT 2013"},{"aspect":"self_created","tweet":"Clapper: N.Korea has not yet demonstrated full range of capabilities necessary for nuclear armed missile. See why he hates open hearings.","date":"Thu Apr 11 20:41:46 MDT 2013"},{"aspect":"self_created","tweet":"RT @mckaycoppins: Politico reports that Marco Rubio is going \"all-in on immigration bill.\" http://t.co/1jXiuIpP78","date":"Thu Apr 11 20:18:08 MDT 2013"},{"aspect":"self_created","tweet":"Can the Bulls kill another winning streak? #Knicks","date":"Thu Apr 11 20:10:26 MDT 2013"},{"aspect":"self_created","tweet":"Heated exchange on Syria between McCain - who wants a no-fly zone - and admin officials, who don't. Ends with McCain walking out mid-answer.","date":"Thu Apr 11 13:46:16 MDT 2013"},{"aspect":"self_created","tweet":"McCain leans over Rubio's chair to speak to him during a Senate Foreign Relations Committee hearing - and all the cameras click.","date":"Thu Apr 11 13:01:30 MDT 2013"},{"aspect":"self_created","tweet":"US Ambassador to Syria Ford: \"There is absolutely an extremism problem in Syria.\"","date":"Thu Apr 11 12:58:03 MDT 2013"},{"aspect":"self_created","tweet":"Dept of understatement: \"The prospects in Syria are not good.\" - Acting Asst Sec of State for Near Eastern Affairs Jones in Senate hearing.","date":"Thu Apr 11 12:46:21 MDT 2013"},{"aspect":"self_created","tweet":"Sen Corker says today's lunch for McCain was the first bipartisan Senate lunch he can remember. (D) Sen Menendez notes: \"And we paid.\"","date":"Thu Apr 11 12:28:30 MDT 2013"},{"aspect":"self_created","tweet":"With all the talk of North Korea, highly recommend the terrific novel, \"The Orphan Master's Son.\"","date":"Thu Apr 11 11:16:35 MDT 2013"},{"aspect":"self_created","tweet":"RT @blakehounshell: got papers from the Treasury / you senators can't handle Z / Fidel is fucking dead to me","date":"Thu Apr 11 11:10:23 MDT 2013"},{"aspect":"self_created","tweet":"This line in email from the RNC: \"Interesting that Jay-Z affirms in his new rap that he received White House clearance\" (for Cuba).","date":"Thu Apr 11 11:08:43 MDT 2013"},{"aspect":"self_created","tweet":"@GDebenedetti Lechery","date":"Thu Apr 11 11:01:56 MDT 2013"},{"aspect":"self_created","tweet":"Senators today having a joint bipartisan lunch honoring the 40th anniversary of Sen McCain’s release from captivity in Vietnam.","date":"Thu Apr 11 10:52:25 MDT 2013"},{"aspect":"self_created","tweet":"Treasury kind of rhymes with leisurely if you pronounce it like a Brit. Or pleasure-y. (Re Jay-Z and his Cuba rap)","date":"Thu Apr 11 10:46:28 MDT 2013"},{"aspect":"self_created","tweet":"US intelligence chiefs tell House committee that China seems frustrated with North Korean belligerence and rhetoric.","date":"Thu Apr 11 08:38:25 MDT 2013"},{"aspect":"self_created","tweet":"House Intell chairman Rogers to Clapper: “I will note for the record that you were dragged kicking and screaming to the committee today.”","date":"Thu Apr 11 08:34:17 MDT 2013"},{"aspect":"self_created","tweet":"James Clapper, the director of national intelligence, starts his testimony at a public hearing by lamenting that this is a public hearing.","date":"Thu Apr 11 08:25:21 MDT 2013"},{"aspect":"self_created","tweet":"Weeping cherry. http://t.co/thUSCbsh9h","date":"Thu Apr 11 06:05:47 MDT 2013"},{"aspect":"self_created","tweet":"Bright DC morning http://t.co/B6LMBcOiy9","date":"Thu Apr 11 06:00:38 MDT 2013"},{"aspect":"self_created","tweet":"One of least known facts  MT “You know @StateDept, @USAID budgets are just over 1% of US fed budget? http://t.co/oZtP4PRfkR #2014Budget”","date":"Wed Apr 10 13:33:37 MDT 2013"},{"aspect":"self_created","tweet":"Or use Rodman as a human shield. RT “@BarbaraDemick: Stay Cool. Call North Korea’s Bluff. http://t.co/hTwT6KZdiP”","date":"Tue Apr 09 21:24:56 MDT 2013"},{"aspect":"self_created","tweet":"Had an idea for dealing with North Korea: Send Dennis Rodman to Seoul - or Tokyo or Austin - as a human shield.","date":"Tue Apr 09 21:22:40 MDT 2013"},{"aspect":"self_created","tweet":"Great story! RT “@erinscafe: ICYMI, I told this story last night. It's graphic, but it's okay to laugh. http://t.co/VsRiWSKTod”","date":"Tue Apr 09 21:15:46 MDT 2013"},{"aspect":"self_created","tweet":"Wow, the Knicks won their 13th in a row and clinched the division.","date":"Tue Apr 09 20:04:58 MDT 2013"},{"aspect":"self_created","tweet":"RT @EricBoehlert: 4 yr old in NJ retrieves family .22 caliber rifle from house, shoots and kills 6 yr old playmate; http://t.co/IMOnEvEkOw","date":"Tue Apr 09 19:48:09 MDT 2013"},{"aspect":"self_created","tweet":"RT @BuzzFeedAndrew: American Bridge says this wasn't them. http://t.co/faEsapJrww","date":"Tue Apr 09 19:30:47 MDT 2013"},{"aspect":"self_created","tweet":"I'm only watching Saturday Night Live now - I missed the Marco .... Rubio .... Marco .... Rubio bit.","date":"Tue Apr 09 19:11:35 MDT 2013"},{"aspect":"self_created","tweet":"Not journalism? RT “@thinkprogress: The 10 jobs with the biggest gender wage gap #equalpayday http://t.co/PAx3M5734N #icymi”","date":"Tue Apr 09 19:09:26 MDT 2013"},{"aspect":"self_created","tweet":"DC sunset. http://t.co/Xndvu5Wl8E","date":"Tue Apr 09 17:28:20 MDT 2013"},{"aspect":"self_created","tweet":"Rules for if it's legal to tape a conversation vary by state (something all journos should know). In DC u can record yr calls w/out telling.","date":"Tue Apr 09 14:42:22 MDT 2013"},{"aspect":"self_created","tweet":"Very happy Sen. Mitch McConnell starts  remarks on Senate floor by congratulating Louisville - and Ware. And then moves to Thatcher.","date":"Tue Apr 09 08:22:14 MDT 2013"},{"aspect":"self_created","tweet":"Today is Pay Equity Day - marks # of extra days into 2013 avg woman must work to earn as much as avg man paid in 2012 http://t.co/qcfahtGown","date":"Tue Apr 09 08:17:38 MDT 2013"},{"aspect":"self_created","tweet":"Yes RT “@DukeStJournal: And the day on Twitter comes full circle RT @ReutersZengerle: Margaret Thatcher visited Louisville on Oct 19, 1998.”","date":"Mon Apr 08 22:20:23 MDT 2013"},{"aspect":"self_created","tweet":"Margaret Thatcher visited Louisville on Oct 19, 1998.","date":"Mon Apr 08 22:16:32 MDT 2013"},{"aspect":"self_created","tweet":"Louisville wins. Somewhere, Margaret Thatcher is smiling. #ncaachampionship","date":"Mon Apr 08 22:09:09 MDT 2013"},{"aspect":"self_created","tweet":"Official scissors of the NCAA are dull RT “@erinscafe: omg are you kidding me? I could cut this thing down in two seconds.”","date":"Mon Apr 08 22:07:38 MDT 2013"},{"aspect":"self_created","tweet":"Wins @StewSays MT “@meredithshiner: Dateline in statement is one giant @McConnellPress #humblebrag. #basketball http://t.co/QdGAG0KeGn”","date":"Mon Apr 08 22:05:33 MDT 2013"},{"aspect":"self_created","tweet":"RT @FordOConnell: Humor alert...RT @RalstonReports: McConnell announces he will bring Cards on Senate floor to help with gun filibuster.","date":"Mon Apr 08 22:02:28 MDT 2013"},{"aspect":"self_created","tweet":"RT @timothypmurphy: Winner. RT @lizzieohreally: Michigan: where the 3s are all the right height.","date":"Mon Apr 08 20:50:13 MDT 2013"},{"aspect":"self_created","tweet":"Ah. Viagra spot - \"See our ad in Golf magazine.\"","date":"Mon Apr 08 20:48:27 MDT 2013"},{"aspect":"self_created","tweet":"It's always a good day when we beat the Phillies MT  “@TheMetsFanClub: Final Score: Mets 7 Phillies 2 http://t.co/rjlNRvhZp7”","date":"Mon Apr 08 20:34:38 MDT 2013"},{"aspect":"self_created","tweet":"Rubio issues stmt over reports Obama Administration \"not properly enforcing U.S. law banning American tourism to Cuba.\" #beyonce","date":"Mon Apr 08 19:54:17 MDT 2013"},{"aspect":"self_created","tweet":"Too bad @IanDarkeESPN can't announce this game. #ncaachampionship","date":"Mon Apr 08 19:41:01 MDT 2013"},{"aspect":"self_created","tweet":"The yellow and white uniforms are so bright and springlike. #ncaachampionship","date":"Mon Apr 08 19:32:27 MDT 2013"},{"aspect":"self_created","tweet":"Michigan has a Canadian starter!!","date":"Mon Apr 08 19:26:14 MDT 2013"},{"aspect":"self_created","tweet":"Leesburg, Virginia RT “@HuffPostPol: Restaurant offers discount to gun-toting customers http://t.co/12DXITREI3”","date":"Mon Apr 08 19:22:00 MDT 2013"},{"aspect":"self_created","tweet":". @PatriciaFausser just enjoying spring after the endless winter.","date":"Mon Apr 08 19:06:00 MDT 2013"},{"aspect":"self_created","tweet":"Immigration: Given that tech workers take jobs Americans want and ag workers do jobs they don't, why favor tech workers?","date":"Mon Apr 08 17:44:44 MDT 2013"},{"aspect":"self_created","tweet":"I took a picture of these trees three days ago; there were no leaves. http://t.co/mJKWm7lDbD","date":"Mon Apr 08 17:00:32 MDT 2013"},{"aspect":"self_created","tweet":"What's pink and symbolizes DC? A politician's tongue (also a blooming cherry tree) http://t.co/XRAUty6L55","date":"Mon Apr 08 16:53:09 MDT 2013"},{"aspect":"self_created","tweet":"Yikes MT “@Jezebel: Flaunt Magazine throwing a Guantanamo-themed Coachella party, featuring a water boarding joke. http://t.co/c9YBPQp8HC”","date":"Mon Apr 08 16:41:10 MDT 2013"},{"aspect":"self_created","tweet":"Durbin is now remembering Roger Ebert on the Senate floor - for his movie criticism and \"deep sense of social justice.\"","date":"Mon Apr 08 16:33:07 MDT 2013"},{"aspect":"self_created","tweet":"Sen. Durbin is the Senate floor reading a tribute to Anne Smedinghoff, young State Department staffer killed in Afghanistan.","date":"Mon Apr 08 16:30:58 MDT 2013"},{"aspect":"self_created","tweet":"How many thought- a grandchild! (It's not) MT “@johnpodesta: Big news from Bill, Hillary,Chelsea Clinton Foundation. http://t.co/ZodKCu4Qx3”","date":"Mon Apr 08 15:33:56 MDT 2013"},{"aspect":"self_created","tweet":"RT @JessicaValenti: Am I the only one who hopes that Brad Paisley and LL Cool J are more than friends? Because that would maybe explain  ...","date":"Mon Apr 08 15:23:55 MDT 2013"},{"aspect":"self_created","tweet":"Biden says he was in Thatcher's company \"numerous times\" as PM, \"and she was always forthright in her views.\" - can imagine.","date":"Mon Apr 08 15:19:04 MDT 2013"},{"aspect":"self_created","tweet":"Uh-oh. @ChuckGrassley tells ISU public relations class \"Study hard and don't tweet anything I wld not.\"","date":"Mon Apr 08 15:12:29 MDT 2013"},{"aspect":"self_created","tweet":"Landrieu of Louisiana. Pryor of Arkansas and Manchin of West Virginia are the three Senate Democrats not backing gay marriage.","date":"Mon Apr 08 14:42:53 MDT 2013"},{"aspect":"self_created","tweet":"@GDebenedetti 1-1, wouldn't blame him.","date":"Mon Apr 08 14:35:36 MDT 2013"},{"aspect":"self_created","tweet":"Tim Johnson - D-SD - now supports same-sex marriage. Which Senate Democrat will be the last?","date":"Mon Apr 08 14:34:19 MDT 2013"},{"aspect":"self_created","tweet":"Someone in the hall outside the House of Representatives is whistling, \"Ole, Ole, Ole, Ole, O-lay, O-lay.\"","date":"Mon Apr 08 14:29:33 MDT 2013"},{"aspect":"self_created","tweet":"47% MT “@pollreport: Way Obama handling job as president: Approve 51% / Disapprove 47% (CNN/ORC Poll, 4/5-7) http://t.co/awbxOPwjcE”","date":"Mon Apr 08 14:03:02 MDT 2013"},{"aspect":"self_created","tweet":"Justin Timberlake will be among the musicians at the White House for Memphis Soul Night on Tuesday.","date":"Mon Apr 08 13:33:59 MDT 2013"},{"aspect":"self_created","tweet":"Anti-hunger groups like new US food aid plan; companies & big agriculture don't. http://t.co/4pvnNabPpm","date":"Mon Apr 08 09:32:39 MDT 2013"},{"aspect":"self_created","tweet":"Wonder who from the US will attend Thatcher's funeral.","date":"Mon Apr 08 09:04:56 MDT 2013"},{"aspect":"self_created","tweet":"Interesting to see reax to Thatcher - some praise her for promoting freedom, others for conservativism, some for breaking glass ceiling.","date":"Mon Apr 08 08:53:49 MDT 2013"},{"aspect":"self_created","tweet":"Boehner also said Thatcher established conservative principles in Western Europe and brought down the Iron Curtain.","date":"Mon Apr 08 08:28:25 MDT 2013"},{"aspect":"self_created","tweet":"Boehner: Thatcher...stared down elites, union bosses, and communists to win three consecutive elections.","date":"Mon Apr 08 08:27:14 MDT 2013"},{"aspect":"self_created","tweet":"Obama: As grocer’s daughter who rose to become UK’s first female PM, she stands as example there is no glass ceiling that can’t be shattered","date":"Mon Apr 08 08:17:35 MDT 2013"},{"aspect":"self_created","tweet":"(Male) commentators, try to control yourselves and not describe Thatcher as crazed. Newsflash: every woman in public life isn't.","date":"Mon Apr 08 07:46:30 MDT 2013"},{"aspect":"self_created","tweet":"Thatcher: lived in London, kids used to idea UK had had woman PM. Remember breaking it to my daughter that US had had no woman president.","date":"Mon Apr 08 06:21:23 MDT 2013"},{"aspect":"self_created","tweet":"RT @ReutersMariS: Just filed a story showing how for the first time, #Tepco admitted that it may run out of storage space for the contam ...","date":"Mon Apr 08 05:27:27 MDT 2013"},{"aspect":"self_created","tweet":"No words RT “@60Minutes: How do they go on? Mark Barden: “I think about Daniel every minute of the day, every waking hour.” #60Minutes”","date":"Sun Apr 07 17:39:46 MDT 2013"},{"aspect":"self_created","tweet":"Wow! MT “@nyknicks: 12 straight for  #Knicks! NY takes down defending Western Conference champs 125-120 in OKC. Melo w/ 36, Smith w/ 22.”","date":"Sun Apr 07 15:08:38 MDT 2013"},{"aspect":"self_created","tweet":"How many working full time? MT “@LaurenYoung: 1960, 5% US doctors, lawyers were women. Now 1/3 of those professions. http://t.co/cHD0HihldL”","date":"Sun Apr 07 09:45:47 MDT 2013"},{"aspect":"self_created","tweet":"Think a lot if women are desperate for Clinton to run in 2016. Wouldn't call it buyers' remorse over O, but def many \"if only's\"","date":"Sun Apr 07 09:36:42 MDT 2013"},{"aspect":"self_created","tweet":"Probably, alas, Collins for West Ham. And Agger for #LFC","date":"Sun Apr 07 08:32:24 MDT 2013"},{"aspect":"self_created","tweet":"That was a killer. #LFC","date":"Sun Apr 07 08:25:41 MDT 2013"},{"aspect":"self_created","tweet":"So how much does this Fox Soccer commentator hate Liverpool? #LFC","date":"Sun Apr 07 07:43:19 MDT 2013"},{"aspect":"self_created","tweet":"Grateful nation MT “@londonoe Sharing statement from fallen US diplomat Anne Smedinghoff's parents, Tom & Mary Beth https://t.co/ClXYVH1rvL”","date":"Sat Apr 06 21:56:33 MDT 2013"},{"aspect":"self_created","tweet":"Spectacular RT “@Cmdr_Hadfield: Tonight's Finale: Morning in NYC. Downtown Manhattan casts quite a shadow. http://t.co/QQnPmUjhmc”","date":"Sat Apr 06 17:18:32 MDT 2013"},{"aspect":"self_created","tweet":"Huh RT “@TheBradBlog: Obama co-opted by Ronnie at Reagan Library gift shop! http://t.co/aXWQad4loH”","date":"Sat Apr 06 17:17:21 MDT 2013"},{"aspect":"self_created","tweet":"Sorry to the editor who wanted a story saying tourism in DC is down; you're nuts. http://t.co/B2COYW6Kwr","date":"Sat Apr 06 15:41:03 MDT 2013"},{"aspect":"self_created","tweet":"The cherry blossoms are so not in bloom. But the tourists are out in force. http://t.co/gR1ALeybCO","date":"Sat Apr 06 15:34:32 MDT 2013"},{"aspect":"self_created","tweet":"Amazing MT “@nicolatwilley: Last of 15 women used as Hitler's food tasters tells her story of butter, fruits & rape: http://t.co/hpKeSUFAke”","date":"Sat Apr 06 13:45:34 MDT 2013"},{"aspect":"self_created","tweet":"Scandal! RT “@ABCPolitics: Obama Plays Golf for Second Weekend in a Row http://t.co/P0pMO41FSL”","date":"Sat Apr 06 12:33:14 MDT 2013"},{"aspect":"self_created","tweet":"Thanks RT “@crowleyreport: @ReutersZengerle Older than Romney, younger than McCain.”","date":"Sat Apr 06 11:38:40 MDT 2013"},{"aspect":"self_created","tweet":"If Hillary Clinton were elected president in 2016, would Bill Clinton be the oldest first spouse?","date":"Sat Apr 06 11:38:00 MDT 2013"},{"aspect":"self_created","tweet":"Older than Romney or McCain wld have been? RT “@crowleyreport: If Hillary elected president in 2016 she wld be the 2nd oldest taking oath.”","date":"Sat Apr 06 11:34:06 MDT 2013"},{"aspect":"self_created","tweet":"This makes me very sad RT “@nytimes: Algae Bloom in Florida Kills Record Number of Manatees http://t.co/q63XVBS9mx”","date":"Sat Apr 06 11:32:04 MDT 2013"},{"aspect":"self_created","tweet":"Just read \"Gone Girl.\" Whoa.","date":"Sat Apr 06 10:41:41 MDT 2013"},{"aspect":"self_created","tweet":"Case study RT “@washingtonpost: NRA tactics erode post-Newtown support for gun-control measures http://t.co/W5jNrKsH7R”","date":"Sat Apr 06 08:42:25 MDT 2013"},{"aspect":"self_created","tweet":"Not the Carolina GOP running Sanford MT “@HuffPostPol: N.C. GOP measure wld require 2-yr waiting period for divorce http://t.co/DmoCf1Uzrt”","date":"Fri Apr 05 20:13:38 MDT 2013"},{"aspect":"self_created","tweet":"RT @dcunited: Happy Birthday to @ussoccer, #100 years of soccer! http://t.co/u0ORkd2Gtm #DCU","date":"Fri Apr 05 15:05:44 MDT 2013"},{"aspect":"self_created","tweet":"Is there no end to political correctness? MT “@BloombergLuxury: Swans disappear from German menu after protests | http://t.co/SHf1Jzcp0n”","date":"Fri Apr 05 14:49:50 MDT 2013"},{"aspect":"self_created","tweet":"RT @margafret: Follow Reuters on Instagram! http://t.co/QEXJqKUvkS","date":"Fri Apr 05 14:39:35 MDT 2013"},{"aspect":"self_created","tweet":"Almost sorry I took the day off RT  “@thehill: Colbert pedals through House office building http://t.co/07LpWnjeVG by @JudyKurtz”","date":"Fri Apr 05 14:37:32 MDT 2013"},{"aspect":"self_created","tweet":"Perhaps CNN feels safe bringing back Crossfire because Jon Stewart is taking the summer off.","date":"Fri Apr 05 14:35:29 MDT 2013"},{"aspect":"self_created","tweet":"+2 RT “@AntDeRosa: +1 good luck, Jennifer! RT @jamessaft: #FF right back at you @MerrittJennifer. Will miss you - have fun at the BBC.”","date":"Fri Apr 05 14:28:32 MDT 2013"},{"aspect":"self_created","tweet":"RT @MrDanZak: An asteroid is just one of God's drones. RT @justinjm1: OBAMA WANTS TO CAPTURE AN ASTEROID http://t.co/ub9BrVDiwy","date":"Fri Apr 05 14:25:30 MDT 2013"},{"aspect":"self_created","tweet":"RT @AnupKaphle: A Guam resident on North Korean threat: \"I mean, how many times do we ever trend on Twitter?\" http://t.co/VY5C8GRArq","date":"Fri Apr 05 13:52:31 MDT 2013"},{"aspect":"self_created","tweet":"@ewstephe @gdebenedetti working at the Capitol is like working at Disneyland, though the costumes are different.","date":"Fri Apr 05 13:50:01 MDT 2013"},{"aspect":"self_created","tweet":"There are supposed to be even MORE tourists? MT “@GDebenedetti: Sequestration hits travel — particularly in DC: http://t.co/LFKeZHj8e0”","date":"Fri Apr 05 13:42:06 MDT 2013"},{"aspect":"self_created","tweet":"RT @rollcall: Why Scott Brown Running in NH Is a Really, Really Bad Idea: http://t.co/8qI4ED4JXZ via @StuPolitics","date":"Fri Apr 05 13:37:17 MDT 2013"},{"aspect":"self_created","tweet":"Agree agree agree RT “@AntDeRosa: @ReutersZengerle sounds like Reuters should be doing the same or get left in the dust”","date":"Fri Apr 05 11:34:27 MDT 2013"},{"aspect":"self_created","tweet":"What if you work for Reuters or DJ and Bloomberg puts your twitter feed on its terminals?","date":"Fri Apr 05 11:28:01 MDT 2013"},{"aspect":"self_created","tweet":"Can u block them? MT “@AntDeRosa: More on Bloomberg's Twitter integration, and some of the people they're following http://t.co/E5fJJZRXHb”","date":"Fri Apr 05 11:26:31 MDT 2013"},{"aspect":"self_created","tweet":"RT @anamariecox: Only 2 of these \"journalists we'd love to grab a beer with\" are women, because obv who wants to drink with a girl? http ...","date":"Fri Apr 05 11:22:21 MDT 2013"},{"aspect":"self_created","tweet":"RT @margafret: NYT might have a bot that helps you appreciate ancient forms of poetry, but I have @ReutersRT, a community sharing device ...","date":"Fri Apr 05 09:26:34 MDT 2013"},{"aspect":"self_created","tweet":"RT @GlassCeilingcom: Great article by @LaraMBrownPhD \"How the media creates a glass ceiling for women presidential candidates\" via @usne ...","date":"Fri Apr 05 09:25:50 MDT 2013"},{"aspect":"self_created","tweet":"And in other news, Beyonce and Jay-Z vacationing in Cuba? Illegal under the US embargo, or a cultural exchange under a special visa?","date":"Fri Apr 05 09:07:06 MDT 2013"},{"aspect":"self_created","tweet":"RT @igorvolsky: And then there were 5 Dems (left). 52 Senators now back marriage. RT @samsteinhp: Sen. Heitkamp comes out for gay marriage","date":"Fri Apr 05 08:02:54 MDT 2013"},{"aspect":"self_created","tweet":"RT @HotlineJosh: Heidi Heitkamp just released stmnt announcing support of gay marriage","date":"Fri Apr 05 08:02:46 MDT 2013"},{"aspect":"self_created","tweet":"RT @RichardA: @ReutersZengerle and yet that didn't dissuade Whole Foods either.","date":"Fri Apr 05 08:01:24 MDT 2013"},{"aspect":"self_created","tweet":"RT @SpeakerBoehner: Via @WSJ: 496K people “dropped out of the work force,” 11.7M \"wanted a job but couldn't find one last month\" http:// ...","date":"Fri Apr 05 07:50:18 MDT 2013"},{"aspect":"self_created","tweet":"But they have national healthcare MT “@RichardA: Excellent news: Five Guys burger chain to open branches in the UK  http://t.co/Q0GmTzjwHm”","date":"Fri Apr 05 07:49:25 MDT 2013"},{"aspect":"self_created","tweet":"RT @erinscafe: Dear god. Does anyone not watch Scandal? RT @marionbarryjr: Anybody else watching Scandal?  What a great show!","date":"Thu Apr 04 20:39:39 MDT 2013"},{"aspect":"self_created","tweet":"RT @AlexConant: So good. RT @martigal: Love that Roger Ebert kept entering the New Yorker cartoon caption contest: http://t.co/q1y1XOFqvc","date":"Thu Apr 04 20:38:50 MDT 2013"},{"aspect":"self_created","tweet":"RT @froomkin: It's journalistic malpractice to write about voter ID & not explain how the ostensible motivation is a myth http://t.c ...","date":"Thu Apr 04 12:27:38 MDT 2013"},{"aspect":"self_created","tweet":"Can watch it on his Google glasses RT “@mckaycoppins: Newt Gingrich Loves “Downtown Abbey” http://t.co/Lu5Nx8akSY via @rebeccagberg”","date":"Thu Apr 04 10:09:14 MDT 2013"},{"aspect":"self_created","tweet":"Wait, don't women go there to find husbands? MT “@jeneps 2/3 Pton alumnae MT @neeratanden: Congratulations @SlaughterAM; another woman pres”","date":"Wed Apr 03 21:09:20 MDT 2013"},{"aspect":"self_created","tweet":"RT @LaurenYoung: Wealthy individuals may have as much as $32tn (¬£21tn) stashed in overseas havens. H/T @moorehn","date":"Wed Apr 03 20:11:07 MDT 2013"},{"aspect":"self_created","tweet":"Ducks http://t.co/Cy33HM7cAM","date":"Wed Apr 03 17:03:19 MDT 2013"},{"aspect":"self_created","tweet":"Capitol trees pruned back like a Democrat's defense budget. http://t.co/ITAoxJfNZh","date":"Wed Apr 03 16:49:19 MDT 2013"},{"aspect":"self_created","tweet":"The scaffolding is rising. http://t.co/0JmXsqfOoY","date":"Wed Apr 03 16:48:09 MDT 2013"},{"aspect":"self_created","tweet":"That is an excellent point RT “@EKaiserReuters: or perhaps Peru. Their aim's a bit off: http://t.co/chOPMPjrfR”","date":"Wed Apr 03 16:35:44 MDT 2013"},{"aspect":"self_created","tweet":"And in other news, a pork chop is now a ribeye.http://t.co/qZeD2cZpI5","date":"Wed Apr 03 16:25:19 MDT 2013"},{"aspect":"self_created","tweet":"North Korea says it has ratified a \"merciless\" attack on the United States. Look out Austin.","date":"Wed Apr 03 16:20:51 MDT 2013"},{"aspect":"self_created","tweet":"The US accounts for 30% of arms exports. What chance is there that Washington ratifies the arms treaty? http://t.co/Pc7C26kxdL","date":"Wed Apr 03 16:16:20 MDT 2013"},{"aspect":"self_created","tweet":"Jon Stewart on Marx: \"I think it's exciting that the chairman of the proletariat had a maid in a one-room apartment.\"","date":"Tue Apr 02 21:24:43 MDT 2013"},{"aspect":"self_created","tweet":"Yu can't always get what yu want.","date":"Tue Apr 02 21:07:09 MDT 2013"},{"aspect":"self_created","tweet":"RT @Reuters: North Korea suspends entry to Kaesong industrial zone http://t.co/tChLXbnJmk","date":"Tue Apr 02 21:01:12 MDT 2013"},{"aspect":"self_created","tweet":"At least it was through his own legs and not a hapless shortstop's. And his father's Iranian and mom's Japanese, explaining his name. #yuuu","date":"Tue Apr 02 20:59:47 MDT 2013"},{"aspect":"self_created","tweet":"Yu Darvish is really an incredible name.","date":"Tue Apr 02 20:55:00 MDT 2013"},{"aspect":"self_created","tweet":"It's a South Carolina Republican trend? Remembering that Newt won the primary last year.","date":"Tue Apr 02 20:43:21 MDT 2013"},{"aspect":"self_created","tweet":"To think I just spent a long weekend in Charleston just because I wanted to go. Not for work. Great city!! #SC01","date":"Tue Apr 02 20:40:12 MDT 2013"},{"aspect":"self_created","tweet":"So true MT “@JesseFFerguson: That sound? Every natl reporter cheering that they might now justify expense-paid trip to Charleston. #SC01”","date":"Tue Apr 02 20:38:44 MDT 2013"},{"aspect":"self_created","tweet":"RT @zengerle: Surprised to see Sanford's fiancee on stage w/ his sons. As of a few wks ago, 3 of them hadn't even met her. http://t.co/k ...","date":"Tue Apr 02 20:20:36 MDT 2013"},{"aspect":"self_created","tweet":"RT @EKaiserReuters: Looks like North Korea is letting South Korean workers return home but then suspending entry into Kaesong industrial ...","date":"Tue Apr 02 20:11:10 MDT 2013"},{"aspect":"self_created","tweet":"No @ChrisHarrisKS I was actually kidding. Day-old levity...","date":"Tue Apr 02 14:00:19 MDT 2013"},{"aspect":"self_created","tweet":"So with Biden, Kirk means 51 U.S. Senate votes for gay marriage. Hmm... http://t.co/wWIUYn0ZJd","date":"Tue Apr 02 13:53:32 MDT 2013"},{"aspect":"self_created","tweet":"@ChrisHarrisKS Wasn't the AP stylebook change a leftover April fool joke?","date":"Tue Apr 02 13:48:24 MDT 2013"},{"aspect":"self_created","tweet":"So the UN passed the arms treaty. The U.S. Senate has already voted against it. http://t.co/hwnmm2CZvY","date":"Tue Apr 02 12:18:42 MDT 2013"},{"aspect":"self_created","tweet":"Congrats to @jpaceDC !! Well done!","date":"Tue Apr 02 06:08:14 MDT 2013"},{"aspect":"self_created","tweet":"If gay marriage goes away as a social issue, that leaves abortion as the social issue wedge tool. Expect even more ads and legislation.","date":"Mon Apr 01 20:50:34 MDT 2013"},{"aspect":"self_created","tweet":"Sanford signs in Charleston. Many just black paint on plain background to underscore \"I don't believe in spending\" message.","date":"Mon Apr 01 20:24:11 MDT 2013"},{"aspect":"self_created","tweet":"RT @OHnewsroom: Reporter: “There needs to be a journalist support group. It’s like AA, but for depressed journalists.\" Editor: “It’s cal ...","date":"Mon Apr 01 20:20:15 MDT 2013"},{"aspect":"self_created","tweet":"Cue the White Witch. Going to be in the 30s tomorrow morning in DC. Always winter, never Christmas....","date":"Mon Apr 01 20:18:14 MDT 2013"},{"aspect":"self_created","tweet":"What I learned on Opening Day: How you say Milwaukee Brewers in Spanish - ht/ @LosMets - Los Cerveceros de Milwaukee","date":"Mon Apr 01 20:02:07 MDT 2013"},{"aspect":"self_created","tweet":"Hahahahaha @Jennster9148 @smooochiekins","date":"Mon Apr 01 19:42:51 MDT 2013"},{"aspect":"self_created","tweet":"Um yes. RT “@felixsalmon: “It never occurred to us that this would be read as sexist.” http://t.co/xyWJwxKwPe”","date":"Mon Apr 01 15:21:44 MDT 2013"},{"aspect":"self_created","tweet":"How much was paid to the genius traffic engineer who designed I-95 south of DC?","date":"Mon Apr 01 15:15:29 MDT 2013"},{"aspect":"self_created","tweet":"Oh, I hope they're playing the Phillies RT “@AntDeRosa: Wow, grandslam for Cowgill. Mets up 11-2! #lgm”","date":"Mon Apr 01 13:51:12 MDT 2013"},{"aspect":"self_created","tweet":"+10 RT “@dcbigjohn: Hearing 20 something former reporters bemoan the state of journalism makes me want to light myself on fire”","date":"Mon Apr 01 13:50:23 MDT 2013"},{"aspect":"self_created","tweet":"Would not want to be someone who opted for the office over the ballpark RT “@JohnJHarwood: 2nd at bat, 2nd HR for Harper. unreal. #Natitude”","date":"Mon Apr 01 12:11:12 MDT 2013"},{"aspect":"self_created","tweet":"Lunch. That is all. http://t.co/eIfvlrj44X","date":"Mon Apr 01 10:02:27 MDT 2013"},{"aspect":"self_created","tweet":"ENDORSE RT “@capitalweather: Snow potential index: 0 (‚Üì) Get out of our face, SPI. See you next winter...”","date":"Sun Mar 31 20:18:29 MDT 2013"},{"aspect":"self_created","tweet":"RT @DAonCBS: One of my favorite moments of the NBA season so far is Chris Brown being aggressively jeered & booed by MSG crowd tonig ...","date":"Sun Mar 31 19:31:18 MDT 2013"},{"aspect":"self_created","tweet":"WWJD RT “@HuffPostPol: Google honors Cesar Chavez on Easter, sparking religious backlash http://t.co/nkzicPsTdz”","date":"Sun Mar 31 17:06:44 MDT 2013"},{"aspect":"self_created","tweet":"Amazing Charleston dancing Cupid fountain. http://t.co/efjhnoYvuT","date":"Sun Mar 31 16:36:59 MDT 2013"},{"aspect":"self_created","tweet":"RT @BuzzFeedAndrew: 1960s CIA memo saying using cats for spying would not be practical. http://t.co/5mEGYOYZtQ","date":"Sun Mar 31 16:32:34 MDT 2013"},{"aspect":"self_created","tweet":"Wow MT “@jackshafer: RT @DavidKenner: Rwanda's king is aged 76, 7' 2'', and lives on public assistance in Virginia. http://t.co/u4rgG2WNWM”","date":"Sun Mar 31 16:29:06 MDT 2013"},{"aspect":"self_created","tweet":"Best  MT \"@Cmdr_Hadfield: Full Moon. May not be made of chocolate, but makes for a wonderfully natural Easter egg. http://t.co/yLc7BTe6Pk\"","date":"Sun Mar 31 15:57:33 MDT 2013"},{"aspect":"self_created","tweet":"Happy Easter!","date":"Sun Mar 31 08:12:54 MDT 2013"},{"aspect":"self_created","tweet":"So, so, so worth the drive. DC's unending winter has been grim. http://t.co/ZDYZCqucKX","date":"Sat Mar 30 20:32:11 MDT 2013"},{"aspect":"self_created","tweet":"Charleston sunset bridge. http://t.co/pZ9cI4PP9d","date":"Sat Mar 30 20:30:33 MDT 2013"},{"aspect":"self_created","tweet":"Two Charleston meals today. Fuel - my shrimp tacos were watery (ugh) but awesome setting. Early Bird - my Greek-style ribeye was terrific.","date":"Sat Mar 30 20:24:13 MDT 2013"},{"aspect":"self_created","tweet":"Not often enough RT “@owillis: @ReutersZengerle gore *would* be good. but how often does gore go to the zoo?”","date":"Sat Mar 30 17:30:30 MDT 2013"},{"aspect":"self_created","tweet":"Gore? RT “@owillis: im no fan of newt, but of all the pols, he's probably the best one to get google glasses http://t.co/lB5oOalqmg”","date":"Sat Mar 30 16:38:34 MDT 2013"},{"aspect":"self_created","tweet":"2 biggest names in DC? MT @_JakeRussell: RGIII and President Obama talking shop at the Verizon Center. http://t.co/MolrsUzvlo”","date":"Sat Mar 30 16:35:51 MDT 2013"},{"aspect":"self_created","tweet":"We'll know we're in the South when we see an alligator.","date":"Sat Mar 30 10:01:39 MDT 2013"},{"aspect":"self_created","tweet":"Huh - just passed the Ben Bernanke interchange along I95 in South Carolina. Who knew?","date":"Sat Mar 30 08:52:42 MDT 2013"},{"aspect":"self_created","tweet":"True RT “@lou_reuters: #NorthKorea loves disrupting holidays - North Korea says enters \"state of war\" against South http://t.co/SW84dMtIZH”","date":"Sat Mar 30 08:29:48 MDT 2013"},{"aspect":"self_created","tweet":"@erinscafe Least dickish  team = whoever is playing Duke.","date":"Fri Mar 29 22:45:50 MDT 2013"},{"aspect":"self_created","tweet":"Manatees? MT “@MotherJones: #FGCU is nice, if you're ok w/forced reading of Ayn Rand, extinction of Florida panther: http://t.co/vRD5JmKgoX”","date":"Fri Mar 29 22:39:36 MDT 2013"},{"aspect":"self_created","tweet":"Amash went to FGCU? RT “@BobCusack: Looking forward to Sunday tweet showdown between @repjustinamash and @DWStweets.”","date":"Fri Mar 29 22:37:32 MDT 2013"},{"aspect":"self_created","tweet":"Definitely!! RT “@TwinLogicDC: @politisite  You must try Parker's BBQ while you are in Wilson.  Just order everything family style!  Yummmm”","date":"Fri Mar 29 22:12:22 MDT 2013"},{"aspect":"self_created","tweet":"@jimbassman Coconut cake!","date":"Fri Mar 29 22:10:27 MDT 2013"},{"aspect":"self_created","tweet":"Midnight. Hampton Inn in NC. Seventh in line for check-in, basketball's not even on the TV, and clerk took a phone call....","date":"Fri Mar 29 22:02:48 MDT 2013"},{"aspect":"self_created","tweet":"Me too! Summit RT “@Politisite: @ReutersZengerle that was mostly snark. I am a transplant from Jersey”","date":"Fri Mar 29 21:46:21 MDT 2013"},{"aspect":"self_created","tweet":"Eventually Charleston. Now Wilson, NC RT “@Politisite: @ReutersZengerle oh and the BBQ!  What town are you heading toward?”","date":"Fri Mar 29 21:45:31 MDT 2013"},{"aspect":"self_created","tweet":"RT @erinscafe: @ReutersZengerle \"big\" Weight Watchers spokesman is an interesting phrase","date":"Fri Mar 29 21:43:43 MDT 2013"},{"aspect":"self_created","tweet":"@Politisite Why do you think that would be anti-South? Maybe it's a highlight. Also very excited about Parker BBQ.","date":"Fri Mar 29 21:42:33 MDT 2013"},{"aspect":"self_created","tweet":"You know he's a big Weight Watchers spokesman? RT “@erinscafe: Who is dressing Chuck Barkley?”","date":"Fri Mar 29 21:39:03 MDT 2013"},{"aspect":"self_created","tweet":"RT @David_Ingram: \"Whatever I have done in the past, or may do in the future, #Duke University is responsible in one way or another.\" -  ...","date":"Fri Mar 29 21:29:40 MDT 2013"},{"aspect":"self_created","tweet":"Who is John Galt? RT “@jessmisener: I'm sitting next to my sister who is an FGCU alum, ask her anything”","date":"Fri Mar 29 21:22:42 MDT 2013"},{"aspect":"self_created","tweet":"We've reached Carolina! Passed an anti-evolution bulletin board.","date":"Fri Mar 29 21:21:20 MDT 2013"},{"aspect":"self_created","tweet":"RT @RobGeorge: .@tonyford \"ATLAS DUNKED: THE IMPROBABLE RISE OF THE #FGCU EAGLES\" (Random House, call me!) \n#MarchMadess","date":"Fri Mar 29 21:13:49 MDT 2013"},{"aspect":"self_created","tweet":"Oh dear, are all the Rs now going to be all \"Go FGCU\" because of all the Ayn Rand and Koch Bros. and Ds will be \"Go NYU Violets?\" #NCAA","date":"Fri Mar 29 21:13:34 MDT 2013"},{"aspect":"self_created","tweet":"No, no Sports supposed to be our safe alternative to politics RT “@Brendan_Buck: If you don't like Florida Gulf Coast, I don't like you.”","date":"Fri Mar 29 21:11:35 MDT 2013"},{"aspect":"self_created","tweet":"RT @joshtpm: Only weeks later, success of Rodman shuttle diplomacy seems less clear, more elusive #NewsHourPitches","date":"Fri Mar 29 19:19:15 MDT 2013"},{"aspect":"self_created","tweet":"RT @weeddude: KCNA: North Korea says to enter \"state of war\" against South Korea. (@Reuters)","date":"Fri Mar 29 17:55:55 MDT 2013"},{"aspect":"self_created","tweet":"Also, can you please fill your tanks so we don't have so many \"disabled vehicles?\" #Oy-95","date":"Fri Mar 29 15:57:25 MDT 2013"},{"aspect":"self_created","tweet":"I have to drive south tonight. Can everyone on I95 please stop getting into so many accidents?","date":"Fri Mar 29 15:54:46 MDT 2013"},{"aspect":"self_created","tweet":"Among world's best places RT “@Cmdr_Hadfield: The Florida Keys look especially vulnerable from orbit. http://t.co/sOFEbtg4O1”","date":"Fri Mar 29 14:23:16 MDT 2013"},{"aspect":"self_created","tweet":"RT @daveweigel: MT @repjustinamash: Real threat to traditional marriage & religious liberty is government, not gay couples who love  ...","date":"Fri Mar 29 14:22:10 MDT 2013"},{"aspect":"self_created","tweet":"He has to be told this? RT “@ForeignPolicy: RT @joshrogin White House tells Morsy to quell rape epidemic in Egypt http://t.co/4dnspIZwXn”","date":"Fri Mar 29 14:16:23 MDT 2013"},{"aspect":"self_created","tweet":"Good Friday at a Virginia ABC store. Woman runs - literally -  to a handle of cheap rum, cries out, \"I've missed you so much!\"","date":"Fri Mar 29 13:23:01 MDT 2013"},{"aspect":"self_created","tweet":"I read a lot and I find Goodreads annoying and pointless. Anyone get it?","date":"Fri Mar 29 12:37:59 MDT 2013"},{"aspect":"self_created","tweet":"These hit my inbox right in a row  - Obama proclamation on Cesar Chavez and Priebus statement on Alaska Rep \"Wetbacks\" Young.","date":"Fri Mar 29 12:25:52 MDT 2013"},{"aspect":"self_created","tweet":"RT @nbcwashington: ICYMI: Legendary #Hoyas coach Thompson steps in to keep local Boys & Girls Club running:  http://t.co/OnvV8AF7iT","date":"Fri Mar 29 08:52:02 MDT 2013"},{"aspect":"self_created","tweet":"Beat the Jesuits MT “@EricBoehlert: How The Koch Brothers Use Florida Gulf Coast University To Promote Their Agenda; http://t.co/zNy3HWkgwP”","date":"Fri Mar 29 08:51:22 MDT 2013"},{"aspect":"self_created","tweet":"US papers just don't use \"it has emerged\" sourcing. Also, whoa MT \"@GuardianUS 'Underwear bomber' working for CIA http://t.co/ZujylnfSkC\"","date":"Fri Mar 29 08:48:31 MDT 2013"},{"aspect":"self_created","tweet":"In our world, big news RT “@romenesko: NPR is pulling the plug on \"Talk of the Nation.\" http://t.co/AslnTCbPnQ”","date":"Fri Mar 29 08:22:02 MDT 2013"},{"aspect":"self_created","tweet":"So will Rep Don Young's fundraising now go up? #toocynical?","date":"Thu Mar 28 21:15:18 MDT 2013"},{"aspect":"self_created","tweet":"RT @Timcast: Follow the North Korea situation live blog from Reuters http://t.co/14NRC2h1PZ","date":"Thu Mar 28 21:04:35 MDT 2013"},{"aspect":"self_created","tweet":"RT @lou_reuters: (final update for tonight) #Iran, #NorthKorea, #Syria block UN #armstreaty; U.S. predicts broad support in UNGA vote ht ...","date":"Thu Mar 28 20:41:27 MDT 2013"},{"aspect":"self_created","tweet":"Congrats @mollyesque I enjoyed your work during the campaign.","date":"Thu Mar 28 20:40:50 MDT 2013"},{"aspect":"self_created","tweet":"Boeing CEO observes that Germany has strong unions, high wages and is nonetheless very competitive.","date":"Thu Mar 28 07:17:45 MDT 2013"}]}