{"user_name":"rickungar","user_timeline":[{"aspect":"self_created","tweet":"@louiemontes @zacharyking I don't recall saying he doesn't have the right. I also have the right to call him out for what he is.","date":"Tue Apr 16 04:10:29 MDT 2013"},{"aspect":"self_created","tweet":"RT @ExJon: Protip for Right & Left: If, after a terror attack on Americans, your 1st instinct is to attack other Americans, you have ...","date":"Mon Apr 15 19:35:17 MDT 2013"},{"aspect":"self_created","tweet":"@NYGgto1 Yes, ur holy gun crusade is what is important today-not the people suffering in Boston. good to see u have ur priorities straight.","date":"Mon Apr 15 19:34:11 MDT 2013"},{"aspect":"self_created","tweet":"@HenryHill25401 Good to see you have your priorities straight.","date":"Mon Apr 15 19:33:09 MDT 2013"},{"aspect":"self_created","tweet":"@HenryHill25401 Yes, ur holy gun crusade is what is important to us all today-much more important than the suffering in Boston.","date":"Mon Apr 15 19:32:54 MDT 2013"},{"aspect":"self_created","tweet":"RT @Taleah_Bandeira: If you are in Boston and see a woman with number 8730 on her please tell me where she is! She doesn't speak English ...","date":"Mon Apr 15 19:29:46 MDT 2013"},{"aspect":"self_created","tweet":"@NooneOfan Thanks. They don't make segments available to us unfortunately. But if you are up on a Sat. morning at 11 Eastern, check it out!","date":"Mon Apr 15 19:20:49 MDT 2013"},{"aspect":"self_created","tweet":"@michaelianblack Apparently, and, per the NRA,  the only way to stop bad people with bombs is good people with bombs.","date":"Mon Apr 15 19:19:36 MDT 2013"},{"aspect":"self_created","tweet":"@NooneOfan I get that a lot!!! I understand.","date":"Mon Apr 15 19:16:55 MDT 2013"},{"aspect":"self_created","tweet":"@JimMartin2011 @YDanasmithdutra Right wingers who hate are idiots. Why would you want to mimic the behavior?","date":"Mon Apr 15 19:15:32 MDT 2013"},{"aspect":"self_created","tweet":"@MattiB117 @juliemason @PeteDominick It was. Not a day I'll ever forget.","date":"Mon Apr 15 19:14:56 MDT 2013"},{"aspect":"self_created","tweet":"@YDanasmithdutra @JimMartin2011 All the more reason for someone like me to show up and counter their arguments. So why should James hate me?","date":"Mon Apr 15 19:12:10 MDT 2013"},{"aspect":"self_created","tweet":"@YDanasmithdutra @JimMartin2011 can't remember anymore. I write nearly every day.","date":"Mon Apr 15 19:07:22 MDT 2013"},{"aspect":"self_created","tweet":"@JimMartin2011 @YDanasmithdutra And you, James, are still a hater. Hating doesn't look any better on liberals than it does on right wingers.","date":"Mon Apr 15 19:05:16 MDT 2013"},{"aspect":"self_created","tweet":"@JimMartin2011 @YDanasmithdutra I'm a reg. democrat, one of the most widely read progressive writers in the country, and a dem. strategist.","date":"Mon Apr 15 19:04:30 MDT 2013"},{"aspect":"self_created","tweet":"@YDanasmithdutra @JimMartin2011 Actually, it compared BO's spending to all presidents since Eisenhower. And, yes, I write for Forbes.","date":"Mon Apr 15 19:03:11 MDT 2013"},{"aspect":"self_created","tweet":"@YDanasmithdutra @JimMartin2011 ...show up on Fox and argue from the progressive point of view. How does that make sense?","date":"Mon Apr 15 19:01:47 MDT 2013"},{"aspect":"self_created","tweet":"@YDanasmithdutra @JimMartin2011 As well they should. But that isn't the point, is it? This guys is beating me up for being willing to....","date":"Mon Apr 15 19:01:28 MDT 2013"},{"aspect":"self_created","tweet":"@JimMartin2011 @YDanasmithdutra You know, if you understood what you are talking about you'd be dangerous!","date":"Mon Apr 15 18:54:47 MDT 2013"},{"aspect":"self_created","tweet":"@YDanasmithdutra @JimMartin2011 11am EST every Saturday and throughout the week.","date":"Mon Apr 15 18:53:09 MDT 2013"},{"aspect":"self_created","tweet":"@JimMartin2011 @YDanasmithdutra My side is your side. Stop hating so much! Would u prefer that there were no progressives on Fox to counter?","date":"Mon Apr 15 18:52:25 MDT 2013"},{"aspect":"self_created","tweet":"@JimMartin2011 @YDanasmithdutra You would actually be surprised how many nice people work at Fox. I know you don't believe it but it's true.","date":"Mon Apr 15 18:49:56 MDT 2013"},{"aspect":"self_created","tweet":"@YDanasmithdutra @JimMartin2011 Someone has to go on Fox News to tell our side of the story. Lucky me!!!","date":"Mon Apr 15 18:48:37 MDT 2013"},{"aspect":"self_created","tweet":"Latest reports reveal 5 additional unexploded devices in Boston. Unbelievable.","date":"Mon Apr 15 18:45:15 MDT 2013"},{"aspect":"self_created","tweet":"@YDanasmithdutra Careful! I\"m on Fox News too! He actually is not on Fox much. He really writes for WND-a whack job newspaper.","date":"Mon Apr 15 18:41:24 MDT 2013"},{"aspect":"self_created","tweet":"@22Moone appreciate that.","date":"Mon Apr 15 18:16:09 MDT 2013"},{"aspect":"self_created","tweet":"@StandUpAli To be fair, he really isn't a Fox News guy- just an occasional contributor.","date":"Mon Apr 15 17:57:52 MDT 2013"},{"aspect":"self_created","tweet":"RT @LukeRussert: The Council on American-Islamic Relations calls on Muslims in #Boston to donate blood to \"show of support for the bomb  ...","date":"Mon Apr 15 17:56:20 MDT 2013"},{"aspect":"self_created","tweet":"RT @cnnbrk: Doctors are \"pulling ball-bearings out of people' in the ER, suggesting #bombs were designed to propel shrapnel. http://t.co ...","date":"Mon Apr 15 17:51:57 MDT 2013"},{"aspect":"self_created","tweet":"@bkourdou209 Yes..it's all a conspiracy to 'reach' you. Now go away. There are actually important things happening in the country.","date":"Mon Apr 15 17:45:13 MDT 2013"},{"aspect":"self_created","tweet":"@bkourdou209 A guy says to kill all muslims-then says he's being sarcastic on the day of terrorist attack- and I'm overplaying? Get help.","date":"Mon Apr 15 17:43:20 MDT 2013"},{"aspect":"self_created","tweet":"@bkourdou209 And all you can do is talk about straw men. Grow up.","date":"Mon Apr 15 17:40:07 MDT 2013"},{"aspect":"self_created","tweet":"@bkourdou209 an 8 year old is dead. you find this to be the day for sarasm? Believe it or not, life is not all politics.","date":"Mon Apr 15 17:39:39 MDT 2013"},{"aspect":"self_created","tweet":"@bkourdou209 sigh-only thing more annoying than one who can't just recognize disagreement for what it is -someone who overuses 'straw man'","date":"Mon Apr 15 17:37:36 MDT 2013"},{"aspect":"self_created","tweet":"RT @jljacobson: The police, the EMTs, the firemen/women, the FBI, DOD, and other GOVERNMENT workers and UNION workers who help EVERY DAY ...","date":"Mon Apr 15 17:26:26 MDT 2013"},{"aspect":"self_created","tweet":"@OldSlaughter Because you disagree with my interpretation you assume this is what I am doing? Sad.","date":"Mon Apr 15 17:18:16 MDT 2013"},{"aspect":"self_created","tweet":"@Mohsin421 No. I have many black friends who are conservatives. They are not uncle toms or lap dogs. This guy is just a very sick hater.","date":"Mon Apr 15 17:15:34 MDT 2013"},{"aspect":"self_created","tweet":"@OldSlaughter @NivenJ1 Does today strike you as the time to 'take the piss' out of anyone? An 8 year old is dead. Time for sarcasm?","date":"Mon Apr 15 17:02:31 MDT 2013"},{"aspect":"self_created","tweet":"@Melharith Completely agree.","date":"Mon Apr 15 16:58:49 MDT 2013"},{"aspect":"self_created","tweet":"@erikrush @JackRabbitCafe works for me.","date":"Mon Apr 15 16:54:36 MDT 2013"},{"aspect":"self_created","tweet":"@erikrush All so you can prove some hypothesis u came up with to cover ur ass after your original tweets? Ur a very sick guy.","date":"Mon Apr 15 16:53:46 MDT 2013"},{"aspect":"self_created","tweet":"@erikrush An 8 year old is dead. If you were being sarcastic ( I doubt it) does this really strike u as the moment to do so?","date":"Mon Apr 15 16:53:17 MDT 2013"},{"aspect":"self_created","tweet":"@BluJewEgg @dabernathy89 Where did he say this? And when?","date":"Mon Apr 15 16:42:20 MDT 2013"},{"aspect":"self_created","tweet":"@zacharyking if so, he certainly lacks judgement and taste wouldn't you say? Is this really a time for sarcasm? Wish I believed u are right.","date":"Mon Apr 15 16:41:03 MDT 2013"},{"aspect":"self_created","tweet":"Even more tragic-one of the two confirmed deaths is an 8 year old child.","date":"Mon Apr 15 16:35:16 MDT 2013"},{"aspect":"self_created","tweet":"Congressman Bill Keating reporting that 2 undetonated bombs found,- 1 at hotel and 1 at other unknown location.","date":"Mon Apr 15 16:34:01 MDT 2013"},{"aspect":"self_created","tweet":"@therealmundzy Pete hasn't taken a day off in awhile!! I guest host for him. Often a guest on the show. I'll be doing it alot this summer.","date":"Mon Apr 15 16:06:27 MDT 2013"},{"aspect":"self_created","tweet":"@dabernathy89 While I like when people allow for a generous interpretation, I'm afraid you are off on this one. Read some of what he writes.","date":"Mon Apr 15 16:05:31 MDT 2013"},{"aspect":"self_created","tweet":"@therealmundzy Got it!","date":"Mon Apr 15 16:04:14 MDT 2013"},{"aspect":"self_created","tweet":"@maryfuller777 I have no idea what point you are trying to make.","date":"Mon Apr 15 16:03:28 MDT 2013"},{"aspect":"self_created","tweet":"@therealmundzy me or Erik Rush?","date":"Mon Apr 15 16:02:31 MDT 2013"},{"aspect":"self_created","tweet":"@DogPoundRescue And would this really be the time for such sarcasm? Have you forgotten what happened following 9/11??","date":"Mon Apr 15 16:02:05 MDT 2013"},{"aspect":"self_created","tweet":"@dabernathy89 No. He wasn't. I suggest you read the tweets. I provided you with the link.","date":"Mon Apr 15 16:01:26 MDT 2013"},{"aspect":"self_created","tweet":"OMG. Conservative writer Erik Rush tweets kill all Muslims in response to Boston attack. We are in very big trouble. http://t.co/Qf9DffA4Sx","date":"Mon Apr 15 15:56:34 MDT 2013"},{"aspect":"self_created","tweet":"@tuckahoetommy @daveweigel The latest report is (a) it was unrelated and (b) library reports all staff and visitors safe.","date":"Mon Apr 15 15:47:48 MDT 2013"},{"aspect":"self_created","tweet":"@Killage_Wizard The report was they were guarding person of interest in the hospital. That now corrected.","date":"Mon Apr 15 15:43:57 MDT 2013"},{"aspect":"self_created","tweet":"RT @daveweigel: RT @JFKLibrary: All staff and visitors are safe and accounted for. Thank you.","date":"Mon Apr 15 15:42:58 MDT 2013"},{"aspect":"self_created","tweet":"Police say they have no suspect. Don't know where NYPost is getting its info. Also, JFK library fire unrelated.","date":"Mon Apr 15 15:42:15 MDT 2013"},{"aspect":"self_created","tweet":"RT @JohnFugelsang: Violence is not power, but the absence of power.\n Emerson","date":"Mon Apr 15 15:39:29 MDT 2013"},{"aspect":"self_created","tweet":"RT @thinkprogress: Boston Marathon Google Person Finder: If you're looking for someone or have info about someone http://t.co/BAnEhlnDuX","date":"Mon Apr 15 15:31:39 MDT 2013"},{"aspect":"self_created","tweet":"RT @ahmed: Boston police spox on NY Post story about Saudi suspect: “I don't know where they’re getting their info from” http://t.co/61y ...","date":"Mon Apr 15 15:31:10 MDT 2013"},{"aspect":"self_created","tweet":"RT @sethmnookin: I need video NBC has aired of people being treated at scene on stretchers. Still no word on mother-in-law, but possible ...","date":"Mon Apr 15 15:08:52 MDT 2013"},{"aspect":"self_created","tweet":"RT @PeetaPN12: If you live in or near Boston, they are asking you to visit a hospital and donate blood. they are in desperate need. PLEA ...","date":"Mon Apr 15 14:59:37 MDT 2013"},{"aspect":"self_created","tweet":"RT @dceiver: Two phone numbers:617-635-4500 for families seeking info about loved ones, 1-800-494-TIPS for any eyewitnesses/info","date":"Mon Apr 15 14:57:07 MDT 2013"},{"aspect":"self_created","tweet":"Georgia Governor Refuses To Condemn Continuing Segregation In His State - Forbes http://t.co/RPWDAXHSOn","date":"Mon Apr 15 11:25:55 MDT 2013"},{"aspect":"self_created","tweet":"Like Her Friend Ronald Reagan, Margaret Thatcher Just Wouldn't Cut It In Today's GOP - Forbes http://t.co/6cCq2OQbo6","date":"Sun Apr 14 09:51:02 MDT 2013"},{"aspect":"self_created","tweet":"Obama Budget Checkmates Congressional Republicans Who Refuse To Take 'Yes' For An Answer - Forbes http://t.co/tyPyqO6BQk","date":"Wed Apr 10 08:37:53 MDT 2013"},{"aspect":"self_created","tweet":"@_silversmith It can't be that subjective. You and I don't get to be the judge of who is entitled to protection and who isn't.","date":"Mon Apr 08 11:51:09 MDT 2013"},{"aspect":"self_created","tweet":"@_silversmith You really believe that every judge who sees things differently than you and I are 'bought'?","date":"Mon Apr 08 11:50:29 MDT 2013"},{"aspect":"self_created","tweet":"@_silversmith Every journalist is at risk if the standard is based on what organization they work for","date":"Mon Apr 08 11:49:34 MDT 2013"},{"aspect":"self_created","tweet":"@_silversmith I think you know what I'm saying. And I think you see the point I'm making. This cannot be the way we do things.","date":"Mon Apr 08 11:49:17 MDT 2013"},{"aspect":"self_created","tweet":"@_silversmith I work for Fox. And I report honestly. Am I not entitled to protections?","date":"Mon Apr 08 11:48:20 MDT 2013"},{"aspect":"self_created","tweet":"@_silversmith Just not close to the issue. You are replacing the principle with your own point of view. Very bad road to travel.","date":"Mon Apr 08 11:47:29 MDT 2013"},{"aspect":"self_created","tweet":"@_silversmith How would you feel if a judge decided that MSNBC reporter is not entitled to protection because he likes Fox and not MSNBC?","date":"Mon Apr 08 11:46:43 MDT 2013"},{"aspect":"self_created","tweet":"@_silversmith That reporter put her neck out doing her job for the public. Being so personal about Fox is a very dangerous way to go.","date":"Mon Apr 08 11:46:16 MDT 2013"},{"aspect":"self_created","tweet":"@_silversmith That so misses the much, much bigger principle involved.","date":"Mon Apr 08 11:45:30 MDT 2013"},{"aspect":"self_created","tweet":"@_silversmith I work for a RW publication. Am I, therefore, not entitled to this protection because you don't like the magazine I work for?","date":"Mon Apr 08 11:44:43 MDT 2013"},{"aspect":"self_created","tweet":"@_silversmith This is not about RW or LW or any wing. A journalist should be able to report w/o disclosing sources.","date":"Mon Apr 08 11:44:18 MDT 2013"},{"aspect":"self_created","tweet":"@_silversmith Disagree. If other papers will willing to carry the story WInter broke-and they did-they should defend her for getting it.","date":"Mon Apr 08 10:18:15 MDT 2013"},{"aspect":"self_created","tweet":"Fox News Reporter Facing Jail For Protecting Source-Mainstream Media Yawns Raising Questions Of Liberal Bias - Forbes http://t.co/bT24TJo2fq","date":"Mon Apr 08 09:13:45 MDT 2013"},{"aspect":"self_created","tweet":"North Carolina Religion Bill Killed-But One Third Of Americans Want Christianity As Official Religion Of USA - Forbes http://t.co/r3j82BG7cY","date":"Sun Apr 07 10:31:00 MDT 2013"},{"aspect":"self_created","tweet":"@scottienhughes  govt building yes but the ID process is handled by DMV. Inner city DMV was closed. Not only 60 mi away but many don't drive","date":"Sat Apr 06 12:11:54 MDT 2013"},{"aspect":"self_created","tweet":"@scottienhughes @katywh20 @JasonBWhitman @VanJones68 Wisconsin-DMV a sixty mile drive or more for many in inner city Milwaukee","date":"Sat Apr 06 12:06:19 MDT 2013"},{"aspect":"self_created","tweet":"@scottienhughes @katywh20 @jasonbwhitman @vanjones68 nothing so long as it is not rigged to make it far too hard to get the ID.","date":"Sat Apr 06 12:02:18 MDT 2013"},{"aspect":"self_created","tweet":"@sistertoldjah The way it works is you are supposed to show where I lied when I respond to you. You haven't done that. Just said I'm \"upset\"","date":"Thu Apr 04 08:01:02 MDT 2013"},{"aspect":"self_created","tweet":"@sistertoldjah No disrespect, but people disagree with me all the time. I don't think you can upset me.","date":"Thu Apr 04 08:00:15 MDT 2013"},{"aspect":"self_created","tweet":"@sistertoldjah If this is how you \"prove\" that nothing I wrote was true, you should attack my articles more often.","date":"Thu Apr 04 07:51:39 MDT 2013"},{"aspect":"self_created","tweet":"@sistertoldjah Do you really feel better that this is a resolution and not a bill?","date":"Thu Apr 04 07:51:18 MDT 2013"},{"aspect":"self_created","tweet":"@sistertoldjah Then you print that the resolution says N.C. would not honor laws respecting an establishment of religion!","date":"Thu Apr 04 07:51:05 MDT 2013"},{"aspect":"self_created","tweet":"@sistertoldjah Funny. U cite yourselt as authority and in what you printed u agree with me! U publish that the legislators were \"misguided\"!","date":"Thu Apr 04 07:49:46 MDT 2013"},{"aspect":"self_created","tweet":"North Carolina Lawmakers Introduce Law To Establish An Official State Religion - Forbes http://t.co/KMJTgb38yt","date":"Wed Apr 03 09:13:53 MDT 2013"},{"aspect":"self_created","tweet":"Is Voter Registration Via Obamacare Insurance Exchange Application A Plot To Register Obama Supporters? - Forbes http://t.co/5n6t1wpUyM","date":"Sun Mar 31 11:43:31 MDT 2013"},{"aspect":"self_created","tweet":"@Tpwmillard @PeteDominick If we both get an \"A\", why is it hashtag assholes?","date":"Thu Mar 28 10:53:23 MDT 2013"},{"aspect":"self_created","tweet":"You Won't Believe What Glenn Beck Is Saying About The Michele Bachmann Investigation - Forbes http://t.co/b5dxstRFgP","date":"Wed Mar 27 14:43:26 MDT 2013"},{"aspect":"self_created","tweet":"Why The Supreme Court DOMA Decision Has Big Money Consequences For LGBT Americans - Forbes http://t.co/QMDoGNOzBp","date":"Wed Mar 27 10:52:57 MDT 2013"},{"aspect":"self_created","tweet":"Proof That Obamacare 'Rate Shock' Is An Ugly Insurance Company Deception - Forbes http://t.co/XZldyNrL8e","date":"Tue Mar 26 07:53:13 MDT 2013"},{"aspect":"self_created","tweet":"Why Do Polls Show Support For Gay Marriage When State Election Results Reveal Otherwise? - Forbes http://t.co/YvVcEmcpLw","date":"Mon Mar 25 10:54:49 MDT 2013"},{"aspect":"self_created","tweet":"Birther Hypocrisy-Right Wing Has No Problem With Canadian Born Senator Ted Cruz Running For President - Forbes http://t.co/3IU6lPJm41","date":"Thu Mar 21 08:42:53 MDT 2013"},{"aspect":"self_created","tweet":"@ladylibertine27 @viewpointctv @zerlinamaxwell fun show! Enjoyed hanging with you guys!","date":"Tue Mar 19 19:11:12 MDT 2013"},{"aspect":"self_created","tweet":"@kevintrapani @viewpointctv @zerlinamaxwell @forbes @ladylibertine27 excellent point.","date":"Tue Mar 19 19:10:39 MDT 2013"},{"aspect":"self_created","tweet":"The Retirement Crisis Is Here For Millions-Income Inequality Now Set To Wreak Its Ugly Revenge - Forbes http://t.co/sWHGBbD82L","date":"Tue Mar 19 12:18:04 MDT 2013"},{"aspect":"self_created","tweet":"@StupidCancerCEO @billmaher I agree! All my friends have been on and I haven't...and it's my favorite show!!!","date":"Tue Mar 19 09:10:32 MDT 2013"},{"aspect":"self_created","tweet":"The CPAC Follies Starring Sarah 'Shecky' Palin - Forbes http://t.co/IOQBH47inD","date":"Mon Mar 18 11:04:35 MDT 2013"},{"aspect":"self_created","tweet":"@DanMinardi U R ignoring his rejection of a candidate for the bench due to her positions on behalf of her clients while forgiving his.","date":"Sat Mar 16 19:36:18 MDT 2013"},{"aspect":"self_created","tweet":"@DanMinardi That's swell but you are way off point. Read the entire article. I'm not saying he is limited by anything beyond his hypocrisy.","date":"Sat Mar 16 19:35:10 MDT 2013"},{"aspect":"self_created","tweet":"@DanMinardi Sorry, Daniel, but your analysis is just not correct. Nothing has changed relevant to Cruz's point via Heller.","date":"Sat Mar 16 18:56:11 MDT 2013"},{"aspect":"self_created","tweet":"@DanMinardi Wrong. Absolutely nothing in that regard changed via Heller-otherwise the laws in NY, Mass. and Conn. would be unconstitutional.","date":"Sat Mar 16 18:55:33 MDT 2013"},{"aspect":"self_created","tweet":"@DanMinardi That is incorrect. The Miller case which came up with the common use definition preceded Heller.","date":"Sat Mar 16 18:53:50 MDT 2013"},{"aspect":"self_created","tweet":"@DanMinardi I agree...but Heller did not change the law on his point.","date":"Sat Mar 16 17:06:50 MDT 2013"},{"aspect":"self_created","tweet":"@spike3434 thanks. Paul would have won the poll even w/o the filibuster. he went after it. Means nothing. Most winners lose the nomination.","date":"Sat Mar 16 15:46:46 MDT 2013"},{"aspect":"self_created","tweet":"@spike3434 No...I'm calling him a hypocrite. Big difference wouldn't you say?","date":"Sat Mar 16 14:56:38 MDT 2013"},{"aspect":"self_created","tweet":"Meet Ted Cruz-Second Amendment Hypocrite - Forbes http://t.co/9fKzq3KhXs","date":"Sat Mar 16 14:31:41 MDT 2013"},{"aspect":"self_created","tweet":"Will The Middle Class Really Pay One Trillion In New Obamacare Taxes And, If True, What Would It Buy Them? - Forbes http://t.co/wA9EBx7M10","date":"Tue Mar 12 09:14:16 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @political_bill yes you are exactly who I want choosing what I write about! I'll get right on it","date":"Mon Mar 11 19:28:32 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 and u am most certainly not your pal","date":"Mon Mar 11 19:20:45 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 key word Ivor you is hate. Says it all.","date":"Mon Mar 11 19:19:58 MDT 2013"},{"aspect":"self_created","tweet":"@RIFSnobsThan you...and yes...X-Men was a part of my 'last life'..along with a lot of other Marvel stuff and other cartoons!!","date":"Mon Mar 11 19:05:05 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 You'll just hate them for it. Oh well...not my problem. Bye now.","date":"Mon Mar 11 19:03:48 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 I know you can't possibly understand that. I shudder to tell you the other conservatives I respect and am friendly with.","date":"Mon Mar 11 19:03:32 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 But that doesn't mean he isn't a great conservative writer. see, we aren't all haters like you.","date":"Mon Mar 11 19:03:01 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2You do a far better job of discrediting yourself than i could hope to. Connor and i have often disagreed in print.","date":"Mon Mar 11 19:02:20 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2  Friedersdorf is most certainly a respected conservative...but not a respected extremist reactionary so I get your problem","date":"Mon Mar 11 18:54:59 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 Guess u just have to work pretty hard to avoid the facts of a story. Whatever works for you I guess.","date":"Mon Mar 11 18:52:16 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 And you should read this by Connor Friedersdorf-a well regarded conservative- http://t.co/SPYzHIWtnM","date":"Mon Mar 11 15:03:31 MDT 2013"},{"aspect":"self_created","tweet":"@RIFSnobs @BlackChuckTodd @Green_Footballs Good story. Thx for bringing to my attention.","date":"Mon Mar 11 14:56:19 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski I guess ur just used to saying crap about what people write without any blowback.","date":"Sun Mar 10 12:35:05 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski If you don't want a response, don't say BS stuff-like questioning if its slander if he worked for ACORN.","date":"Sun Mar 10 12:34:31 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski uh..u were commenting on my article. I guess if I chose to respond that makes me a troll?","date":"Sun Mar 10 12:34:01 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski I actually respect the law. Maybe to you, that is being a troll.","date":"Sun Mar 10 12:29:16 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski I don't get to call u someone who wants to deal in flesh trade even if u worked for gambinos-unless its true.","date":"Sun Mar 10 12:28:44 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski I see. And ACORN has been convicted of crimes where?","date":"Sun Mar 10 12:27:38 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @BackwoodsJim I refer you to your original point-it can't be slander because he worked for ACORN. Nothing more need b said.","date":"Sun Mar 10 12:26:59 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski And I'm the troll?","date":"Sun Mar 10 12:25:39 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski ur theory being that you must be guilty of something so I can accuse u of wanting to assist in illegal activity?","date":"Sun Mar 10 12:25:32 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski ur comments speak for themselves. according to you, if I don't like the orgs. u affiliate with, I can defame you","date":"Sun Mar 10 12:24:27 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski look up definition of slander and liable before u embarrass yourself further.","date":"Sun Mar 10 12:15:30 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski Are u actually trying to say that this guy who worked at ACORN was a public figure?","date":"Sun Mar 10 12:14:40 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski And what are you even talking about when you say \"private citizens do not voilate your 1st Amend rights?\"","date":"Sun Mar 10 12:14:16 MDT 2013"},{"aspect":"self_created","tweet":"@rickungar @TimothyODonnel2 @warmowski It actually has to be true.","date":"Sun Mar 10 12:13:18 MDT 2013"},{"aspect":"self_created","tweet":"@rickungar @TimothyODonnel2 @warmowski Who cares what you believe? The law doesn't protect your right to slander just because you belief.","date":"Sun Mar 10 12:13:05 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski You should think before you write if you don't want to be called on it.","date":"Sun Mar 10 12:12:18 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski Yes you did. You said because he worked at ACORN he must have been guilty so how can it be slander?","date":"Sun Mar 10 12:12:06 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski Not without proof that you were doing something wrong. Are you clear now?","date":"Sun Mar 10 12:11:02 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski My 1st Amend. right does not extend to liberling u because your boss turns out to be doing something wrong.","date":"Sun Mar 10 12:10:51 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski The one that does not allow me to slander you if are not commiting a crime -even if I don't like your employer.","date":"Sun Mar 10 12:09:14 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski So, an employee of a GOP Congressman engaged in criminal enterprise is, by your definition, immune 2 slander?","date":"Sun Mar 10 12:07:58 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski I think that response pretty much says it all, doesn't it? I guess you aren't too big on Constitutional rights.","date":"Sun Mar 10 12:05:15 MDT 2013"},{"aspect":"self_created","tweet":"@TimothyODonnel2 @warmowski I'm sure he can afford it..so that is a reason to slander people? Because you can?","date":"Sun Mar 10 11:59:20 MDT 2013"},{"aspect":"self_created","tweet":"@SimonTemplarPV Apparently you didn't hear that there was more than one video produced by Mr. O'Keefe.","date":"Sun Mar 10 11:58:20 MDT 2013"},{"aspect":"self_created","tweet":"@SimonTemplarPVI'm sure you'll complain about the source but here is the entire story, mr. troll -http://t.co/IMZX2M3ZaN","date":"Sun Mar 10 11:56:13 MDT 2013"},{"aspect":"self_created","tweet":"@SimonTemplarPV Don't have his videos at my fingertips as you do. So, the CA AG was lying in report? U really going to sell that?","date":"Sun Mar 10 11:50:51 MDT 2013"},{"aspect":"self_created","tweet":"@SimonTemplarPV Who do you imagine u are fooling? Successful trolls need, at least, a rational explanation. Where is yours?","date":"Sun Mar 10 11:46:05 MDT 2013"},{"aspect":"self_created","tweet":"@SimonTemplarPV And ur explanation as to why he edited tape to show him entering in pimp coat (AG words) but did real intv. in coat & tie?","date":"Sun Mar 10 11:45:32 MDT 2013"},{"aspect":"self_created","tweet":"@SimonTemplarPV that so? I'm wondering what was inaccurate in the piece? I don't imagine u need an excuse to defend O'Keefe.","date":"Sun Mar 10 11:41:57 MDT 2013"},{"aspect":"self_created","tweet":"@tuckahoetommy @deedeegop @davidwebbshow @RayMooch @TeaParty365 :-)","date":"Sat Mar 09 08:45:09 MST 2013"},{"aspect":"self_created","tweet":"@tuckahoetommy @deedeegop @davidwebbshow @RayMooch @TeaParty365 What can I say? Popular!!!","date":"Sat Mar 09 08:11:21 MST 2013"},{"aspect":"self_created","tweet":"@win8ive Yeah...could barely find a word about anthony weiner in MSM. I'll never understand why people put such silly comments in print.","date":"Sat Mar 09 08:10:49 MST 2013"},{"aspect":"self_created","tweet":"@SimonTemplarPV Really? This is your level of dialogue? Pretty embarrassing.","date":"Sat Mar 09 08:09:56 MST 2013"},{"aspect":"self_created","tweet":"Get a little liberal love going on @davidwebbshow tonight at 9.The best conservative talker gets a visit from me, the lib. SiriusXM Patriot","date":"Fri Mar 08 18:49:39 MST 2013"},{"aspect":"self_created","tweet":"@BRICBreaker Yes. That is why I want to revive it...so people understand how awful this was.","date":"Fri Mar 08 13:50:33 MST 2013"},{"aspect":"self_created","tweet":"James O'Keefe Pays $100,000 To ACORN Employee He Smeared-Conservative Media Yawns - Forbes http://t.co/aBPTUYaKYi","date":"Fri Mar 08 13:38:30 MST 2013"},{"aspect":"self_created","tweet":"@spike3434 Agree. And the 'old fashioned way' is far more effective in making the point.","date":"Thu Mar 07 10:50:25 MST 2013"},{"aspect":"self_created","tweet":"@QueenMyrina1 Thanks!","date":"Thu Mar 07 10:49:39 MST 2013"},{"aspect":"self_created","tweet":"A Kind Word For Senator Rand Paul From A Typically Unkind Critic - Forbes http://t.co/dIXBCjDcra","date":"Thu Mar 07 10:10:49 MST 2013"},{"aspect":"self_created","tweet":"@nicolesandler @janewins1 Thanks guys! I had fun too111","date":"Tue Mar 05 21:12:02 MST 2013"},{"aspect":"self_created","tweet":"@Litzz11 always best to read in context. It is awfully clear.","date":"Tue Mar 05 14:32:05 MST 2013"},{"aspect":"self_created","tweet":"@Litzz11 boy did u misread the last graph which calls out DC for their BS. Try reading again and then maybe find someone else to insult?","date":"Tue Mar 05 14:22:39 MST 2013"},{"aspect":"self_created","tweet":"@Litzz11 Pretty hard to write about this and not discuss DC.","date":"Tue Mar 05 13:23:47 MST 2013"},{"aspect":"self_created","tweet":"@Litzz11 While I certainly know who they are, that doesn't change the fact that DC is the one who first reported this story.","date":"Tue Mar 05 13:23:10 MST 2013"},{"aspect":"self_created","tweet":"@Litzz11 Ha! What can I say. Just trying to be polite!","date":"Tue Mar 05 12:54:47 MST 2013"},{"aspect":"self_created","tweet":"GOP Senator Distorts GAO Report He Commissioned To Launch Most Dishonest Attack On Obamacare To Date - Forbes http://t.co/exhXsoDVJN","date":"Tue Mar 05 09:50:11 MST 2013"},{"aspect":"self_created","tweet":"Who Framed Senator Bob Menendez? - Forbes http://t.co/NLLfQ0WuAd","date":"Mon Mar 04 16:34:15 MST 2013"},{"aspect":"self_created","tweet":"Obama,Inc.'s Epic Fail-Big Cash For Big Access Disappoints Believers - Forbes http://t.co/Nhgh4uYxeG","date":"Mon Mar 04 11:07:13 MST 2013"},{"aspect":"self_created","tweet":"@glordiii @Saggie27 @WillMcAvoyACN @MandoVod Yes. I saw that when I read the entire chain which I why I tweeted back.","date":"Sat Mar 02 08:55:48 MST 2013"},{"aspect":"self_created","tweet":"@Saggie27 @willmcavoyacn @mandovod @glordiii Forbes is hardly liberal but is open to differing perspectives as a good magazine should be.","date":"Fri Mar 01 15:37:49 MST 2013"},{"aspect":"self_created","tweet":"@Saggie27 @willmcavoyacn @mandovod @glordiii just read the entire chain so I better understand.","date":"Fri Mar 01 15:36:14 MST 2013"},{"aspect":"self_created","tweet":"@Saggie27 @willmcavoyacn @mandovod @glordiii I get that u want to insult me but I have no idea what that tweet means...or why.","date":"Fri Mar 01 14:49:47 MST 2013"},{"aspect":"self_created","tweet":"@wwwbighag @CNN thank you!","date":"Thu Feb 28 21:05:33 MST 2013"},{"aspect":"self_created","tweet":"@wwwbighag @CNN Really? Read the exchange which is now available - http://t.co/IQt1BnDN5i\nIs this your idea of a threat? seriously?","date":"Thu Feb 28 16:30:15 MST 2013"},{"aspect":"self_created","tweet":"Bakery lady sez this morning, \"if you don't try the marble rye you'll regret it.\" I'm going on @cnn to blow whistle on her threat! #scared","date":"Thu Feb 28 07:43:00 MST 2013"},{"aspect":"self_created","tweet":"The Best Kept Secret In American Politics-Federal Budget Deficits Are Actually Shrinking! - Forbes http://t.co/5yiXhis5Bz","date":"Wed Feb 27 15:26:33 MST 2013"},{"aspect":"self_created","tweet":"@rightsprung All part of the job!","date":"Wed Feb 27 13:33:22 MST 2013"},{"aspect":"self_created","tweet":"Must Obama Save The GOP In Order To Save His Agenda And End Dysfunctional Government? - Forbes http://t.co/BUZP2j6jOO","date":"Wed Feb 27 09:40:34 MST 2013"},{"aspect":"self_created","tweet":"@KellyRek @Revelation1217 It must have some redeeming value. Saved my life twice.","date":"Tue Feb 26 19:03:02 MST 2013"},{"aspect":"self_created","tweet":"Chris Christie Says Yes To Obamacare Medicaid Expansion - Forbes http://t.co/IpEnh7CWQ9","date":"Tue Feb 26 17:18:52 MST 2013"},{"aspect":"self_created","tweet":"Unexpected Surge In Consumer Confidence And New Home Sales For February - Forbes http://t.co/lugkSXK3Sd","date":"Tue Feb 26 08:42:40 MST 2013"},{"aspect":"self_created","tweet":"@CadetLdgrd The article references this on a percentage basis-which is simply correct. Your bias does not allow you to recognize the point.","date":"Sun Feb 24 10:09:40 MST 2013"},{"aspect":"self_created","tweet":"@ChristianCalls1 @TheNewDeal Not responsible for what Obama says. If I said, \"Thumbs up\" I forgot-I wrote this article a year ago.","date":"Sun Feb 24 09:32:40 MST 2013"},{"aspect":"self_created","tweet":"@TheNewDeal @CadetLdgrd I know...it is profoundly disturbing.","date":"Sun Feb 24 09:31:41 MST 2013"},{"aspect":"self_created","tweet":"@CadetLdgrd @TheNewDeal I don't even know what that means. The point is simply what is stated. U just don't like the result.","date":"Sun Feb 24 09:31:19 MST 2013"},{"aspect":"self_created","tweet":"@CadetLdgrd @thenewdeal  I am sorry if u don't like the statistic but your displeasure does not make it less accurate.","date":"Sun Feb 24 08:51:43 MST 2013"},{"aspect":"self_created","tweet":"@CadetLdgrd @TheNewDeal is that what the article said. I don't think so.","date":"Sun Feb 24 08:50:14 MST 2013"},{"aspect":"self_created","tweet":"@CadetLdgrd @TheNewDeal How is it misleading  if you understand it as it you clearly do?","date":"Sun Feb 24 06:31:11 MST 2013"},{"aspect":"self_created","tweet":"@ChristianCalls1 @TheNewDeal I dont' recall saying any of this. The article reports a fact, not an editorial on patriotism or anything else","date":"Sun Feb 24 06:30:35 MST 2013"},{"aspect":"self_created","tweet":"@KyraHLN @AlfredSchulz @PeteDominick Ah..so true! But we love him none the less.","date":"Sat Feb 23 17:10:44 MST 2013"},{"aspect":"self_created","tweet":"@KyraHLN @AlfredSchulz @PeteDominick Hey..how 'come I never get the great @KyraHLN when I'm guest hosting?","date":"Sat Feb 23 11:24:15 MST 2013"},{"aspect":"self_created","tweet":"@Hueby11 @TheNewDeal that's fine but, again, wholly irrelevant to the article I wrote. As I said, I just reported the facts.","date":"Sat Feb 23 11:22:56 MST 2013"},{"aspect":"self_created","tweet":"@Hueby11 @TheNewDeal I don't recall ever suggesting that. I'm just reporting the fact-not telling u what to do with them.","date":"Sat Feb 23 10:29:06 MST 2013"},{"aspect":"self_created","tweet":"Health Insurance Company Requests For Double Digit Premium Increases Plummeting-Proof Obamacare Is Working? - Forbes http://t.co/CsjSJlChuP","date":"Sat Feb 23 10:09:43 MST 2013"},{"aspect":"self_created","tweet":"New Rule: You Can't Be A Conservative And Cry Over Ending Subsidies To Medicare Advantage - Forbes http://t.co/J5ZBQ7kc4s","date":"Thu Feb 21 14:21:40 MST 2013"},{"aspect":"self_created","tweet":"SCOTUS Poised To Take Next Step On the Road To Total Political Domination By The Wealthy? - Forbes http://t.co/fbF8R1I9","date":"Wed Feb 20 07:03:26 MST 2013"},{"aspect":"self_created","tweet":"@gbrshalo very good to know!","date":"Tue Feb 19 18:17:15 MST 2013"},{"aspect":"self_created","tweet":"@PS_Williams ooh..gettin' personal! No way to have a conversation.","date":"Tue Feb 19 17:08:46 MST 2013"},{"aspect":"self_created","tweet":"I'll be hanging with @JohnFugelsang tonight on Viewpoint on @current.! Don't miss it! 8pm EST","date":"Tue Feb 19 17:07:21 MST 2013"},{"aspect":"self_created","tweet":"@PS_Williams Thing is, it ain't innuendo and smear if it is true. \nhttp://t.co/SD9vx5CM","date":"Tue Feb 19 15:43:14 MST 2013"},{"aspect":"self_created","tweet":"@PS_Williams The ad is designed to make you not like Romney. Can u see the difference from what Cruz did to Hagel?","date":"Tue Feb 19 05:43:22 MST 2013"},{"aspect":"self_created","tweet":"@PS_Williams The ad-which I hated- blamed him for woman's death. That is not murder nor implied murder.","date":"Tue Feb 19 05:42:42 MST 2013"},{"aspect":"self_created","tweet":"@PS_Williams Think it through and you will see the difference. It's a big one. Nobody inferred Romney was a murderer.","date":"Tue Feb 19 05:41:43 MST 2013"},{"aspect":"self_created","tweet":"@PatRCO @bayonnebernie I truly hope so.","date":"Mon Feb 18 18:50:18 MST 2013"},{"aspect":"self_created","tweet":"@wolfpac_five @PeteDominick Thank you!","date":"Mon Feb 18 13:55:13 MST 2013"},{"aspect":"self_created","tweet":"Ted Cruz-The Reincarnation Of Joe McCarthy? - Forbes http://t.co/a3rfBsJ8","date":"Mon Feb 18 10:11:24 MST 2013"},{"aspect":"self_created","tweet":"@wolfpac_five @PeteDominick @AlfredSchulz I will be on as a guest this Friday morning so be sure to tune in!","date":"Sun Feb 17 08:16:55 MST 2013"},{"aspect":"self_created","tweet":"@wolfpac_five @PeteDominick @AlfredSchulz I will always guest host whenever @PeteDominick invites me to do so as I love the show!","date":"Sun Feb 17 08:16:30 MST 2013"},{"aspect":"self_created","tweet":"@orion99da @SteveForbesCEO also don't know why you would forget about the high-techs coming into Y'Town.","date":"Sat Feb 16 10:28:27 MST 2013"},{"aspect":"self_created","tweet":"@orion99da @SteveForbesCEO I have had those conversations with them and they quickly acknowledge this.","date":"Sat Feb 16 10:27:11 MST 2013"},{"aspect":"self_created","tweet":"@orion99da @SteveForbesCEO They wouldn't have been ten years ago.","date":"Sat Feb 16 10:26:48 MST 2013"},{"aspect":"self_created","tweet":"@orion99da @SteveForbesCEO Talk to those operators and ask if they are not more comfortable putting execs there today.","date":"Sat Feb 16 10:26:38 MST 2013"},{"aspect":"self_created","tweet":"@darikpoff yeah..it was kind of a good day!","date":"Sat Feb 16 10:25:42 MST 2013"},{"aspect":"self_created","tweet":"The Minimum Wage Fight-Ground Zero In The Clash Of Conservative vs. Progressive America - Forbes http://t.co/ZdIIzw5h","date":"Sat Feb 16 10:08:11 MST 2013"},{"aspect":"self_created","tweet":"@SuperStarr73 they say the r going to give all emps hc. We will see.","date":"Fri Feb 15 14:36:49 MST 2013"},{"aspect":"self_created","tweet":"@CNNLive @FLOTUS should be lawyers. why no airlift of food? or ship deliveries of porta-poties??","date":"Thu Feb 14 11:49:22 MST 2013"},{"aspect":"self_created","tweet":"The Madness Of Wayne LaPierre-Will NRA Members Suffer The Consequences? - Forbes http://t.co/eXT0IdhY","date":"Thu Feb 14 10:10:58 MST 2013"},{"aspect":"self_created","tweet":"@BRICBreaker Deep in the recesses of my quickly collapsing mind.","date":"Wed Feb 13 13:27:23 MST 2013"},{"aspect":"self_created","tweet":"The Obama SOTU Conundrum-Will It Be Debt Or Investment? - Forbes http://t.co/sU7cOUI9","date":"Wed Feb 13 13:06:19 MST 2013"},{"aspect":"self_created","tweet":"@MsGraceyP Dr. Seuss speech is a great description. Rubio not as bad to be sure, but still neither a response to SOTU nor anything new.","date":"Tue Feb 12 21:30:13 MST 2013"},{"aspect":"self_created","tweet":"@MsGraceyP But hey, the master of the genre, Bobby Jindal, thought it was great so I guess it's all good!","date":"Tue Feb 12 21:11:09 MST 2013"},{"aspect":"self_created","tweet":"@MsGraceyP Nah. I'm a late nigher. Maybe because they speak to the audience like we are all 5 year olds?","date":"Tue Feb 12 21:10:42 MST 2013"},{"aspect":"self_created","tweet":"@BaalBjorn Think it's more 'cause they're so sugary sweet and talk to us like 5 year olds.","date":"Tue Feb 12 21:10:00 MST 2013"},{"aspect":"self_created","tweet":"@aviksaroy And therein lies your problem! Thing the whole dry mouth thing was caused by global warming?","date":"Tue Feb 12 21:07:13 MST 2013"},{"aspect":"self_created","tweet":"@marcorubio did SNL's job for them. Sketch is written. We'll call it water-gate!","date":"Tue Feb 12 20:58:30 MST 2013"},{"aspect":"self_created","tweet":"Why does the GOP response always feel like someone is telling me a bedtime story?","date":"Tue Feb 12 20:57:48 MST 2013"},{"aspect":"self_created","tweet":"@USWBlogger @tmont Ha!!","date":"Tue Feb 12 13:48:24 MST 2013"},{"aspect":"self_created","tweet":"@USWBlogger True.","date":"Tue Feb 12 13:44:30 MST 2013"},{"aspect":"self_created","tweet":"@USWBlogger That's Republic Steel in my hometown of Youngstown, Ohio!!","date":"Tue Feb 12 13:44:13 MST 2013"},{"aspect":"self_created","tweet":"@USWBlogger I learned more from the guys in the mill than anywhere I've ever been.","date":"Tue Feb 12 13:43:33 MST 2013"},{"aspect":"self_created","tweet":"@USWBlogger Thx. Used to work at Republic Steel in the summers during college. Used to earn my card by the end of each summer.","date":"Tue Feb 12 13:43:19 MST 2013"},{"aspect":"self_created","tweet":"@USWBlogger Glad you liked the piece. And FYI, I was once a member of the United Steelworkers Union!","date":"Tue Feb 12 13:42:05 MST 2013"},{"aspect":"self_created","tweet":"@SarahBurris @USWBlogger What a nice reaction to my piece! Thx","date":"Tue Feb 12 13:41:02 MST 2013"},{"aspect":"self_created","tweet":"@unitehere @USWBlogger Now that is the reaction I like to see!!!","date":"Tue Feb 12 13:39:48 MST 2013"},{"aspect":"self_created","tweet":"New Data Suggests Obamacare Is Actually Bending The Healthcare Cost Curve - Forbes http://t.co/CGcnvDJu","date":"Tue Feb 12 07:13:45 MST 2013"},{"aspect":"self_created","tweet":"Listening to @PeteDominick new show on Sirius/XM 104. Great as always! You should be listening too!","date":"Tue Feb 12 05:57:00 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt @McClatchyDC Huh?","date":"Mon Feb 11 15:50:31 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt U don't seem to follow the distinction between the phrase as descriptor to the actual notion that we are all, ultimately, Amers.","date":"Mon Feb 11 15:50:14 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt Thank goodness for that.","date":"Mon Feb 11 15:16:40 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt As I suspected, my T Party friends, including one who is quite well known, were shocked by your take. They think we r all Amers.","date":"Mon Feb 11 15:16:33 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt I am, however, going to talk about this on David Webb's radio show. I know he disagrees with you totally.","date":"Mon Feb 11 14:54:57 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt It is not my wish to change your mind-you are clearly too far gone. What a shame.","date":"Mon Feb 11 14:54:30 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt I can deeply disagree with other Americans-but we are all still Americans.","date":"Mon Feb 11 14:53:42 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt You cannot rationally back up your comment no matter how hard you try.","date":"Mon Feb 11 14:53:11 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt we have always had different cultures in America. That's the point! It doesn't make us less of an American.","date":"Mon Feb 11 14:51:31 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt I think they will take great issue with 'we're not all Americans'.","date":"Mon Feb 11 14:50:50 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt I've just sent your tweet to my two friends who founded the NYC Tea Party. Anxious to hear what they have to say about it.","date":"Mon Feb 11 14:50:30 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt Wow. We're not all Americans? Okay...you've gone way too far over the edge for me. Might I suggest a high school civics class?","date":"Mon Feb 11 14:49:45 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt A little objectivity might help?","date":"Mon Feb 11 14:47:48 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt And, again, you totally miss the point of the article which has absolutely nothing to do with Obama policies.","date":"Mon Feb 11 14:47:41 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt very odd way to view it. If it makes you feel better, fine. But, not particularly credible. We are all Americans, you know.","date":"Mon Feb 11 14:46:44 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt BTW -Virginia, Florida,Colorado,New Mexico and Nevada excommunicated from the union and I didn't get the memo?","date":"Mon Feb 11 14:45:26 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt Further, not EVERYONE in the states he lost voted against him, now did they? I'm sure u have some good arguments. This ain't it.","date":"Mon Feb 11 14:42:08 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt And yet, he managed to get more than enough electoral votes-and popular votes-to easily win the election.","date":"Mon Feb 11 14:41:25 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt Except that you are speaking to whether or not B.G. is good-which is not the point of the article.","date":"Mon Feb 11 12:14:41 MST 2013"},{"aspect":"self_created","tweet":"@MaggioMatt I think you may have missed the point. Try reading the article rather than just the headline. Hopefully useful.","date":"Mon Feb 11 12:03:00 MST 2013"},{"aspect":"self_created","tweet":"The Verdict Is In: The Battle Of Big v. Small Government Will End In Blue Victory - Forbes http://t.co/1B1qr225","date":"Mon Feb 11 11:56:18 MST 2013"},{"aspect":"self_created","tweet":"@canoeberry No. It does not. A commenter (not me) suggested this in a comment. I noted that I had never heard of it. I googled. A surprise.","date":"Sun Feb 10 13:31:20 MST 2013"},{"aspect":"self_created","tweet":"@canoeberry Completely confused by your question. What does any of this have to do with my article?","date":"Sun Feb 10 13:27:47 MST 2013"},{"aspect":"self_created","tweet":"@tuckahoetommy watching Freddie Ferrer on TV.","date":"Sun Feb 10 09:40:07 MST 2013"},{"aspect":"self_created","tweet":"Voter Disenfranchisement Efforts Hit Desperate New Low In NRO Hit Piece - Forbes http://t.co/YxUjpAak","date":"Sun Feb 10 09:15:01 MST 2013"},{"aspect":"self_created","tweet":"@scottienhughes Look forward to seeing you and in person next week! You were great fun!","date":"Fri Feb 08 06:54:35 MST 2013"},{"aspect":"self_created","tweet":"The Sequester-The Ultimate Betrayal Of The GOP Base - Forbes http://t.co/KD1YwPZW","date":"Wed Feb 06 09:53:20 MST 2013"},{"aspect":"self_created","tweet":"IRS Ruling To Create Millions Of Uninsured Americans As It Undermines The Very Intent of Obamacare - Forbes http://t.co/l6kQBAXE","date":"Mon Feb 04 08:51:15 MST 2013"},{"aspect":"self_created","tweet":"Will The Cost Of Immigration Reform Explode The National Deficit? - Forbes http://t.co/lPwdHAmg","date":"Sun Feb 03 10:46:47 MST 2013"},{"aspect":"self_created","tweet":"@CJCaudle Thanks! I too do it to get my heart rate elevated!","date":"Sat Feb 02 13:33:13 MST 2013"},{"aspect":"self_created","tweet":"Get Ready For The Skeet Shooting Truthers! - Forbes http://t.co/cpI3vLix","date":"Sat Feb 02 13:28:24 MST 2013"},{"aspect":"self_created","tweet":"@tuckahoetommy @murphymike @howiewolf @dmataconis @redsfanatic1957 @gordonhensleydc @edsall @arifleischer Who let the 'lefty' on this list??","date":"Sat Feb 02 10:10:20 MST 2013"},{"aspect":"self_created","tweet":"Catch me on @ViewpointCTV tonight on @current with @JohnFugelsang. Should be fun. 8E/5p.","date":"Thu Jan 31 15:41:13 MST 2013"},{"aspect":"self_created","tweet":"Unions Seeking Special Treatment Under Obamacare Now Want Government Subsidies For Lower Paid Union Members - Forbes http://t.co/VtFuOq4C","date":"Thu Jan 31 13:48:31 MST 2013"},{"aspect":"self_created","tweet":"Immigration Reform The End Of The Line For GOP-Tea Party Alliance? - Forbes http://t.co/KVy7JWvb","date":"Mon Jan 28 15:57:34 MST 2013"},{"aspect":"self_created","tweet":"@KimberlyInOhio @tmwinsett @PeteDominick I'm sure they will do what's best for the time period and POTUS.","date":"Mon Jan 28 07:04:59 MST 2013"},{"aspect":"self_created","tweet":"@KimberlyInOhio @tmwinsett @PeteDominick Appreciate the vote of confidence. Those decisions are made by the powers at S/XM.","date":"Mon Jan 28 07:04:11 MST 2013"},{"aspect":"self_created","tweet":"@PeteDominick Nice NYT piece! Congrats buddy. The new show will be HUGE!","date":"Mon Jan 28 06:34:30 MST 2013"},{"aspect":"self_created","tweet":"@akaMikeyT Thanks!","date":"Sun Jan 27 10:42:01 MST 2013"},{"aspect":"self_created","tweet":"@nikmik123 Thanks!","date":"Sat Jan 26 20:50:54 MST 2013"},{"aspect":"self_created","tweet":"It's Time To Stop Pretending That Republicans Have Cornered The Market On Dirty Politics - Forbes http://t.co/jDNfmAsO","date":"Sat Jan 26 10:12:04 MST 2013"},{"aspect":"self_created","tweet":"@JamesOverholt  I knew you were a smart guy! I thought so but I wasn't clear. Have a good w/end.","date":"Fri Jan 25 21:59:25 MST 2013"},{"aspect":"self_created","tweet":"@JamesOverholt @nikmik123 I\"m afraid you've lost me.","date":"Fri Jan 25 21:40:22 MST 2013"},{"aspect":"self_created","tweet":"@nikmik123 And no, according to CNN poll, majority of Americans do NOT believe Administration covered up.  http://t.co/J0PpQCzF","date":"Fri Jan 25 19:31:36 MST 2013"},{"aspect":"self_created","tweet":"@nikmik123 referencing popularity of Clinton who Paul said should be fired. http://t.co/WoQLVS78","date":"Fri Jan 25 19:27:33 MST 2013"},{"aspect":"self_created","tweet":"Court Slaps Down Obama On NLRB Appointments-Decision Could Invalidate Hundreds Of Labor Decisions - Forbes http://t.co/9jRK4AfZ","date":"Fri Jan 25 12:38:15 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 If you fail to see the failure of your logic, you have much larger problems than me.","date":"Thu Jan 24 14:46:48 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 any effort to discredit completely fails. U object to presenting both sides of an issue & u object to presenting either one side.","date":"Thu Jan 24 14:46:30 MST 2013"},{"aspect":"self_created","tweet":"Proposed New Mexico Law Would Send Rape Victims Who Abort Pregnancies To Prison For 'Tampering With Evidence' - Forbes http://t.co/WixiCKKq","date":"Thu Jan 24 13:05:44 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 @rickungar or this - http://t.co/yo2bZ5PN\nThere are tons more. Need I continue to embarrass you?","date":"Thu Jan 24 11:00:43 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 @rickungar or this - http://t.co/4KaIQdTE","date":"Thu Jan 24 10:59:51 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 wonder how you will explain this - http://t.co/MzRRJb4D\nI know..folks like you don't admit error.","date":"Thu Jan 24 10:58:28 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 yes. and our mothers also dress each and every one of us identically.","date":"Thu Jan 24 10:56:38 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 Disappointed. I like to talk w those who disagree with me. Your bias is too perverse to have a rational conversation.","date":"Thu Jan 24 10:53:38 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 And NOBODY tells me what to write.","date":"Thu Jan 24 10:52:39 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 You are creating a foolish false equivalency. I would have thought u better than that. Proof I can be wrong.","date":"Thu Jan 24 10:52:21 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 Forbes pays me for all articles I do no matter what the topic, including those u would agree with.","date":"Thu Jan 24 10:51:55 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 I also work at Fox News who have me there to offer a different point of view. It's just not all as rigged as you want to believe.","date":"Thu Jan 24 10:34:31 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 It should be obvious to you that you are jaded to the point of irrationality.","date":"Thu Jan 24 10:33:39 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 Why would one of the country's most conservative mags pay me to write a hit piece of Paul?","date":"Thu Jan 24 10:32:58 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 Dude..I write for Forbes! My Editor In Chief supported Rick Perry for Pres! Now u r just not thinking or so blinded you're clueless","date":"Thu Jan 24 10:32:19 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 I do not use facts with omission. Show me where I have?","date":"Thu Jan 24 10:30:26 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 I don't know why you keep telling me about the NYT. I don't write for the NYT. I'm responsible for myself.","date":"Thu Jan 24 10:29:13 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 You can certainly disagree with my opinion-and you can be right. But you discount my opinion because you disagree with my politics.","date":"Thu Jan 24 10:23:40 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 Wrong. I am paid to write my opinion. I defy you to find one article I have written where I have not used real facts.","date":"Thu Jan 24 10:23:15 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 How are you blind to your double-standard?","date":"Thu Jan 24 10:22:15 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 I'm curious why you accept Limbaugh's bias as obvious but that he is truthful when I acknowledge my bias and yet I am not truthful.","date":"Thu Jan 24 10:22:04 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 You're a smart guy. You should recognize that you discount journalistic truth or opinion when you don't like what is being said.","date":"Thu Jan 24 10:21:26 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 And yet you have indicated there is no 'honest journalist' but, apparently, Limbaugh, you say, occasionally is truthful.","date":"Thu Jan 24 10:20:44 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 I didn't ask if you enjoy his show. I asked if you find him credible.","date":"Thu Jan 24 09:08:56 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 Or could it be that those who present the POV of which you approve are credible while all others are not?","date":"Thu Jan 24 09:07:48 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 According to you, no journalistic enterprise can be trusted. Why single out the NYT?","date":"Thu Jan 24 09:07:26 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 And by the way, I'm an opinion writer-not a reporter. You apparently don't know the difference, which explains a great deal.","date":"Thu Jan 24 09:05:45 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 As you consider ALL journalist to be intellectually dishonest, where do you get your news?.","date":"Thu Jan 24 09:05:03 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 Curious why you follow me if you so hate opposing points of view?","date":"Thu Jan 24 08:54:36 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 Ha! You must have missed the title of my column \"The Token Lefty\". I am very honest about my biases.","date":"Thu Jan 24 08:52:51 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 Interesting-yet truly perverted-pov. Do you feel the same about Rush Limbaugh? Just curious.","date":"Thu Jan 24 08:37:18 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 Ever notice that when a neg. piece is about someone you like, it's a 'hit piece'. If it's someone you don't like-honest journalism.","date":"Thu Jan 24 04:39:47 MST 2013"},{"aspect":"self_created","tweet":"@Sagoon2 He makes me very nervous indeed..although probably not for the reasons you imagine.","date":"Thu Jan 24 04:38:48 MST 2013"},{"aspect":"self_created","tweet":"@nikmik123 According to the polls, he did not say what the majority of Americans are thinking-although you might prefer otherwise.","date":"Wed Jan 23 12:27:45 MST 2013"},{"aspect":"self_created","tweet":"Senator Rand Paul's Performance At Benghazi Hearings Reveals A Perverse Grasp Of American Tragedy - Forbes http://t.co/51gmAfs7","date":"Wed Jan 23 10:06:39 MST 2013"},{"aspect":"self_created","tweet":"What Was Obama Talking About When He Cited The Historical References Of 'Seneca Falls, Selma And Stonewall'? - Forbes http://t.co/3Fi3050a","date":"Tue Jan 22 08:49:47 MST 2013"},{"aspect":"self_created","tweet":"@RumbleJoseph Thank you Joseph. By the way, I write in the national press unless you have demoted Forbes to a regional mag.","date":"Mon Jan 21 07:09:27 MST 2013"},{"aspect":"self_created","tweet":"RT @robmtaub: @rickungar please RT If you love dogs you must read Suspect, Robert Crais's new novel. My HufPo review http://t.co/p46mgs6l","date":"Sun Jan 20 10:43:15 MST 2013"},{"aspect":"self_created","tweet":"Bill Clinton Sounds The Right Note In Warning Those Who Disrespect The American Gun Culture - Forbes http://t.co/9yYm66M7","date":"Sun Jan 20 09:52:35 MST 2013"},{"aspect":"self_created","tweet":"@politirft I\"m afraid you've lost me.","date":"Sun Jan 20 05:44:36 MST 2013"},{"aspect":"self_created","tweet":"@politirft Subsidies were for  jobs for Americans. Think kids who have college loans are troubled by that?","date":"Sun Jan 20 04:40:44 MST 2013"},{"aspect":"self_created","tweet":"RT @hav77: Hey @rickungar, today is #braintumorthursday, please pass the word if you can.","date":"Thu Jan 17 16:17:58 MST 2013"},{"aspect":"self_created","tweet":"@rbienvenue Also no difference between EOs and presidential memorandums. Silly stuff.","date":"Wed Jan 16 16:11:34 MST 2013"},{"aspect":"self_created","tweet":"@rbienvenue U shouldn't believe all the silly stuff you read. According to 1999 CRS report, 'actions' are executive orders in all but name.","date":"Wed Jan 16 16:11:17 MST 2013"},{"aspect":"self_created","tweet":"@rbienvenue What do you think the President was signing on the stage flanked by the kids?","date":"Wed Jan 16 16:04:04 MST 2013"},{"aspect":"self_created","tweet":"Here Are The 23 Executive Orders On Gun Safety Signed Today By The President - Forbes http://t.co/5JGet9FF","date":"Wed Jan 16 10:55:42 MST 2013"},{"aspect":"self_created","tweet":"@jimmy_z63 Does the use of the kids in the announcement feel exploitive to you?","date":"Wed Jan 16 09:59:50 MST 2013"},{"aspect":"self_created","tweet":"@jimmy_z63 agreed!","date":"Wed Jan 16 08:22:54 MST 2013"},{"aspect":"self_created","tweet":"@jimmy_z63 That's the fun of it!!!! Especially when people can disagree respectfully, as you certainly do!","date":"Wed Jan 16 08:07:12 MST 2013"},{"aspect":"self_created","tweet":"@jimmy_z63 I wonder if O communications staff will figure this out and skip the kids today?","date":"Wed Jan 16 08:06:32 MST 2013"},{"aspect":"self_created","tweet":"@jimmy_z63 Not the same as O bringing kids on stage. I wouldn't do it but it is objectively not the same.","date":"Wed Jan 16 08:01:33 MST 2013"},{"aspect":"self_created","tweet":"@jimmy_z63 watch the ad calling pres. elitist hypocrite and using the special circumstances of his kids.","date":"Wed Jan 16 08:00:25 MST 2013"},{"aspect":"self_created","tweet":"@jimmy_z63 I take your point on the event today-not the way I would have done it. But the comparison is a false equivalency.","date":"Wed Jan 16 07:56:49 MST 2013"},{"aspect":"self_created","tweet":"@jimmy_z63 That sort of argument does nobody any good whatsoever. #Worstargumentever","date":"Wed Jan 16 07:52:18 MST 2013"},{"aspect":"self_created","tweet":"@jimmy_z63 Yes..it is a bit tacky...and completely irrelevant to the article I just posted to which you responding I presume.","date":"Wed Jan 16 07:51:48 MST 2013"},{"aspect":"self_created","tweet":"Not Your Father's NRA Goes After Obama Children In Disturbing Television Ad - Forbes http://t.co/dHdCHoCQ","date":"Wed Jan 16 07:37:32 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws I'm waiting for your email..full 60 billion passed by House as I said it would...pork and all. Did u think I'd forget?","date":"Tue Jan 15 20:35:24 MST 2013"},{"aspect":"self_created","tweet":"@wolfpac_five Thanks, Sam.","date":"Mon Jan 14 12:14:07 MST 2013"},{"aspect":"self_created","tweet":"The Solution To Guns Must Come At The State Level-Not By Executive Order - Forbes http://t.co/HvWL0HEQ","date":"Mon Jan 14 10:17:28 MST 2013"},{"aspect":"self_created","tweet":"@PolicyRx @aviksaroy Alway @rickungar! Just kidding. I let @aviksaroy be right sometimes. :-)","date":"Sat Jan 12 15:11:59 MST 2013"},{"aspect":"self_created","tweet":"@jamespoulos @CarlKnerr Right back at ya buddy. When R U coming to visit? Warmer here than LA!!","date":"Sat Jan 12 15:09:50 MST 2013"},{"aspect":"self_created","tweet":"@hummingbird5225 Cant help but notice you missed stagnant wages since 1970's while skyrocketing exec pay and corp. profits.","date":"Sat Jan 12 10:51:41 MST 2013"},{"aspect":"self_created","tweet":"@hummingbird5225 @ForbesonFox Agree they are not effective as they should be. But nowhere near the fault for faltering economy.","date":"Sat Jan 12 09:24:31 MST 2013"},{"aspect":"self_created","tweet":"@wwwbighag Dems. WERE the experts once. No longer...obviously!","date":"Sat Jan 12 09:23:08 MST 2013"},{"aspect":"self_created","tweet":"@NoblePies Maybe the local shops could then come back?","date":"Fri Jan 11 17:12:59 MST 2013"},{"aspect":"self_created","tweet":"@PrestonCNN @PeteDominick @AlfredSchulz Loved having you! You are a lot of fun!!!!","date":"Fri Jan 11 17:11:40 MST 2013"},{"aspect":"self_created","tweet":"@spike3434 Who knows?","date":"Thu Jan 10 14:24:53 MST 2013"},{"aspect":"self_created","tweet":"@politirft Do you not consider Wayne LaPierre an expert on gun policy? I do-and yet he takes one side.","date":"Thu Jan 10 10:40:41 MST 2013"},{"aspect":"self_created","tweet":"@politirft I agree that he was one-sided on the issue-but that doesn't take away his qualifications. Experts take a position all the time.","date":"Thu Jan 10 10:39:31 MST 2013"},{"aspect":"self_created","tweet":"@PamelaHaggerty @PeteDominick @RichUngar Thanks. Now where do I send you the check? :-)","date":"Thu Jan 10 10:36:13 MST 2013"},{"aspect":"self_created","tweet":"@politirft No he doesn't. But he does have to have judicial review before acting on such a thing.","date":"Thu Jan 10 10:33:54 MST 2013"},{"aspect":"self_created","tweet":"@politirft Just like the GOP counsel to that committee deserves to be called an expert.","date":"Thu Jan 10 10:33:29 MST 2013"},{"aspect":"self_created","tweet":"@politirft When someone was a top counsel to the House committee on a topic, they deserve to be designated an expert.","date":"Thu Jan 10 10:33:17 MST 2013"},{"aspect":"self_created","tweet":"@politirft Not accolades-positions he has held. No benefit to your perspective to argue that someone isn't expert just 'cause you disagree.","date":"Thu Jan 10 10:32:49 MST 2013"},{"aspect":"self_created","tweet":"@politirft And the CIA was specifically prohibited from assassinations of foreign leaders by the Church Commission.","date":"Thu Jan 10 10:19:46 MST 2013"},{"aspect":"self_created","tweet":"@politirft Actually, that is untrue-such power is subject to judicial review.","date":"Thu Jan 10 10:19:16 MST 2013"},{"aspect":"self_created","tweet":"@politirft You may disagree with him, but by any objective metric, he is, indeed, an expert.","date":"Thu Jan 10 10:18:04 MST 2013"},{"aspect":"self_created","tweet":"@spike3434 Thank you , Dave.","date":"Thu Jan 10 10:17:07 MST 2013"},{"aspect":"self_created","tweet":"@PamelaHaggerty Thanks. I'll be back on tomorrow (Friday) for another round!","date":"Thu Jan 10 10:16:57 MST 2013"},{"aspect":"self_created","tweet":"Gun Advocates Celebrate 'Secret' Obamacare Provision Forbidding Exec Order To Regulate Guns And Ammo - Forbes http://t.co/GTdwew97","date":"Thu Jan 10 09:51:09 MST 2013"},{"aspect":"self_created","tweet":"@Tpwmillard @petedominick appreciate that!!","date":"Wed Jan 09 16:05:00 MST 2013"},{"aspect":"self_created","tweet":"@spike3434 Thanks.","date":"Tue Jan 08 19:28:42 MST 2013"},{"aspect":"self_created","tweet":"@spike3434 http://t.co/Mle7z65V","date":"Tue Jan 08 19:20:18 MST 2013"},{"aspect":"self_created","tweet":"@spike3434 U R right.That would be an interesting segment. I think we are doing something tomorrow on guns. I'll see if I can find an expert","date":"Tue Jan 08 19:19:44 MST 2013"},{"aspect":"self_created","tweet":"RT @PeteDominick: RT @hiitsdustin: Today's Stand Up! w/ @PeteDominick: Guest Host @rickungar w/ @sarahkliff, @rickjacobs, @gregorytangel ...","date":"Tue Jan 08 12:29:33 MST 2013"},{"aspect":"self_created","tweet":"@MysteryOnward @tsj_washington Black sheep, eh? I guess that's one way to look at it. Whatever I play, I find it stimulating and fun so....","date":"Mon Jan 07 21:17:34 MST 2013"},{"aspect":"self_created","tweet":"@tsj_washington @mysteryonward someone thought I was a conservative? I sure don't get that every day!!","date":"Mon Jan 07 20:41:16 MST 2013"},{"aspect":"self_created","tweet":"Guest hosting today’s SUW @PeteDominick w/ Bob Baer- rbaerdc@aol.com, @PeterBeinart,@SullyCNBC and @AlfredSchultz and @HiltsDustin. 3pmEST!","date":"Mon Jan 07 12:07:58 MST 2013"},{"aspect":"self_created","tweet":"Seriously...why was RGIII still in this game? What were the Shanahans thinking?","date":"Sun Jan 06 17:10:16 MST 2013"},{"aspect":"self_created","tweet":"@wolfpac_five @PeteDominick Won't have to wait long. I'll be guest hosting all this week!","date":"Sun Jan 06 14:31:20 MST 2013"},{"aspect":"self_created","tweet":"Still Believe That Barack Obama Seeks A Permanent American Socialist State? - Forbes http://t.co/UNEG3Jwy","date":"Sun Jan 06 13:18:27 MST 2013"},{"aspect":"self_created","tweet":"@KamaainaInOC They are supposed to be! That's what makes it a show. Go Bucs!!","date":"Sun Jan 06 08:06:59 MST 2013"},{"aspect":"self_created","tweet":"@KamaainaInOC Is that a nice thing to say about a fellow Buckeye?","date":"Sun Jan 06 07:46:14 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws As i said, review your tweets. Kind of hard to get around it when it is in writing, yes?","date":"Fri Jan 04 18:52:48 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws Like I said, come back to me at the end of the month. And review your tweets. You ain't foolin' nobody. You knew none of this,","date":"Fri Jan 04 17:23:31 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws Read that story from Fox News..and then go away.","date":"Fri Jan 04 17:09:44 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws \n\"Now, it appears the House will move forward with a vote on the full $60 billion, in two installments.\"\n http://t.co/rP9oIEpN","date":"Fri Jan 04 17:09:27 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws You can tweet me at the end of the month when part 2 of the House bill passes with everything in the Senate bill.","date":"Fri Jan 04 17:05:00 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws I'm sure you are not.","date":"Fri Jan 04 17:04:15 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws i never cease to be amazed how strongly people can feel about something when they are completely misinformed. I'd be embarrassed","date":"Fri Jan 04 17:03:58 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws My mistake. I assumed you knew what you were talking about. Do your homework before you waste my time. Please. I'd do it for you.","date":"Fri Jan 04 17:02:57 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws The second bill goes up in the House in two weeks with the rest of the senate provisions including the pork.","date":"Fri Jan 04 17:02:28 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws Ah..you're just misinformed. My story is about the senate. The first bill went up in the house today and separated it.","date":"Fri Jan 04 17:01:33 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws I'd love to know if you do as that might indicate the story scared them off.","date":"Fri Jan 04 16:33:23 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws Can you provide ANY authority suggesting they are turning it down?","date":"Fri Jan 04 16:32:31 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws I'm sorry but that is incorrect. It was in the bill and you can be sure they are taking it!","date":"Fri Jan 04 16:31:28 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws I completely agree and I've written as much. But that doesn't alter the clear hypocrisy of GOP deficit hawks taking the pork $.","date":"Fri Jan 04 16:11:17 MST 2013"},{"aspect":"self_created","tweet":"GOP Congressmen Who Begged For Federal Aid In Disasters Striking Home Districts Vote Against Sandy Aid - Forbes http://t.co/9Jr6zNal","date":"Fri Jan 04 15:43:12 MST 2013"},{"aspect":"self_created","tweet":"@ComfyPaws how does it not? Didn't say the pork was all going to GOP. Merely highlighting the hypocrisy of deficit hawks taking the money.","date":"Fri Jan 04 12:19:46 MST 2013"},{"aspect":"self_created","tweet":"@RepKarenBass @AP Congratulations Karen!!!!","date":"Fri Jan 04 07:33:07 MST 2013"},{"aspect":"self_created","tweet":"Pork Holding Up Senate Sandy Relief Bill Funneled Into The Troughs Of GOP Deficit Hawks? You Betcha. - Forbes http://t.co/i3KvmcS3","date":"Thu Jan 03 18:34:15 MST 2013"},{"aspect":"self_created","tweet":"@wolfpac_five @PeteDominick @current @JohnFugelsang Ha! John and I are friends but it was coincidence that we were together on SUPD.","date":"Wed Jan 02 19:36:11 MST 2013"}]}