{"user_name":"levie","user_timeline":[{"aspect":"self_created","tweet":"If you resist disrupting yourself before it's necessary, you won't be in a position to do so by the time it is.","date":"Tue Apr 16 16:24:02 MDT 2013"},{"aspect":"self_created","tweet":"The Future:  Person A: \"What time is it?\" Person B: \"Sorry, my watch just blue screen of deathed\"","date":"Tue Apr 16 14:25:47 MDT 2013"},{"aspect":"self_created","tweet":"We've been at this civilization thing now for about 10,000 years. It feels like we should have gotten better by now.","date":"Mon Apr 15 22:44:41 MDT 2013"},{"aspect":"self_created","tweet":"So Microsoft is working on its own Smart Watch. Perfect for all those times you need to modify an Excel spreadsheet on your wrist.","date":"Mon Apr 15 11:45:09 MDT 2013"},{"aspect":"self_created","tweet":"It's estimated that $20 billion of the government's $80 billion in annual IT spending is wasted. Unrelated: happy tax day!","date":"Mon Apr 15 11:25:36 MDT 2013"},{"aspect":"self_created","tweet":"27 years ago, a 12 pound laptop with 10MB of memory cost you $9,135 (in today's dollars). God bless Moore's Law.","date":"Sun Apr 14 22:01:40 MDT 2013"},{"aspect":"self_created","tweet":"Your time horizon matters more than almost anything else as a startup. The longer you're in the game, the more shots you can take.","date":"Sun Apr 14 14:42:44 MDT 2013"},{"aspect":"self_created","tweet":"\"The nature of the PC marketplace is changing in ways that may reduce Microsoft's software sales & revenue growth\" -Microsoft, 2000","date":"Sun Apr 14 14:20:11 MDT 2013"},{"aspect":"self_created","tweet":"Doing something that doesn't end up working > Not doing something because of the fear it won't work","date":"Sat Apr 13 20:39:49 MDT 2013"},{"aspect":"self_created","tweet":"Start with the assumption that the best way to do something is not the way it's being done right now.","date":"Sat Apr 13 16:37:00 MDT 2013"},{"aspect":"self_created","tweet":"Not a lot of tweets coming out of Coachella. And you know who's fine with that? Everyone.","date":"Sat Apr 13 13:16:24 MDT 2013"},{"aspect":"self_created","tweet":"How do you avoid disruption? Invent before you have to. http://t.co/7m0s6SPh0Y","date":"Sat Apr 13 12:53:59 MDT 2013"},{"aspect":"self_created","tweet":"The product that wins is the one that bridges customers to the future, not the one that requires a giant leap.","date":"Fri Apr 12 23:25:29 MDT 2013"},{"aspect":"self_created","tweet":"\"Must. Get. More. Bitcoins.\" - http://t.co/4tO81EeU6v","date":"Fri Apr 12 10:01:41 MDT 2013"},{"aspect":"self_created","tweet":"Sleep, Eat, Stay ahead of competition. Choose 2.","date":"Thu Apr 11 23:30:57 MDT 2013"},{"aspect":"self_created","tweet":"So apparently the Winklevii own 1% of all Bitcoins. If that's not the making of an Aaron Sorkin movie, I don't know what is.","date":"Thu Apr 11 16:57:25 MDT 2013"},{"aspect":"self_created","tweet":"The effect of a drop in PC sales is far-reaching: less PCs -> less MS dominance -> more heterogeneity -> more startup opportunity","date":"Thu Apr 11 12:28:27 MDT 2013"},{"aspect":"self_created","tweet":"Andreessen Horowitz and KPCB announce they'll invest in Google Glass apps. Optometrist co-founder is the new technical co-founder.","date":"Wed Apr 10 21:54:14 MDT 2013"},{"aspect":"self_created","tweet":"The value of Beanie Babies dropped dramatically today. Wait, I mean Bitcoins.","date":"Wed Apr 10 15:10:04 MDT 2013"},{"aspect":"self_created","tweet":"Something that may look miserable from the outside is often just a feature of the journey when you're on one. @om @anildash","date":"Wed Apr 10 11:58:35 MDT 2013"},{"aspect":"self_created","tweet":"Epic: 3D printing of human tissue and organ models. Finally, proof that we are advancing as a species. http://t.co/5UxzZGIcRJ","date":"Tue Apr 09 23:13:08 MDT 2013"},{"aspect":"self_created","tweet":"Only 3 types of companies: those that create the future, those that react fast enough to it, and those that die.","date":"Tue Apr 09 19:59:49 MDT 2013"},{"aspect":"self_created","tweet":"Better to go after a bigger market without all the answers, than a smaller market without any questions.","date":"Sun Apr 07 22:19:06 MDT 2013"},{"aspect":"self_created","tweet":"The two largest airplane manufacturers are worth more than the top 18 airlines combined. Remember: in a gold rush, sell the airplane.","date":"Sun Apr 07 13:46:25 MDT 2013"},{"aspect":"self_created","tweet":"You can't build what customers need tomorrow if you're stuck with yesterday’s business model and processes.","date":"Sat Apr 06 18:50:57 MDT 2013"},{"aspect":"self_created","tweet":"If you're attacking the enterprise, the future is about job-specific platforms over monolithic solutions. http://t.co/SglvO3TFJE","date":"Sat Apr 06 17:55:23 MDT 2013"},{"aspect":"self_created","tweet":"Traditional enterprise technology vendors are losing because they've put together football teams when the new game is tennis.","date":"Sat Apr 06 14:41:18 MDT 2013"},{"aspect":"self_created","tweet":"If it's not hard to do, you should be worried that it's not enough.","date":"Fri Apr 05 23:12:10 MDT 2013"},{"aspect":"self_created","tweet":"App developers after Zuckerberg said phones should be about people not apps: http://t.co/P4f7hSN62N","date":"Fri Apr 05 11:42:42 MDT 2013"},{"aspect":"self_created","tweet":"Facebook wins for best disruption. Google wins for most open platform. The only company that lost today was Apple.","date":"Thu Apr 04 19:31:41 MDT 2013"},{"aspect":"self_created","tweet":"Facebook just got the value of having an operating system without any of the cost. Developers will have to integrate if it's adopted.","date":"Thu Apr 04 15:37:34 MDT 2013"},{"aspect":"self_created","tweet":"\"Whose bright idea was it to make this operating system open?\" - a meeting going on at Google right now.","date":"Thu Apr 04 11:45:54 MDT 2013"},{"aspect":"self_created","tweet":"Lots of innovation in the browser world today with Chrome and Mozilla. Internet Explorer is all like, http://t.co/4NcgGtidpn","date":"Wed Apr 03 20:12:15 MDT 2013"},{"aspect":"self_created","tweet":"When big companies enter your space, they may be able to copy your ideas, but won't be able to copy your intent.","date":"Wed Apr 03 17:03:25 MDT 2013"},{"aspect":"self_created","tweet":"The first mobile phone call was made 40 years ago today. All with the vision of eventually letting people share Vines of their food.","date":"Wed Apr 03 12:42:19 MDT 2013"},{"aspect":"self_created","tweet":"Square and Box joining forces: announcing Polyhedron. All your favorite shapes, in one. http://t.co/UIWP63W5Dn","date":"Mon Apr 01 14:42:06 MDT 2013"},{"aspect":"self_created","tweet":"Today's April Fools jokes are tomorrow's well-funded startups.","date":"Mon Apr 01 10:51:40 MDT 2013"},{"aspect":"self_created","tweet":"Google is the one company whose April Fools jokes are more realistic than their actual products.","date":"Mon Apr 01 00:24:38 MDT 2013"},{"aspect":"self_created","tweet":"Easy April Fools joke: show up to work tomorrow with a windows phone.","date":"Sun Mar 31 17:28:17 MDT 2013"},{"aspect":"self_created","tweet":"All platforms supported. http://t.co/4ii4LYHqr3","date":"Sat Mar 30 15:08:26 MDT 2013"},{"aspect":"self_created","tweet":"School is remarkably good at teaching you what happened in the past, but is remarkably bad at teaching you how to build the future.","date":"Fri Mar 29 21:42:32 MDT 2013"},{"aspect":"self_created","tweet":"\"Startup\" is just a longer word for \"chaos\"","date":"Fri Mar 29 20:13:09 MDT 2013"},{"aspect":"self_created","tweet":"\"We have our own Android OS\" is the new \"we have a mobile app.\"","date":"Thu Mar 28 23:39:32 MDT 2013"},{"aspect":"self_created","tweet":"So wait. Google, whose vision is to organize the world's information, shuts down Google Reader. Then reincarnates Webvan.","date":"Thu Mar 28 11:54:05 MDT 2013"},{"aspect":"self_created","tweet":"The secret to entrepreneurship is having 100% conviction with only 80% of the answer.","date":"Wed Mar 27 22:38:43 MDT 2013"},{"aspect":"self_created","tweet":"\"Good things come to those who wait\" - somebody trying to hold somebody else back.","date":"Wed Mar 27 12:17:23 MDT 2013"},{"aspect":"self_created","tweet":"Step 1: Do something no one has done before. Step 2: Repeat.","date":"Tue Mar 26 22:44:24 MDT 2013"},{"aspect":"self_created","tweet":"= > ‚‰†","date":"Tue Mar 26 10:52:14 MDT 2013"},{"aspect":"self_created","tweet":"The story of Passover serves to remind us of how hard life was before we had smartphones.","date":"Mon Mar 25 20:36:44 MDT 2013"},{"aspect":"self_created","tweet":"Fun fact: Yahoo just acquired a company whose founder was born after Yahoo was started. Carry on.","date":"Mon Mar 25 11:09:06 MDT 2013"},{"aspect":"self_created","tweet":"We now only hire from Florida Gulf Coast University.","date":"Sun Mar 24 19:31:10 MDT 2013"},{"aspect":"self_created","tweet":"The best startups make markets bigger, not just extract all the value out of an existing one.","date":"Sun Mar 24 18:44:23 MDT 2013"},{"aspect":"self_created","tweet":"Once you start playing by the competition's rules, you've already lost.","date":"Sat Mar 23 20:09:41 MDT 2013"},{"aspect":"self_created","tweet":"Startups are like playing simultaneous games of chess, against the best opponents in the world, and you don't even have all the pieces.","date":"Sat Mar 23 13:42:40 MDT 2013"},{"aspect":"self_created","tweet":"\"We have too many engineers,\" said no startup ever.","date":"Fri Mar 22 20:56:43 MDT 2013"},{"aspect":"self_created","tweet":"It's astonishing that Harvard didn't win basketball games in previous years. http://t.co/zYX6ne7748","date":"Fri Mar 22 11:17:45 MDT 2013"},{"aspect":"self_created","tweet":"Somewhere, a Winklevoss is taking credit for tonight's win.","date":"Thu Mar 21 23:23:09 MDT 2013"},{"aspect":"self_created","tweet":"Twitter now 7 years old. It seems like only yesterday that we didn't have an easy way to post mostly irrelevant things on the Internet.","date":"Thu Mar 21 12:30:40 MDT 2013"},{"aspect":"self_created","tweet":"Oracle revenue down year over year. Turns out this whole cloud thing is pretty disruptive after all.","date":"Wed Mar 20 21:29:52 MDT 2013"},{"aspect":"self_created","tweet":"Google Keep: Save what's on your mind. Until we shut it down.","date":"Wed Mar 20 14:49:18 MDT 2013"},{"aspect":"self_created","tweet":"Simplification isn't about limiting what you do, it's about limiting what the customer sees.","date":"Tue Mar 19 23:15:56 MDT 2013"},{"aspect":"self_created","tweet":"\"It's like Snapchat, but for your watch\" - VC pitches in 6 months.","date":"Tue Mar 19 12:27:59 MDT 2013"},{"aspect":"self_created","tweet":"What we will all look like in 1 year: http://t.co/oPEmdQCSMR","date":"Tue Mar 19 10:40:35 MDT 2013"},{"aspect":"self_created","tweet":"Entrepreneurship: 90% proving others wrong, 10% everything else.","date":"Sun Mar 17 15:45:37 MDT 2013"},{"aspect":"self_created","tweet":"It's all fun and games until Apple makes a page listing its benefits over Samsung phones.","date":"Sun Mar 17 14:10:21 MDT 2013"},{"aspect":"self_created","tweet":"Apparently congressmen are only capable of supporting change when their family is affected, not based on empathy or data. Cool.","date":"Sat Mar 16 08:27:31 MDT 2013"},{"aspect":"self_created","tweet":"Google, call me first if you decide to shut down Gmail.","date":"Fri Mar 15 12:15:18 MDT 2013"},{"aspect":"self_created","tweet":"Samsung now has 3 CEOs. It's like, damn, hook Groupon up.","date":"Thu Mar 14 23:10:40 MDT 2013"},{"aspect":"self_created","tweet":"You have to hand it to a company that was once probably best known for making refrigerators for dominating the phone market like this.","date":"Thu Mar 14 20:23:30 MDT 2013"},{"aspect":"self_created","tweet":"Shutting down products is the new launching products.","date":"Thu Mar 14 06:44:49 MDT 2013"},{"aspect":"self_created","tweet":"Google just clarified for the Internet what \"beta\" means.","date":"Wed Mar 13 19:55:03 MDT 2013"},{"aspect":"self_created","tweet":"Google Reader shutting down. Twitter killed the RSS star.","date":"Wed Mar 13 19:31:28 MDT 2013"},{"aspect":"self_created","tweet":"Apparently black smoke from the Groupon HQ also means a CEO has not been selected yet.","date":"Wed Mar 13 09:12:33 MDT 2013"},{"aspect":"self_created","tweet":"You don't know what's possible until you try things that you thought weren't.","date":"Mon Mar 11 17:37:00 MDT 2013"},{"aspect":"self_created","tweet":"The more you take as a given, the less you can change.","date":"Sun Mar 10 17:31:58 MDT 2013"},{"aspect":"self_created","tweet":"\"SXSW is lame\" - people that wish they were at SXSW.","date":"Sun Mar 10 16:18:29 MDT 2013"},{"aspect":"self_created","tweet":"If everything goes according to plan, then your plan was too easy.","date":"Fri Mar 08 23:08:37 MST 2013"},{"aspect":"self_created","tweet":"I hereby take back every mean thing I've ever said about Bush. http://t.co/vf3eqY0W0B","date":"Fri Mar 08 16:33:19 MST 2013"},{"aspect":"self_created","tweet":"We've really just been beta testers of the internet for the last 2 decades. The biggest disruptions are yet to come.","date":"Fri Mar 08 13:11:35 MST 2013"},{"aspect":"self_created","tweet":"The first rule of SXSW is: you always talk about SXSW.","date":"Fri Mar 08 11:28:19 MST 2013"},{"aspect":"self_created","tweet":"SXSW is just Twitter in real life.","date":"Fri Mar 08 09:12:48 MST 2013"},{"aspect":"self_created","tweet":"What a coincidence. I was just thinking to myself the other day, Facebook needs to be more like a newspaper.","date":"Thu Mar 07 14:33:33 MST 2013"},{"aspect":"self_created","tweet":"Market: We think Dell is worth X. Michael Dell: Ok, I will buy Dell for X and then some. Market: Woah, no way, you're worth way more.","date":"Wed Mar 06 13:32:32 MST 2013"},{"aspect":"self_created","tweet":"Some see a \"market leader,\" others see a slow incumbent holding back a market from its full potential.","date":"Tue Mar 05 21:43:31 MST 2013"},{"aspect":"self_created","tweet":"Based on the success of Dennis Rodman's diplomacy in North Korea, I hope they're preparing to send Michael Jordan to Iran.","date":"Mon Mar 04 00:01:39 MST 2013"},{"aspect":"self_created","tweet":"\"I have to get my ducks in a row\" - one of the few lines shared by businesspeople and duck enthusiasts.","date":"Sun Mar 03 18:17:09 MST 2013"},{"aspect":"self_created","tweet":"Scale as an advantage erodes as \"economies of scale\" in computing, labor, or manufacturing can now be rented. This changes everything.","date":"Sat Mar 02 21:00:39 MST 2013"},{"aspect":"self_created","tweet":"That awkward moment when you're a slow moving incumbent and the rest of the world not only realizes it, but can do something about it.","date":"Sat Mar 02 19:58:23 MST 2013"},{"aspect":"self_created","tweet":"Often the best work you do you'll be doing for the first time.","date":"Sat Mar 02 12:46:10 MST 2013"},{"aspect":"self_created","tweet":"Babe Ruth's startup advice: \"It's hard to beat a person who never gives up.\"","date":"Fri Mar 01 21:53:23 MST 2013"},{"aspect":"self_created","tweet":"We're approaching the end of IT scarcity: instead of getting a little value from a few enterprise vendors, we'll get a lot from many.","date":"Fri Mar 01 20:44:51 MST 2013"},{"aspect":"self_created","tweet":"Your only job: shrinking the time between \"idea\" and \"reality.\"","date":"Fri Mar 01 00:45:17 MST 2013"},{"aspect":"self_created","tweet":"FYI: now would be a bad time to pitch venture capitalists on your daily deals startup.","date":"Thu Feb 28 16:53:31 MST 2013"},{"aspect":"self_created","tweet":"Dear investors: the next time you think a coupon company should sustain unprecedented growth rates indefinitely, don't.","date":"Thu Feb 28 15:27:04 MST 2013"},{"aspect":"self_created","tweet":"The story of Groupon shouldn't be about Andrew Mason as a CEO, but the irrationality of markets.","date":"Thu Feb 28 15:13:28 MST 2013"},{"aspect":"self_created","tweet":"The amount of \"unsexy\" problems left to be solved far outnumbers the \"sexy\" problems that have already been solved.","date":"Wed Feb 27 23:59:26 MST 2013"},{"aspect":"self_created","tweet":"No sense denying the future: http://t.co/qIs4JZnMuF","date":"Wed Feb 27 22:50:34 MST 2013"},{"aspect":"self_created","tweet":"Phew. Snapchat is finally sued by someone claiming to be a founder. Now they've actually made it.","date":"Wed Feb 27 15:17:09 MST 2013"},{"aspect":"self_created","tweet":"One company's solved problem is another company's disruption opportunity.","date":"Tue Feb 26 23:56:42 MST 2013"},{"aspect":"self_created","tweet":"#ifihadglass I'd walk around small towns and ask people what year it is. Then see if they happen to have any spare plutonium.","date":"Tue Feb 26 19:06:30 MST 2013"},{"aspect":"self_created","tweet":"Breaking: New images of Yahoo HQ: http://t.co/9iIEjP1tH3","date":"Tue Feb 26 15:04:12 MST 2013"},{"aspect":"self_created","tweet":"Yahoo can't simultaneously dramatically change the direction of where they're going while also doing everything as they have before.","date":"Mon Feb 25 23:44:32 MST 2013"},{"aspect":"self_created","tweet":"Going to be awkward if we find out Daniel Day-Lewis has been doping this whole time.","date":"Sun Feb 24 23:13:13 MST 2013"},{"aspect":"self_created","tweet":"Hard to take an award show seriously that didn't have Nicolas Cage nominated for anything.","date":"Sun Feb 24 23:01:33 MST 2013"},{"aspect":"self_created","tweet":"Who needs to actually go to the Oscars when you can just be totally confused by reading bursts of reactions on Twitter?","date":"Sun Feb 24 19:39:17 MST 2013"},{"aspect":"self_created","tweet":"\"If we don't live stream the Oscars, maybe people will forget about the internet and we can go back to VHS\" -Hollywood","date":"Sun Feb 24 19:20:28 MST 2013"},{"aspect":"self_created","tweet":"Better to be too early and have to try again, than be too late and have to catch up.","date":"Sat Feb 23 23:17:49 MST 2013"},{"aspect":"self_created","tweet":"\"One day I expect a large search engine to turn all of these ideas into reality\" - Creator of the Jetsons.","date":"Sat Feb 23 19:43:38 MST 2013"},{"aspect":"self_created","tweet":"Google/Microsoft strategies revealed: http://t.co/yDHbjuOHVz","date":"Sat Feb 23 19:38:36 MST 2013"},{"aspect":"self_created","tweet":"\"All the interesting problems have already been solved\" - someone that doesn't understand the tech industry.","date":"Sat Feb 23 14:00:02 MST 2013"},{"aspect":"self_created","tweet":"Meeting at Google: Person 1: \"So, who is left to disrupt?\" Person 2: \"LensCrafters?\"","date":"Fri Feb 22 19:46:04 MST 2013"},{"aspect":"self_created","tweet":"Google is making laptops. Apple is making watches. I better be able to buy an Oracle phone by the end of the year.","date":"Thu Feb 21 22:04:52 MST 2013"},{"aspect":"self_created","tweet":"Apple watch is apparently a digital snap bracelet. 10 year old girls are going crazy right now. http://t.co/g2GVSO6N2N","date":"Thu Feb 21 11:21:47 MST 2013"},{"aspect":"self_created","tweet":"Cloud does to incumbent technology vendors what the MP3 did to the music business. And the responses are almost the same.","date":"Tue Feb 19 23:33:23 MST 2013"},{"aspect":"self_created","tweet":":-)  :-)  ;-)  :-)  :-)  ;-)  :-)  :-)  Do the Harlem Shake.  o_O  ;D  >_<  ^_^  :-P  O_o  :-O  ‡²†_‡²†","date":"Tue Feb 19 20:53:05 MST 2013"},{"aspect":"self_created","tweet":"Abstract everything: the more work you put into the back-end, the less work users have to do on the front-end.","date":"Mon Feb 18 14:48:04 MST 2013"},{"aspect":"self_created","tweet":"Anyone outside the US: Today is George Washington's Birthday. Therefore, we have online sales, and car dealerships offer great deals.","date":"Mon Feb 18 14:01:06 MST 2013"},{"aspect":"self_created","tweet":"If people don't think the odds are against you, you're doing it wrong.","date":"Sun Feb 17 21:39:53 MST 2013"},{"aspect":"self_created","tweet":"\"Brick and mortar retail is dead.\" - Every tech company until they open their own stores. http://t.co/Pa1ffNWH","date":"Sun Feb 17 10:52:50 MST 2013"},{"aspect":"self_created","tweet":"On one hand it's like, \"Neat, rocks are falling from space.\" But on the other hand it's like, \"HOLY SHIT, ROCKS ARE FALLING FROM SPACE\"","date":"Fri Feb 15 11:38:52 MST 2013"},{"aspect":"self_created","tweet":"Somewhere, a Mayan is chuckling.","date":"Fri Feb 15 00:31:08 MST 2013"},{"aspect":"self_created","tweet":"In a strange twist, it will probably turn out that only North Korea is prepared to defend against meteor attacks.","date":"Thu Feb 14 23:30:00 MST 2013"},{"aspect":"self_created","tweet":"Customers have most of the answers, it's just that companies often mess up the questions.","date":"Thu Feb 14 21:54:33 MST 2013"},{"aspect":"self_created","tweet":"We can only assume Exxon is behind all this Tesla controversy.","date":"Thu Feb 14 20:39:37 MST 2013"},{"aspect":"self_created","tweet":"Looking forward to the new CBS series, CSI: Tesla","date":"Thu Feb 14 19:30:07 MST 2013"},{"aspect":"self_created","tweet":"You only get the benefit of a first mover advantage if you continue get farther down the curve faster than everyone else.","date":"Wed Feb 13 12:55:31 MST 2013"},{"aspect":"self_created","tweet":"If you don't like competition, you're in the wrong business.","date":"Tue Feb 12 23:50:28 MST 2013"},{"aspect":"self_created","tweet":"It would be hard to argue that America wouldn't be better off if we just did all those things in the next 4 years.","date":"Tue Feb 12 20:20:53 MST 2013"},{"aspect":"self_created","tweet":"That moment when the competition executes your 2008 roadmap.","date":"Tue Feb 12 14:04:20 MST 2013"},{"aspect":"self_created","tweet":"Unfortunate to see North Korea wasting so much energy on nukes, when they could just be making really great Android tablets instead.","date":"Mon Feb 11 22:49:51 MST 2013"},{"aspect":"self_created","tweet":"Startups = (Chaos) x (Ambiguity)","date":"Mon Feb 11 20:58:51 MST 2013"},{"aspect":"self_created","tweet":"Microsoft is setup for a massive comeback once the 80-inch computer market takes off. http://t.co/zWt5jz3g","date":"Mon Feb 11 20:38:00 MST 2013"},{"aspect":"self_created","tweet":"So the Pope has resigned. Activist shareholders sure are getting more aggressive these days.","date":"Mon Feb 11 11:33:32 MST 2013"},{"aspect":"self_created","tweet":"Any product that isn't evolving in fundamental ways at a rate faster than Moore's Law is fundamentally outdated.","date":"Mon Feb 11 00:45:11 MST 2013"},{"aspect":"self_created","tweet":"I find it hard to believe that Apple thinks they can make a better watch than *this*: http://t.co/iXovNKkr","date":"Sun Feb 10 21:35:12 MST 2013"},{"aspect":"self_created","tweet":"Apple rumored to be making a watch. And now, a moment of silence for Casio.","date":"Sun Feb 10 13:56:30 MST 2013"},{"aspect":"self_created","tweet":"Building technology is just a really elaborate way of making predictions about the future.","date":"Sat Feb 09 20:48:47 MST 2013"},{"aspect":"self_created","tweet":"Never give up: They said Neil Armstrong wouldn't land on the moon. That Newton couldn't discover gravity. Or that Snapchat would never work.","date":"Sat Feb 09 13:55:12 MST 2013"},{"aspect":"self_created","tweet":"If Snapchat is the next Facebook, then I officially give up. And by \"give up,\" I mean join Snapchat and probably have a blast.","date":"Sat Feb 09 11:48:07 MST 2013"},{"aspect":"self_created","tweet":"Snapchat raises a ludicrous amount of money at a ludicrous valuation. Which is exactly what people said about Facebook in 2005.","date":"Sat Feb 09 11:21:43 MST 2013"},{"aspect":"self_created","tweet":"Why we do what we do: that moment when you get to see the future on your computer screen before the rest of the world.","date":"Thu Feb 07 23:02:10 MST 2013"},{"aspect":"self_created","tweet":"Linkedin has a patent on beating its numbers. Total domination.","date":"Thu Feb 07 15:43:27 MST 2013"},{"aspect":"self_created","tweet":"Most important launches in mail history: 1792: US Post Office launched. 1832: The Telegraph launched. 2013: Mailbox is launched.","date":"Thu Feb 07 11:44:46 MST 2013"},{"aspect":"self_created","tweet":"Often it's not the conclusion that sets the disruptor and disrupted apart, but the speed at which they act on it.","date":"Wed Feb 06 22:45:20 MST 2013"},{"aspect":"self_created","tweet":"\"I saw this video about how scary Gmail is and so I use http://t.co/xL5MKj7O,\" said 1-2 people who just discovered the internet.","date":"Wed Feb 06 22:05:08 MST 2013"},{"aspect":"self_created","tweet":"Imagine having extraordinarily talented people, training them to be even more talented, then telling them to leave. Welcome to the US.","date":"Wed Feb 06 19:20:08 MST 2013"},{"aspect":"self_created","tweet":"2 kinds of entrepreneurs in this world: those that acquire their own company for $24 billion, and everyone else.","date":"Wed Feb 06 09:31:24 MST 2013"},{"aspect":"self_created","tweet":"\"I wish I had waited longer to do a startup,\" said no one ever. Just go do it.","date":"Tue Feb 05 23:34:05 MST 2013"},{"aspect":"self_created","tweet":"2012: The year of the IPO. 2013: The year of going private. Trends change fast in this industry.","date":"Tue Feb 05 08:56:43 MST 2013"},{"aspect":"self_created","tweet":"99.9% of companies could not have transitioned from shipping DVDs, to streaming movies, to making TV shows. All under fire.","date":"Mon Feb 04 15:26:26 MST 2013"},{"aspect":"self_created","tweet":"Netflix is extremely badass to be making its own shows. This company always avoids disruption like a boss.","date":"Mon Feb 04 15:15:31 MST 2013"},{"aspect":"self_created","tweet":"I feel like the Super Bowls that happened before Twitter existed shouldn't count.","date":"Mon Feb 04 08:56:28 MST 2013"},{"aspect":"self_created","tweet":"Laugh now, but when self-driving cars are eligible to play in the Super Bowl, who do you think will win *then*?","date":"Sun Feb 03 21:15:38 MST 2013"},{"aspect":"self_created","tweet":"This will be a good week to pitch your power outage startup.","date":"Sun Feb 03 19:41:43 MST 2013"},{"aspect":"self_created","tweet":"96% sure China is behind all of this.","date":"Sun Feb 03 18:52:02 MST 2013"},{"aspect":"self_created","tweet":"See, this is why you don't control your Super Bowl lights with AWS.","date":"Sun Feb 03 18:43:28 MST 2013"},{"aspect":"self_created","tweet":"So many dudes will be humming \"all the single ladies\" this week.","date":"Sun Feb 03 18:25:50 MST 2013"},{"aspect":"self_created","tweet":"Ok, looks like we're going to have the turn off the internet for Baltimore next week.","date":"Sun Feb 03 17:51:22 MST 2013"},{"aspect":"self_created","tweet":"GoDaddy just nailed the startup process on that one.","date":"Sun Feb 03 17:24:56 MST 2013"},{"aspect":"self_created","tweet":"This is the opposite of how things should be going right now.","date":"Sun Feb 03 16:40:48 MST 2013"},{"aspect":"self_created","tweet":"Dear kids, study computer science. Unless you're good enough to play professional baseball or football. We like that too.","date":"Sun Feb 03 12:26:25 MST 2013"},{"aspect":"self_created","tweet":"If you don't find yourself asking \"Is the world ready for this?\" you should go back to the drawing board.","date":"Sat Feb 02 13:26:31 MST 2013"},{"aspect":"self_created","tweet":"Groundhogs just don't seem as useful once you have a weather app on your phone.","date":"Sat Feb 02 09:00:02 MST 2013"},{"aspect":"self_created","tweet":"Definition of opportunity: Any time you ask 10 potential customers how they solve a problem and you get 10 different answers.","date":"Fri Feb 01 21:38:32 MST 2013"},{"aspect":"self_created","tweet":"It's all fun and games until another country hacks your tweets.","date":"Fri Feb 01 20:02:23 MST 2013"},{"aspect":"self_created","tweet":"People's Republic of China is the Best! (Please spare my Twitter)","date":"Fri Feb 01 19:52:26 MST 2013"},{"aspect":"self_created","tweet":"Congrats to all the startups making enterprise software suck less. This Crunchie is for you!","date":"Fri Feb 01 00:08:28 MST 2013"},{"aspect":"self_created","tweet":"Oscars = Best actors. Grammys = Best singers. ESPYS = Best athletes. Crunchies = People that can't do any of those other things.","date":"Thu Jan 31 20:49:11 MST 2013"},{"aspect":"self_created","tweet":"\"Total Facebook user growth slowed to 25%, to 1.06 billion.\" Yes, when 2/5 of the entire internet uses your site, growth will slow.","date":"Thu Jan 31 00:17:58 MST 2013"},{"aspect":"self_created","tweet":"Wait a second. The new Blackberry doesn't have Snapchat. How are real business people supposed to use this thing?","date":"Wed Jan 30 12:41:46 MST 2013"},{"aspect":"self_created","tweet":"Blackberry getting great reviews. Proud day for all of Canada.","date":"Wed Jan 30 12:17:06 MST 2013"},{"aspect":"self_created","tweet":"40% of Fortune 500 companies were founded by immigrants or their children. Now the US is doing something about it. http://t.co/71jrh5s4","date":"Tue Jan 29 21:50:33 MST 2013"},{"aspect":"self_created","tweet":"Amazon does $97M in profit and rises 10%. Apple does $13B in profit and falls 10%. Got it.","date":"Tue Jan 29 17:31:45 MST 2013"},{"aspect":"self_created","tweet":"Yahoo hasn't executed this well since 1994. Unrelated: Yahoo was founded in 1994.","date":"Mon Jan 28 15:26:14 MST 2013"},{"aspect":"self_created","tweet":"The regret of not taking the risky path > the regret of taking the risky path, and failing.","date":"Sun Jan 27 19:21:31 MST 2013"},{"aspect":"self_created","tweet":"The evolution of Twitter: 2007: Food I Like; 2009: Breaking News; 2011: Overthrowing Dictators; 2013: Porn.","date":"Sun Jan 27 18:01:04 MST 2013"},{"aspect":"self_created","tweet":"Well cloud computing was fun while it lasted; now we can just store all our data in DNA strands. http://t.co/tFpdJ9w9","date":"Sun Jan 27 13:25:47 MST 2013"},{"aspect":"self_created","tweet":"Looking forward to a future when seeing ugly enterprise software is more surprising than seeing well-designed software.","date":"Sat Jan 26 20:34:01 MST 2013"},{"aspect":"self_created","tweet":"Exxon now worth more than Apple. Going to be a huge year for oil startups.","date":"Sat Jan 26 15:42:04 MST 2013"},{"aspect":"self_created","tweet":"If anyone has even a mediocre time machine that can only take you back 2 days, buy Netflix stock. Up 70%+.","date":"Fri Jan 25 17:16:40 MST 2013"},{"aspect":"self_created","tweet":"Apple barely made more profit than Google, Microsoft, Amazon and Oracle combined in the last quarter. LAME.","date":"Fri Jan 25 00:47:29 MST 2013"},{"aspect":"self_created","tweet":"In the past 5 months, Apple has lost an entire \"Microsoft\" worth of market cap. That strikes me as extreme.","date":"Thu Jan 24 23:07:09 MST 2013"},{"aspect":"self_created","tweet":"From the makers of the 140 character limit comes the 6 second video limit. Twitter: reversing Moore's law one format at a time.","date":"Thu Jan 24 18:27:44 MST 2013"},{"aspect":"self_created","tweet":"Graph search is a lot of fun: \"People that work at *Microsoft* and use Facebook for *iPhone*\"","date":"Wed Jan 23 22:21:56 MST 2013"},{"aspect":"self_created","tweet":"Apple posts record revenue, wall street reacts: http://t.co/j1ImQMsp","date":"Wed Jan 23 15:51:22 MST 2013"},{"aspect":"self_created","tweet":"Apple down 6% after they announce $54 billion in revenue. This is why we can't have nice things.","date":"Wed Jan 23 15:10:28 MST 2013"},{"aspect":"self_created","tweet":"Apple's earnings in 3 steps: 1. Apple announces it made more money than god. 2. Analysts freak out about something. 3. Repeat.","date":"Wed Jan 23 12:44:14 MST 2013"},{"aspect":"self_created","tweet":"It seems like if you have to go private to innovate and execute, something is wrong with the public markets.","date":"Tue Jan 22 22:51:13 MST 2013"},{"aspect":"self_created","tweet":"If your startup is predictable, you're doing it wrong.","date":"Mon Jan 21 20:09:26 MST 2013"},{"aspect":"self_created","tweet":"Sergey is the only billionaire I'd be afraid to be with alone on a subway. http://t.co/A0TVoaBp","date":"Mon Jan 21 18:45:28 MST 2013"},{"aspect":"self_created","tweet":"Innovation is hard because \"solving problems people didn't know they had\" & \"building something no one needs\" look identical at first.","date":"Sun Jan 20 19:49:29 MST 2013"},{"aspect":"self_created","tweet":"Nerds haven't been this into sports since that time before they were cut from the middle school soccer team.","date":"Sun Jan 20 17:19:25 MST 2013"},{"aspect":"self_created","tweet":"Silicon Valley just needs a good Cricket team and we're unstoppable.","date":"Sun Jan 20 16:36:33 MST 2013"},{"aspect":"self_created","tweet":"This Starbucks in Palo Alto is off the hook with people pounding double lattes and other crazy shit. #niners","date":"Sun Jan 20 16:13:05 MST 2013"},{"aspect":"self_created","tweet":"A good solution will often create more new problems than it solves. This is why opportunity is infinite.","date":"Sun Jan 20 14:58:09 MST 2013"},{"aspect":"self_created","tweet":"5 injured at gun shows around US this weekend. If only we had more guns, this too could have been prevented. http://t.co/Fn1qM2r3","date":"Sun Jan 20 10:34:58 MST 2013"},{"aspect":"self_created","tweet":"\"A journey of a thousand miles begins with a single step\" - ancient Chinese philosopher on startups.","date":"Sat Jan 19 20:06:26 MST 2013"},{"aspect":"self_created","tweet":"The last known athlete to not dope: http://t.co/JDonQ7Mw","date":"Thu Jan 17 22:26:51 MST 2013"},{"aspect":"self_created","tweet":"So Barry Bonds took drugs. Lance Armstrong took drugs. If it turns out The Beatles did drugs, then my childhood was a lie.","date":"Thu Jan 17 22:13:20 MST 2013"},{"aspect":"self_created","tweet":"The problem with America is politicians think their Job is to win elections and their Customers are only those that vote for them.","date":"Wed Jan 16 21:55:27 MST 2013"},{"aspect":"self_created","tweet":"A good reminder: \"We tend to overestimate the effect of a technology in the short run and underestimate the effect in the long run\"","date":"Tue Jan 15 22:39:52 MST 2013"},{"aspect":"self_created","tweet":"Worst graph search engine, ever. http://t.co/ho7wXB1m","date":"Tue Jan 15 17:03:50 MST 2013"},{"aspect":"self_created","tweet":"Honestly, you have to hand it to Microsoft. Their relentless execution with Bing is at least worthy of a golf clap.","date":"Tue Jan 15 15:49:08 MST 2013"},{"aspect":"self_created","tweet":"Disappointment setting in as regular people discover that Facebook launched a graph search engine, not a giraffe search engine.","date":"Tue Jan 15 13:35:26 MST 2013"},{"aspect":"self_created","tweet":"Literally just saw a cannonball fly from Facebook HQ toward mountain view.","date":"Tue Jan 15 11:54:15 MST 2013"},{"aspect":"self_created","tweet":"Facebook's response to Google+: \"Two can play that game\"","date":"Tue Jan 15 11:45:57 MST 2013"},{"aspect":"self_created","tweet":"I would need performance enhancing drugs just to go bike shopping. Online.","date":"Mon Jan 14 23:03:32 MST 2013"},{"aspect":"self_created","tweet":"The gap between \"crazy\" and \"literally impossible\" is where the best ideas are hiding out.","date":"Sun Jan 13 23:20:33 MST 2013"},{"aspect":"self_created","tweet":"I'm confused. None of the nominations for Best Picture appear to be photos of food from Instagram.","date":"Sun Jan 13 20:28:26 MST 2013"},{"aspect":"self_created","tweet":"The optimist sees the glass half full. The pessimist sees the glass half empty. The entrepreneur wonders how much a glass sells for.","date":"Sun Jan 13 12:27:24 MST 2013"},{"aspect":"self_created","tweet":"Silicon Valley is a utopian society where engineers root for football teams, rappers promote technology, and cars drive themselves.","date":"Sat Jan 12 22:04:19 MST 2013"},{"aspect":"self_created","tweet":"For a game that necessitates that one team must lose, people sure do seem surprised when it happens in football.","date":"Sat Jan 12 19:18:32 MST 2013"},{"aspect":"self_created","tweet":"Startups win by being impatient over a long period of time.","date":"Sat Jan 12 18:17:25 MST 2013"},{"aspect":"self_created","tweet":"Really sad about @aaronsw -- this article helped inspire me to leave college and move to the valley: http://t.co/yVI1RV83","date":"Sat Jan 12 11:21:34 MST 2013"},{"aspect":"self_created","tweet":"\"Apple to make a cheap iPhone. Wait, no they're not. Actually, yes they might. FML.\" - Internet","date":"Fri Jan 11 20:24:38 MST 2013"},{"aspect":"self_created","tweet":"Remember: anything meaningful comes with resistance. The world didn't ask to be changed.","date":"Thu Jan 10 22:56:02 MST 2013"},{"aspect":"self_created","tweet":"Facebook's stock is up 75% in the past 4 months. So there's that.","date":"Thu Jan 10 16:09:08 MST 2013"},{"aspect":"self_created","tweet":"The finesse of startups is to solve big problems in the right bite-size chunks.","date":"Wed Jan 09 22:47:35 MST 2013"},{"aspect":"self_created","tweet":"Steve Ballmer is buying a basketball team to bring to Seattle. Google to respond by obsoleting basketball.","date":"Wed Jan 09 15:03:01 MST 2013"},{"aspect":"self_created","tweet":"Facebook shares now at $30. Everyone can go back to liking the Internet again.","date":"Wed Jan 09 11:25:42 MST 2013"},{"aspect":"self_created","tweet":"Just be glad you weren't at CES 25 years ago: \"Dozens of companies showcasing digital TV sets, VCRs, and audio tape recorders\"","date":"Tue Jan 08 23:51:36 MST 2013"},{"aspect":"self_created","tweet":"Apple is rumored to be making a lower cost iPhone for emerging markets like China. Yet another reason to move there.","date":"Tue Jan 08 21:37:45 MST 2013"},{"aspect":"self_created","tweet":"Startups are a battle between insane optimism and sane skepticism.","date":"Sun Jan 06 22:34:26 MST 2013"},{"aspect":"self_created","tweet":"CES: people travel from all over to play with gadgets and not buy anything. Not to be confused with Best Buy.","date":"Sun Jan 06 20:09:07 MST 2013"},{"aspect":"self_created","tweet":"CES is just Burning Man with LCD instead of LSD and more clothes.","date":"Sun Jan 06 18:29:56 MST 2013"},{"aspect":"self_created","tweet":"Entrepreneurship: 10% coach, 20% player, 30% cheerleader, 40% waterboy.","date":"Sat Jan 05 19:38:40 MST 2013"},{"aspect":"self_created","tweet":"Some companies build products, others build the future.","date":"Sat Jan 05 14:59:52 MST 2013"},{"aspect":"self_created","tweet":"If you a miss a cycle in tech, it's basically over. If you hit a cycle, you've only earned admission to the next round.","date":"Fri Jan 04 22:53:38 MST 2013"},{"aspect":"self_created","tweet":"\"Grandpa, tell us about the time when you controlled cars with wheels and pedals\" - Teens in 2033. http://t.co/0I8tagdt","date":"Thu Jan 03 22:10:38 MST 2013"},{"aspect":"self_created","tweet":"The government has declared that Google is not evil. In other news, Google+ accounts will now replace social security numbers.","date":"Thu Jan 03 16:02:09 MST 2013"},{"aspect":"self_created","tweet":"This year, $3.7 trillion will be spent on IT. Instead of collecting taxes, the US government should just sell enterprise software.","date":"Thu Jan 03 11:35:01 MST 2013"},{"aspect":"self_created","tweet":"Microsoft complains they don't get equal access to Youtube APIs. As in, what they did to every company they destroyed in the 90's.","date":"Wed Jan 02 23:24:47 MST 2013"},{"aspect":"self_created","tweet":"Avis buys Zipcar. To hipsters, this must be tantamount to Walgreens buying Instagram.","date":"Wed Jan 02 19:02:53 MST 2013"},{"aspect":"self_created","tweet":"Don't focus on the finish line so much that you miss the adventure. PS, there is no finish line.","date":"Wed Jan 02 12:42:39 MST 2013"},{"aspect":"self_created","tweet":"The world would have been a very different looking place if Bill Gates had started Warby Parker. http://t.co/GkRwCRzk","date":"Tue Jan 01 23:20:40 MST 2013"},{"aspect":"self_created","tweet":"The US government's core competency at this point is averting self-created crises.","date":"Tue Jan 01 21:33:19 MST 2013"},{"aspect":"self_created","tweet":"Stanford wins the Rose Bowl! Riots will be out of control tonight. And by \"riots\" I mean lots of people studying computer science.","date":"Tue Jan 01 18:31:08 MST 2013"},{"aspect":"self_created","tweet":"2013 Prediction: this internet thing will really start to take off. Oh, and QR codes.","date":"Mon Dec 31 18:19:03 MST 2012"},{"aspect":"self_created","tweet":"2012: Yahoo refreshed; Twitter reassessed; Apple aggressed; Google compressed; Microsoft is still a mess.","date":"Mon Dec 31 16:24:00 MST 2012"},{"aspect":"self_created","tweet":"Each new computing paradigm increases the tech market by an order of magnitude. We're just getting started: http://t.co/2cBsjxtY","date":"Sun Dec 30 17:58:39 MST 2012"},{"aspect":"self_created","tweet":"Want a job where you're not measured by what you've accomplished, and that pays $174,000 a year? Join congress.","date":"Sun Dec 30 15:13:58 MST 2012"},{"aspect":"self_created","tweet":"Microsoft goes after Apple, Apple goes after Google, Google goes after Facebook, so naturally Facebook goes after a sexting app.","date":"Sat Dec 29 20:20:05 MST 2012"},{"aspect":"self_created","tweet":"1963 quote: \"The demand for good computer programmers is running far ahead of supply.\" Maybe we'll solve this in another 50 years.","date":"Sat Dec 29 18:29:29 MST 2012"},{"aspect":"self_created","tweet":"The internet this week: http://t.co/oTPootJ9","date":"Fri Dec 28 17:02:29 MST 2012"},{"aspect":"self_created","tweet":"Apparently you can save Snapchat videos forever. A few dozen politicians are freaking out right now.","date":"Fri Dec 28 14:41:46 MST 2012"},{"aspect":"self_created","tweet":"Enterprise disruption occurs because it's easier for a simple product to become advanced than a complex product to become simple.","date":"Thu Dec 27 23:04:32 MST 2012"},{"aspect":"self_created","tweet":"Startups: This holiday season, be thankful for your incumbents. If their products were better, you couldn't exist.","date":"Wed Dec 26 22:32:52 MST 2012"},{"aspect":"self_created","tweet":"Snapchat is a primary communication tool for teens. More proof that the internet should have remained a government research project.","date":"Wed Dec 26 20:10:23 MST 2012"},{"aspect":"self_created","tweet":"After all the mapping disasters this year, it's hard to put too much faith in the accuracy of these Santa tracking tools.","date":"Mon Dec 24 19:36:07 MST 2012"},{"aspect":"self_created","tweet":"Things said in 1997: \"The only sensible conversation to have about Apple is the one in which you argue about how long it will take to die\"","date":"Mon Dec 24 12:37:35 MST 2012"},{"aspect":"self_created","tweet":"Either malls are completely immune to disruption, or way too many people still haven't heard of the internet.","date":"Sun Dec 23 17:43:07 MST 2012"},{"aspect":"self_created","tweet":"Home for the holidays: a reminder that your parents are harder to appease than any venture capitalist.","date":"Sun Dec 23 14:08:29 MST 2012"},{"aspect":"self_created","tweet":"2 kinds of organizations in this world: those that would be worse off if Charlie Sheen ran them, and the NRA.","date":"Sun Dec 23 13:09:34 MST 2012"},{"aspect":"self_created","tweet":"That awkward moment when no one has Poked you yet.","date":"Sat Dec 22 15:29:09 MST 2012"},{"aspect":"self_created","tweet":"The only thing you can count on as a startup is uncertainty.","date":"Sat Dec 22 11:37:51 MST 2012"},{"aspect":"self_created","tweet":"Teens these days will have no idea what life was like before you had multiple sexting apps to choose from.","date":"Fri Dec 21 19:14:44 MST 2012"},{"aspect":"self_created","tweet":"Facebook launches Poke for mobile. Which means, in some small way, the Mayans were right.","date":"Fri Dec 21 16:10:17 MST 2012"},{"aspect":"self_created","tweet":"If the world doesn't end tomorrow, it will be hard to trust anything the Mayans say anymore.","date":"Thu Dec 20 23:18:55 MST 2012"},{"aspect":"self_created","tweet":"If the world does actually end tomorrow, the afterlife better have the new iPhone chargers.","date":"Thu Dec 20 21:53:29 MST 2012"},{"aspect":"self_created","tweet":"Instagram is reverting their terms of service, which means no photos in ads. Internet: 1, Business Models: 0.","date":"Thu Dec 20 19:05:09 MST 2012"},{"aspect":"self_created","tweet":"Twitter archive is like a trip down memory lane. If by \"memory lane\" you mean \"all the things I regret saying on the internet.\"","date":"Wed Dec 19 12:04:22 MST 2012"},{"aspect":"self_created","tweet":"I hear that by agreeing to Instagram's new Terms of Service you also sign away all physical possessions to them.","date":"Tue Dec 18 10:47:24 MST 2012"},{"aspect":"self_created","tweet":"Every time someone says your idea won't work, just remember they also said that to the guy who came up with the typewriter.","date":"Mon Dec 17 22:37:47 MST 2012"},{"aspect":"self_created","tweet":"Deciding between consumer and enterprise? In 2012, global online ad spending was $98 billion; Enterprise software was $281 billion.","date":"Sun Dec 16 23:03:05 MST 2012"},{"aspect":"self_created","tweet":"Microsoft faces more challenges than most realize because personal computing's business model moved from licensing to hardware & ads.","date":"Sun Dec 16 19:06:39 MST 2012"},{"aspect":"self_created","tweet":"The War in Afghanistan started within 27 days of 9/11. Perhaps we can try to solve our own issues as quickly as we can attack others.","date":"Sat Dec 15 14:16:53 MST 2012"},{"aspect":"self_created","tweet":"For a nation that has benefited immensely from progress, we really suck at change.","date":"Sat Dec 15 13:23:31 MST 2012"},{"aspect":"self_created","tweet":"Perspective: NRA's annual budget: ~$250 million. PBS: ~$300 million.","date":"Fri Dec 14 20:49:46 MST 2012"},{"aspect":"self_created","tweet":"So wait, let me get this straight. When you do nothing about a problem, it doesn't just go away on its own? Interesting.","date":"Fri Dec 14 11:53:54 MST 2012"},{"aspect":"self_created","tweet":"Apple Maps officially takes the award for \"shortest time to obsolescence\", right after the Zune.","date":"Thu Dec 13 23:54:20 MST 2012"},{"aspect":"self_created","tweet":"Startups win by solving problems large enough that they matter, but small enough that incumbents don't yet care.","date":"Thu Dec 13 19:17:47 MST 2012"},{"aspect":"self_created","tweet":"Google Maps for iPhone is now live. This must be how people felt when maps started getting the oceans right in the 1500's.","date":"Wed Dec 12 22:07:37 MST 2012"},{"aspect":"self_created","tweet":"The Pope has tweeted 7 times in the past 12 hours. Someone at the Vatican has been binging on social media webinars recently.","date":"Wed Dec 12 14:03:20 MST 2012"},{"aspect":"self_created","tweet":"The battle in enterprise software is moving from being about delivery model to being about design.","date":"Tue Dec 11 23:11:59 MST 2012"},{"aspect":"self_created","tweet":"The inventor of photo filters would be so proud of what has become of the internet.","date":"Mon Dec 10 21:38:29 MST 2012"},{"aspect":"self_created","tweet":"Without Instagram on Twitter, we must all go back to eating our food with no one ever knowing what it looked like in black & white.","date":"Sun Dec 09 21:41:26 MST 2012"},{"aspect":"self_created","tweet":"Anytime you wonder why an international conflict is so hard to resolve, just remember the valley goes to war over photos with filters.","date":"Sun Dec 09 17:24:32 MST 2012"},{"aspect":"self_created","tweet":"The story of Hanukkah is about an oil supply that lasted for eight days instead of one. It's really just a giant ad for the Prius.","date":"Sat Dec 08 15:13:49 MST 2012"},{"aspect":"self_created","tweet":"So the SEC doesn't like Reed Hastings posting Netflix news on Facebook. That's fine, Pinterest is better for these disclosures anyway.","date":"Fri Dec 07 12:19:57 MST 2012"},{"aspect":"self_created","tweet":"FACT: Every time a startup is launched without a business model, a baby panda is captured and put in a zoo.","date":"Thu Dec 06 20:25:39 MST 2012"},{"aspect":"self_created","tweet":"The only question is, who are the 2.9%? http://t.co/Zl3MzVjN","date":"Thu Dec 06 14:42:57 MST 2012"},{"aspect":"self_created","tweet":"The \"Made in America\" Mac is nearly identical to other Macs except that it can only play country music and load http://t.co/TebD2Did.","date":"Thu Dec 06 11:36:35 MST 2012"},{"aspect":"self_created","tweet":"Every industry needs their own Michael Jackson. Ours happened to be make antivirus software.","date":"Wed Dec 05 22:09:56 MST 2012"},{"aspect":"self_created","tweet":"Without the ability to embed Instagram photos in Twitter, it's unclear if the internet offers much value at this point.","date":"Wed Dec 05 12:13:12 MST 2012"},{"aspect":"self_created","tweet":"There's a startup opportunity every time a big company stops questioning its assumptions.","date":"Mon Dec 03 22:08:20 MST 2012"},{"aspect":"self_created","tweet":"News Corp. shuts down The Daily app. Paperboys haven't been this excited since the invention of the three-speed bicycle.","date":"Mon Dec 03 17:16:47 MST 2012"},{"aspect":"self_created","tweet":"You'll often have accomplished more by missing an unattainable goal than hitting an attainable one.","date":"Sat Dec 01 16:58:14 MST 2012"},{"aspect":"self_created","tweet":"Enterprise Software: http://t.co/SKbAvxoO","date":"Fri Nov 30 19:51:46 MST 2012"},{"aspect":"self_created","tweet":"Silicon Valley... http://t.co/0LjMHHzk","date":"Fri Nov 30 12:29:21 MST 2012"},{"aspect":"self_created","tweet":"\"I'm really excited about iTunes 11\" - people that kept going to Tower Records into the 2000s.","date":"Thu Nov 29 22:43:26 MST 2012"},{"aspect":"self_created","tweet":"Enterprise thesis: 1. Expanding markets; 2. Efficient distribution; 3. Software-defined everything; 4. Incumbents in distress; 5. $$$","date":"Thu Nov 29 22:15:55 MST 2012"},{"aspect":"self_created","tweet":"Not that you came to the Internet to read good news, but Facebook is up 40% in the last 20 days.","date":"Thu Nov 29 13:15:54 MST 2012"},{"aspect":"self_created","tweet":"Replacing Andrew Mason doesn't magically make consumers want coupons. He's in the best position to evolve the vision, not a hired CEO.","date":"Wed Nov 28 23:46:15 MST 2012"},{"aspect":"self_created","tweet":"Just an 11 person startup. NBD. http://t.co/i0WJgwYH","date":"Wed Nov 28 21:29:22 MST 2012"},{"aspect":"self_created","tweet":"To the person who's been rain dancing in Silicon Valley: mission accomplished.","date":"Wed Nov 28 12:20:28 MST 2012"},{"aspect":"self_created","tweet":"The goal is to have a job that you don't describe as \"work\".","date":"Tue Nov 27 21:57:57 MST 2012"},{"aspect":"self_created","tweet":"Time + relentless execution is often a solid strategy. Sometimes it's just about outlasting the other guy.","date":"Tue Nov 27 11:31:23 MST 2012"},{"aspect":"self_created","tweet":"Don't just chase after a market. Build a company.","date":"Mon Nov 26 23:32:32 MST 2012"},{"aspect":"self_created","tweet":"Everyone's goal is to hire the best, execute the best, and build the best products. It's discipline setting apart those that do.","date":"Mon Nov 26 22:17:51 MST 2012"},{"aspect":"self_created","tweet":"The Valley has been waiting 15+ years for a Microsoft slip-up: http://t.co/On7dOTJc","date":"Mon Nov 26 21:05:39 MST 2012"},{"aspect":"self_created","tweet":"You know that brief moment when your PC just works flawlessly? Nope, neither do I.","date":"Sun Nov 25 19:29:32 MST 2012"},{"aspect":"self_created","tweet":"Why most companies fail at taking risks: http://t.co/up8WFaJf","date":"Sun Nov 25 18:23:02 MST 2012"},{"aspect":"self_created","tweet":"It's difficult to build *sustainable* consumer internet businesses for the very reason people try: anyone can enter at any point.","date":"Sun Nov 25 16:11:34 MST 2012"},{"aspect":"self_created","tweet":"The problem with consumer tech is it's difficult to build a sustainable business. The problem with enterprise is, well, nothing.","date":"Sun Nov 25 15:55:49 MST 2012"},{"aspect":"self_created","tweet":"The state of engineering recruiting: http://t.co/pKtV45OT","date":"Sun Nov 25 11:25:07 MST 2012"},{"aspect":"self_created","tweet":"20 years ago, the leading tablet computer cost $8,092 (in 2012 dollars) and had a 20MB drive. A moment of silence for Moore's law.","date":"Sat Nov 24 15:36:18 MST 2012"},{"aspect":"self_created","tweet":"\"Politics is the art of looking for trouble, finding it everywhere, diagnosing it incorrectly and applying the wrong remedies\" -Groucho Marx","date":"Sat Nov 24 12:59:54 MST 2012"},{"aspect":"self_created","tweet":"First-mover advantage maybe worked for railroads and oil companies. In tech, it's the best-mover that wins.","date":"Fri Nov 23 21:26:12 MST 2012"},{"aspect":"self_created","tweet":"Today, we are reminded that companies other than Apple sell things.","date":"Fri Nov 23 17:01:31 MST 2012"},{"aspect":"self_created","tweet":"Don't expect anything to come easy unless you solve hard problems.","date":"Wed Nov 21 22:22:10 MST 2012"},{"aspect":"self_created","tweet":"Startups = (What the future looks like) - (What we have today)  http://t.co/2cSzTD2d","date":"Wed Nov 21 18:47:14 MST 2012"},{"aspect":"self_created","tweet":"400 years ago, we were thankful for a good harvest. Today, we are thankful for iPad minis, Twitter, and cloud computing.","date":"Wed Nov 21 12:36:45 MST 2012"},{"aspect":"self_created","tweet":"What if it turned out that there was only one troll on the entire Internet and they just have lots of screen names and opinions.","date":"Tue Nov 20 23:21:56 MST 2012"},{"aspect":"self_created","tweet":"Lots of startups only invent. Lots of big companies only manage. It's those that do both that win. http://t.co/1GZ3E04N","date":"Tue Nov 20 21:14:24 MST 2012"},{"aspect":"self_created","tweet":"This industry is not for the faint of heart: 4 years ago Apple and HP were worth the same amount. Now Apple is worth 25X more.","date":"Tue Nov 20 11:48:50 MST 2012"},{"aspect":"self_created","tweet":"Well that's the story of the century: HP had a market cap of $120B five years ago. A little over $20B today.","date":"Tue Nov 20 10:53:27 MST 2012"},{"aspect":"self_created","tweet":"How Internet Explorer has more than 4% market share should be a mystery to us all, and studied by professors everywhere.","date":"Tue Nov 20 00:22:11 MST 2012"},{"aspect":"self_created","tweet":"If you find yourself with the same thesis as your competition, it's time to keep iterating.","date":"Mon Nov 19 23:12:25 MST 2012"},{"aspect":"self_created","tweet":"Scariest chart in the history of computing (for one company at least): http://t.co/H1yOS4ef","date":"Sun Nov 18 22:04:52 MST 2012"},{"aspect":"self_created","tweet":"California demystified: In Los Angeles, Bieber wins a music award. In Silicon Valley, a wifi company wins a billion dollars.","date":"Sun Nov 18 20:05:02 MST 2012"},{"aspect":"self_created","tweet":"$1B+ enterprise technology acquisitions in 2012: Meraki, Yammer, Nicira, Taleo, Ariba, Quest...","date":"Sun Nov 18 19:11:40 MST 2012"},{"aspect":"self_created","tweet":"The enterprise pivot strikes again. Meraki was founded with consumer vision, went enterprise, sold for $1.2B to Cisco. Rock on.","date":"Sun Nov 18 17:15:28 MST 2012"},{"aspect":"self_created","tweet":"So we'll bail out banks but not Twinkies. Who's setting the priorities of this country?","date":"Sun Nov 18 15:31:49 MST 2012"},{"aspect":"self_created","tweet":"New rules only get defined when the old rules are broken. Companies like Uber and Airbnb are necessary to get any progress.","date":"Fri Nov 16 14:06:37 MST 2012"},{"aspect":"self_created","tweet":"You can't beat incumbents by attacking them head on. Create unfair advantages instead: http://t.co/T1l6UIFq","date":"Fri Nov 16 10:20:45 MST 2012"},{"aspect":"self_created","tweet":"If you're waiting for competitors to innovate before you do, you've already lost.","date":"Thu Nov 15 22:56:41 MST 2012"},{"aspect":"self_created","tweet":"Listen to your customers: they often know where you're going before you do.","date":"Thu Nov 15 12:34:57 MST 2012"},{"aspect":"self_created","tweet":"Momentum is everything: Blackberry had a $60B market cap on $6B in revenue 5 years ago. Today, a $4.4B market cap on $11B in revenue.","date":"Wed Nov 14 23:41:39 MST 2012"},{"aspect":"self_created","tweet":"Microsoft's challenge is that unlike Apple, which has trained us to flock to every update, there's little impetus to upgrade to Win8","date":"Wed Nov 14 22:13:30 MST 2012"},{"aspect":"self_created","tweet":"Remember: Your fiercest competitor is complacency.","date":"Wed Nov 14 18:59:38 MST 2012"},{"aspect":"self_created","tweet":"If design isn't a competency in your company at this point, you're doing it wrong.","date":"Tue Nov 13 20:51:23 MST 2012"},{"aspect":"self_created","tweet":"If you're a government or military official and use Gmail, you might as well just turn yourself in now.","date":"Tue Nov 13 17:45:36 MST 2012"},{"aspect":"self_created","tweet":"Wall Street operates in quarters. Venture Capital in years. Founders in lifetimes.","date":"Tue Nov 13 16:06:27 MST 2012"},{"aspect":"self_created","tweet":"If you live in Seattle and see a bat signal in the air tonight, don't be alarmed. It's just meant for Bill Gates.","date":"Tue Nov 13 11:29:10 MST 2012"},{"aspect":"self_created","tweet":"If you are not being investigated for something by the end of this week, throw a champagne party for yourself.","date":"Mon Nov 12 23:29:32 MST 2012"},{"aspect":"self_created","tweet":"Every time a project requires consensus, a baby koala goes hungry.","date":"Mon Nov 12 23:13:10 MST 2012"},{"aspect":"self_created","tweet":"New best practice: tell the world an operating system is the best thing you've ever done, then let go of its leader.","date":"Mon Nov 12 19:59:24 MST 2012"},{"aspect":"self_created","tweet":"Looking forward to Bravo's upcoming reality show on John McAfee, depicting standard life after the startup.","date":"Mon Nov 12 11:37:17 MST 2012"},{"aspect":"self_created","tweet":"Risk of failure isn't a risk at all.","date":"Sun Nov 11 12:33:48 MST 2012"},{"aspect":"self_created","tweet":"Execute like there's no tomorrow, strategize like there will be.","date":"Sat Nov 10 19:32:05 MST 2012"},{"aspect":"self_created","tweet":"Your best strategy will not *seem* feasible.","date":"Sat Nov 10 15:35:26 MST 2012"},{"aspect":"self_created","tweet":"You'd think the head of the CIA would be better at keeping secrets.","date":"Sat Nov 10 12:23:18 MST 2012"},{"aspect":"self_created","tweet":"Entrepreneurship: http://t.co/T9H0epcc","date":"Sat Nov 10 11:38:46 MST 2012"},{"aspect":"self_created","tweet":"Startups: http://t.co/41rLqoJe","date":"Fri Nov 09 23:52:08 MST 2012"},{"aspect":"self_created","tweet":"When things seem impossible, remember: Apple, Oracle, Sun & Cisco were once just a few people arguing strategy in a cramped room too.","date":"Fri Nov 09 19:31:30 MST 2012"},{"aspect":"self_created","tweet":"Technology meant to accelerate us will always outlast technology meant to take up our time.","date":"Fri Nov 09 12:53:33 MST 2012"},{"aspect":"self_created","tweet":"The secret to avoiding burnout: be on a mission that doesn't suck.","date":"Thu Nov 08 23:39:51 MST 2012"},{"aspect":"self_created","tweet":"The economist in me thinks bad news for Groupon might mean good news for the Economy. Willingness to pay full price for manicures.","date":"Thu Nov 08 15:40:12 MST 2012"},{"aspect":"self_created","tweet":"Foxconn calling our bluff, looking to build manufacturing plants in America. China to take US over in 3-2-1... http://t.co/2HYKaumN","date":"Thu Nov 08 15:13:18 MST 2012"},{"aspect":"self_created","tweet":"Do things differently. Capitalism disproportionately favors those that create or find cracks in a pattern before everyone else.","date":"Thu Nov 08 10:12:10 MST 2012"},{"aspect":"self_created","tweet":"5 strategies to improve America now that the election is over: education, education, education, education and immigration reform.","date":"Wed Nov 07 22:46:02 MST 2012"},{"aspect":"self_created","tweet":"Hard reality of the Nate Silver era: data makes opinions obsolete.","date":"Wed Nov 07 19:43:55 MST 2012"},{"aspect":"self_created","tweet":"Everything comes down to the ease by which you navigate contradictions. Speed vs. Quality; Simplicity vs. Breadth; Lean vs. Scale.","date":"Wed Nov 07 18:38:12 MST 2012"},{"aspect":"self_created","tweet":"It sure would save a lot of time, money, and hassle if we just let Nate Silver choose who is president.","date":"Wed Nov 07 12:28:10 MST 2012"},{"aspect":"self_created","tweet":"\"Shit. Now we have to go do all that stuff he was just talking about.\" - Everyone.","date":"Wed Nov 07 00:08:25 MST 2012"},{"aspect":"self_created","tweet":"Last 2 years could've been easier if Obama had just been giving this speech nightly.","date":"Tue Nov 06 23:55:09 MST 2012"},{"aspect":"self_created","tweet":"We do live in a pretty sweet country.","date":"Tue Nov 06 23:02:25 MST 2012"},{"aspect":"self_created","tweet":"Hope whoever programmed Mitt Romney worked in a good error state.","date":"Tue Nov 06 22:22:04 MST 2012"},{"aspect":"self_created","tweet":"Obama WINS! Unrelated: I hear Bain is hiring: http://t.co/zRpwDLAz","date":"Tue Nov 06 21:16:16 MST 2012"},{"aspect":"self_created","tweet":"On the bright side, now Mitt Romney can claim he's faced adversity.","date":"Tue Nov 06 21:06:36 MST 2012"},{"aspect":"self_created","tweet":"That awkward moment when it's statistically imposssible for you to win the presidency.","date":"Tue Nov 06 20:53:01 MST 2012"},{"aspect":"self_created","tweet":"98% of America right now: http://t.co/60NNkKTf","date":"Tue Nov 06 19:23:50 MST 2012"},{"aspect":"self_created","tweet":"All the \"perfect\" fiscal policies in the world can't beat equality and human compassion. Go Obama.","date":"Tue Nov 06 12:30:58 MST 2012"},{"aspect":"self_created","tweet":"Democracy works so much better when your side wins.","date":"Tue Nov 06 12:11:11 MST 2012"},{"aspect":"self_created","tweet":"There should be a reality show about people watching Bravo's Silicon Valley reality show.","date":"Mon Nov 05 23:26:07 MST 2012"},{"aspect":"self_created","tweet":"This is just an assumption, but it's probably pretty hard to fall asleep tonight if you're running for president.","date":"Mon Nov 05 22:55:57 MST 2012"},{"aspect":"self_created","tweet":"Bravo's Silicon Valley show will be great for startup recruiting. If you showed what actually happens out here, no one would come.","date":"Mon Nov 05 17:54:53 MST 2012"},{"aspect":"self_created","tweet":"Once you use an iPad mini for a few days, going back to a regular computer feels like using a mainframe.","date":"Mon Nov 05 11:50:41 MST 2012"},{"aspect":"self_created","tweet":"Why is Climate change a partisan issue? It's like there's a coin toss to decide what we agree on and the atmosphere lost this time.","date":"Sun Nov 04 23:23:17 MST 2012"},{"aspect":"self_created","tweet":"If Obama doesn't win, I'm going to Canada. Not like moving there, but for a weekend trip. Potentially.","date":"Sun Nov 04 19:47:24 MST 2012"},{"aspect":"self_created","tweet":"A guy who gets foreign policy, saved the economy, made healthcare accessible & is for equality vs. a guy who hates PBS. Your choice.","date":"Sun Nov 04 12:09:21 MST 2012"},{"aspect":"self_created","tweet":"About to get an extra hour of partying. And by \"partying\" I mean \"reading a sweet PDF.\"","date":"Sun Nov 04 00:32:23 MDT 2012"},{"aspect":"self_created","tweet":"Why startups can beat incumbents: http://t.co/wbI2Th97","date":"Sat Nov 03 19:32:21 MDT 2012"},{"aspect":"self_created","tweet":"Remember: company culture is never static. You're either always improving it, or it's decaying.","date":"Sat Nov 03 15:22:35 MDT 2012"},{"aspect":"self_created","tweet":"At most companies, the iPad Mini would've stalled because it cannibalizes an existing product line. At Apple, they say \"screw it.\"","date":"Sat Nov 03 11:31:11 MDT 2012"},{"aspect":"self_created","tweet":"The laptop replaced the desktop. Tablet replaced the laptop. Mini tablet replaces the tablet. And the phone is just like \"whatever\".","date":"Sat Nov 03 00:06:19 MDT 2012"},{"aspect":"self_created","tweet":"What's the difference between Apple and the IRS? You can evade taxes.","date":"Fri Nov 02 21:42:05 MDT 2012"},{"aspect":"self_created","tweet":"The iPad Mini nailed it. Anyone who thinks there's a comparable Android tablet is either very confused or works for Google.","date":"Fri Nov 02 14:21:15 MDT 2012"},{"aspect":"self_created","tweet":"Nothing is certain but death, taxes, and a lot of people buying iPad Minis this weekend.","date":"Thu Nov 01 22:29:46 MDT 2012"},{"aspect":"self_created","tweet":"Savvy kids trick-or-treating in Palo Alto should be asking for stock options instead of butterfingers.","date":"Wed Oct 31 23:25:39 MDT 2012"},{"aspect":"self_created","tweet":"Last minute Halloween costume: dress up like a Zombie. If asked what you are, say \"Google+\".","date":"Wed Oct 31 19:58:17 MDT 2012"},{"aspect":"self_created","tweet":"Quick Halloween costume: just look really perplexed. When asked what you are, say \"A journalist covering Windows 8/RT/Surface.\"","date":"Wed Oct 31 12:54:17 MDT 2012"},{"aspect":"self_created","tweet":"For Halloween I was going to dress up as Color's business model, but realized I can't wear nothing to work.","date":"Tue Oct 30 19:35:58 MDT 2012"},{"aspect":"self_created","tweet":"Looking forward to Disney's \"The Little Mermaid: Attack of the Clones\"","date":"Tue Oct 30 18:58:43 MDT 2012"},{"aspect":"self_created","tweet":"East coasters are legit. At about the time when cars started FLOATING IN THE STREETS, I would have hyperventilated and passed out.","date":"Mon Oct 29 23:58:38 MDT 2012"},{"aspect":"self_created","tweet":"The east coast is dealing with the biggest hurricane ever, and the west coast response is: launch more smartphones.","date":"Mon Oct 29 12:05:58 MDT 2012"},{"aspect":"self_created","tweet":"SF Rioters: Windows 8 isn't *that* bad.","date":"Mon Oct 29 00:23:01 MDT 2012"},{"aspect":"self_created","tweet":"Call me old fashioned, but I've never understood the connection between winning a baseball game and burning down your neighborhood.","date":"Sun Oct 28 23:20:21 MDT 2012"},{"aspect":"self_created","tweet":"Even in your first interaction, great products give you the impression that you've been using them for years.","date":"Sun Oct 28 12:20:53 MDT 2012"},{"aspect":"self_created","tweet":"Microsoft Surface is what would happen if an iPad and a Lenovo ThinkPad had a love child.","date":"Sat Oct 27 15:55:30 MDT 2012"},{"aspect":"self_created","tweet":"The overlooked innovation of Windows 8. Its Blue Screen of Death: http://t.co/fqK2QnJc","date":"Fri Oct 26 20:08:25 MDT 2012"},{"aspect":"self_created","tweet":"Every great idea starts with a delusional premise.","date":"Fri Oct 26 18:51:42 MDT 2012"},{"aspect":"self_created","tweet":"Looking forward to the SF Giants IPO.","date":"Thu Oct 25 22:14:19 MDT 2012"},{"aspect":"self_created","tweet":"Tim Cook compares Windows 8 to a car that flies and floats. That's about the best testimonial you can get.","date":"Thu Oct 25 16:36:08 MDT 2012"},{"aspect":"self_created","tweet":"Tech industry trifecta: ‚˜‘ Facebook's stock up 20%. ‚˜‘ Apple announces a miniature iPad. ‚˜‘ A Microsoft product gets good reviews.","date":"Wed Oct 24 13:00:13 MDT 2012"},{"aspect":"self_created","tweet":"Apple's product strategy inspiration: http://t.co/cULHtBKD","date":"Tue Oct 23 16:08:07 MDT 2012"},{"aspect":"self_created","tweet":"Top innovations of all time: 1. Ford Model T. 2. iPad. 3. iPad Mini.","date":"Tue Oct 23 12:08:51 MDT 2012"},{"aspect":"self_created","tweet":"Conclusion from debate: we must fear all other countries, as they will attack us with either nukes or low-cost tires.","date":"Mon Oct 22 20:26:47 MDT 2012"},{"aspect":"self_created","tweet":"Obama: when I went to Israel, I had a Bar Mitzvah.","date":"Mon Oct 22 19:57:59 MDT 2012"},{"aspect":"self_created","tweet":"That awkward moment when both presidential candidates realize they don't disagree on foreign policy enough to debate it.","date":"Mon Oct 22 19:36:57 MDT 2012"}]}