{"user_name":"ray_bradford","user_timeline":[{"aspect":"self_created","tweet":"RT @johndoerr: Ray Bradford @kpcb #startup venturecapital - \"There's No Free Lunch\" - http://t.co/Rw97HbcV","date":"Sun Dec 02 23:16:41 MST 2012"},{"aspect":"self_created","tweet":"RT @johndoerr: Come by @KPCB new SF office now #KPSalon @msquinn @ray_bradford.  Meet 200 of the world's greatest entrepreneurs... http: ...","date":"Thu Nov 15 19:27:10 MST 2012"},{"aspect":"self_created","tweet":"w/ NBA 3pt ace Klay Thompson. Not pictured at his request - me windmill dunking on him (at KPCB CEO Summit) [pic] — http://t.co/YFmmmawn","date":"Thu Sep 13 18:46:19 MDT 2012"},{"aspect":"self_created","tweet":"RT @birbigs: Capers are an exciting name for a boring food.","date":"Sat Jul 28 14:57:17 MDT 2012"},{"aspect":"self_created","tweet":"Any news story that includes the analysis \"This person puts on a goat suit, he changes the game\" is bound for glory http://t.co/gVbIw6pd","date":"Fri Jul 27 20:13:59 MDT 2012"},{"aspect":"self_created","tweet":"I'd like to have been in the pizza hut product naming meeting for the new P'zolo. What were the other names left on the table?","date":"Thu Jun 14 20:31:00 MDT 2012"},{"aspect":"self_created","tweet":"Plate of crow + tall glass of Haterade for breakfast for those who eulogized over LBJ & the Heat while body was warm. Reserve more judgment.","date":"Fri Jun 08 10:34:53 MDT 2012"},{"aspect":"self_created","tweet":"Rumors of my demise have been greatly exaggerated. RIP ray bradbury, it's an honor to have my name repeatedly confused with yours #lovescifi","date":"Wed Jun 06 14:58:40 MDT 2012"},{"aspect":"self_created","tweet":"@tristanwalker last three fouls on Lebron were bs.  should have been blocking foul, KG, Pietrus","date":"Sun Jun 03 21:35:51 MDT 2012"},{"aspect":"self_created","tweet":"\"don't start macing it\" and other hard-hitting tips from BW on what to do if a mountain lion gets into your office http://t.co/r0tcMfMM","date":"Thu May 24 19:06:37 MDT 2012"},{"aspect":"self_created","tweet":"Obviously best ad ever, courtesy of Biz Markie (aka Captain TuneUp) http://t.co/151xB3xl  Sadly don't need it, thanks to @Spotify","date":"Tue May 01 11:38:31 MDT 2012"},{"aspect":"self_created","tweet":"Cruise ship has deposited hordes of tourists on my run path for me to cut through.  In my head I'm the Barry Sanders of the Embarcadero","date":"Sat Apr 28 15:34:08 MDT 2012"},{"aspect":"self_created","tweet":"RT @utahjazz: We are going to the PLAYOFFS!!! #WeAreUtahJazz #PHXatUTA","date":"Tue Apr 24 23:13:42 MDT 2012"},{"aspect":"self_created","tweet":"fascinating MIT tech review article; asteroid that wiped out the dinosaurs ejected life-bearing earthrock across galaxy http://t.co/pC4VA3Au","date":"Wed Apr 11 20:59:20 MDT 2012"},{"aspect":"self_created","tweet":"Techstars Cloud Demo Day  - after navigating the bustling downtown San Antonio stree... (at The Empire Theater) [pic] — http://t.co/7fHx8t9H","date":"Wed Apr 11 10:11:50 MDT 2012"},{"aspect":"self_created","tweet":"@chchien $2 Million, possibly less...","date":"Fri Mar 30 18:37:49 MDT 2012"},{"aspect":"self_created","tweet":"RT @someecards: The best video of a soccer player wiping a booger on a kid's face you'll see today. http://t.co/C7lt9aeh","date":"Fri Mar 30 18:20:27 MDT 2012"},{"aspect":"self_created","tweet":"IDC says as many bits in the digital universe as stars in the physical. Makes me more awestruck by # of stars than need for S3 & EMC (<3 S3)","date":"Fri Mar 30 17:40:59 MDT 2012"},{"aspect":"self_created","tweet":"“@JuddApatow: Anchorman 2 is on!   http://t.co/rDQd5xiQ”.  Glorious news.  Don't let anyone ever lie & tell you the first was overrated","date":"Wed Mar 28 23:56:42 MDT 2012"},{"aspect":"self_created","tweet":"RT @birbigs: Gas prices right now are like the amount they charge you at Hertz when you return a car on empty.","date":"Tue Mar 27 23:12:13 MDT 2012"},{"aspect":"self_created","tweet":"Klout tells me I am influential on the topics of bankruptcy, ice cream and engineering (pic).Massive thought leadership http://t.co/ThY7UrYV","date":"Sat Mar 24 20:03:52 MDT 2012"},{"aspect":"self_created","tweet":"http://t.co/7kPU7bf1 Interesting article on memory and forgetting. Sci-fi-style manipulation of memories only getting closer.","date":"Fri Mar 23 16:50:12 MDT 2012"},{"aspect":"self_created","tweet":"Clearly PF Changs is buying special \"startup messages\" fortune cookies for its silicon valley locations http://t.co/h1yJx003","date":"Tue Mar 13 21:49:05 MDT 2012"},{"aspect":"self_created","tweet":"surprising how often taxis still dont have GPS and need some backseat gmaps phone magic to get there. Next up: lending my doc a stethoscope","date":"Tue Mar 13 12:58:14 MDT 2012"},{"aspect":"self_created","tweet":"How was that ruled a fumble on the field (excepting 12 men call) but Bradshaw's fumble vs. 49ers was not.  Identical. #stillbitter","date":"Sun Feb 05 16:51:08 MST 2012"},{"aspect":"self_created","tweet":"Feeling like a young Anakin Skywalker, letting my anger fester that the Giants are in the SB not the 49ers. pain of what should have been!","date":"Sun Feb 05 10:29:48 MST 2012"},{"aspect":"self_created","tweet":"Just received a business email with a signature followed by \"Sent from my 2006 vintage Windows XP personal computer.\"  Well played, sir.","date":"Wed Jan 18 19:47:49 MST 2012"},{"aspect":"self_created","tweet":"The Supreme Court, big data and 1984 http://t.co/wVkpUaB6","date":"Thu Nov 24 17:26:50 MST 2011"},{"aspect":"self_created","tweet":"Tragic news - Dippin' Dots filed for bankruptcy.  The future of ice cream was here, just not evenly distributed. http://t.co/Y55ufac2","date":"Fri Nov 04 11:51:29 MDT 2011"},{"aspect":"self_created","tweet":"I'm at Metropolitan Grill (820 2nd Ave., at Marion St., Seattle) http://t.co/zoSJsVoX","date":"Sat Oct 22 20:06:09 MDT 2011"},{"aspect":"self_created","tweet":"Having your alarm clock radio wake you up to a Creed song feels like having the waiter spit in your morning coffee.","date":"Sun Oct 09 10:58:40 MDT 2011"},{"aspect":"self_created","tweet":"Thank you Jerry Sloan for 23 amazing years and all the Utah Jazz memories.","date":"Thu Feb 10 16:44:19 MST 2011"},{"aspect":"self_created","tweet":"Prince is @ a Vikings game watching Brett Favre. Like Obama/Biden, for national security these two should not be allowed in the same place.","date":"Sun Nov 29 16:58:12 MST 2009"},{"aspect":"self_created","tweet":"It might sound like you're DDR'ing or 15 at Abercrombie buying polos, but Basement Jaxx outdid themselves w/this gem: http://bit.ly/32nBu8","date":"Sun Oct 25 23:58:22 MDT 2009"},{"aspect":"self_created","tweet":"new rule for McCain: if you cant use email, you can't legislate the internet. Stop getting mavericky on my interwebs! http://bit.ly/ZzCxl","date":"Fri Oct 23 15:47:36 MDT 2009"},{"aspect":"self_created","tweet":"It throws a man off to hear both Salt Lake City and Karl Malone the Mailman mentioned in a Ghostface Killah album.  #supremeclientele","date":"Wed Oct 14 22:21:48 MDT 2009"},{"aspect":"self_created","tweet":"if I had a gilded doubloon for special interest news story in Seattle on dog parks, I'd have a whole mess of gilded doubloons.","date":"Sat Oct 10 17:20:25 MDT 2009"},{"aspect":"self_created","tweet":"Trying to decide if this elevator flier is a joke: \"Together for the first Time:  Puget Sound's Best Corporate A Cappella\"","date":"Fri Oct 09 19:15:20 MDT 2009"},{"aspect":"self_created","tweet":"@alicec47 Hellhole Ratrace is still a good song. At least Girls is better than Woods, Japandroids and all the other noise acts Pfork hypes","date":"Tue Oct 06 17:16:14 MDT 2009"},{"aspect":"self_created","tweet":"2054 according to Surrogates involved lifelike robots people control with their brains, but people still wore Bluetooth earpieces #countmein","date":"Sat Oct 03 20:25:51 MDT 2009"},{"aspect":"self_created","tweet":"Just realized I've been sleeping on a wonderous mall food court 2 blocks away with astounding selection.  They even have \"World Wrapps LTD\"","date":"Sat Oct 03 15:37:04 MDT 2009"},{"aspect":"self_created","tweet":"I'm going to go out on a limb here and say candy corn is amazing, and probably why most people immigrate to America.","date":"Sun Sep 27 17:25:47 MDT 2009"},{"aspect":"self_created","tweet":"@tristanwalker you won't find me hating on foursquare generally, but becoming the mayor of both CVS pharmacy and Ikea? in one day?really? :)","date":"Sun Sep 27 17:20:45 MDT 2009"},{"aspect":"self_created","tweet":"that living above a hotel --> wedding crashing when the dj seems good = opportune.  that the \"Yorrie Schorb\" nametag was unclaimed = magic.","date":"Sun Sep 27 01:34:31 MDT 2009"},{"aspect":"self_created","tweet":"The Blind Side trailer makes me want to eat my own hands.By comparison, trailers for turdtruffle \"All About Steve\" look like Holmes trailers","date":"Sun Sep 20 00:43:12 MDT 2009"},{"aspect":"self_created","tweet":"@jillyface youre single-handedly restoring string cheese to its proper place of snack dominance.Im on fruit gushers, someone get Handisnacks","date":"Wed Sep 16 11:31:31 MDT 2009"},{"aspect":"self_created","tweet":"Out of all those kinds of people, you have a face with a view  ‚™« This Must Be The Place (Naive Melody) - Talking Heads  http://lala.com/z3L2","date":"Sun Sep 13 17:18:08 MDT 2009"},{"aspect":"self_created","tweet":"This Wal-Mart commercial shows a family playing Monopoly and 1 kid giving the other a hotel because he feels bad. That shit don't happen.","date":"Sun Sep 13 12:57:52 MDT 2009"},{"aspect":"self_created","tweet":"Lost 5 min pondering what's involved in this Japanese restaurants Larry Bird Discount ($3.33 Sake?) b4 realizing it was \"Early Bird.\" #tired","date":"Tue Sep 01 22:37:10 MDT 2009"},{"aspect":"self_created","tweet":"The Replacement's \"Can't Hardly Wait.\"  http://lala.com/z4MD Classic punk tune. Title references prospect of doing work on Sunday.","date":"Sun Aug 30 11:17:52 MDT 2009"},{"aspect":"self_created","tweet":"If there is a homeless uprising in downtown Seattle, I don't like my odds.The lady that screams at passers-by on 2nd Ave + katanas /=/ good","date":"Sat Aug 29 23:15:59 MDT 2009"},{"aspect":"self_created","tweet":"The XX just dropped one of the best electronic albums this decade.  http://lala.com/zflk  Discovery & Postal Service clean out your desks!","date":"Sat Aug 29 17:59:54 MDT 2009"},{"aspect":"self_created","tweet":"@anamitra in the same boat with Entourage.  Sadly since '05 it seems to have tracked the Motorola Razr in steady decline. !=#victory","date":"Tue Aug 25 00:09:07 MDT 2009"},{"aspect":"self_created","tweet":"Inglourious Basterds is better than Pulp Fiction and Kill Bill.  Yeah I just said that.","date":"Sun Aug 23 22:26:36 MDT 2009"},{"aspect":"self_created","tweet":"Starting work with a sweet jam from The Rural Alberta Advantage. http://bit.ly/1u5cl  My spreadsheets now have more rural alberta than yours","date":"Wed Aug 19 10:19:33 MDT 2009"},{"aspect":"self_created","tweet":"\"Bear\" by The Antlers  http://lala.com/zW6e = this decade's \"Brick\".  that means same song topic/themes, less stripey sweaters & gap jeans.","date":"Tue Aug 18 22:34:04 MDT 2009"},{"aspect":"self_created","tweet":"Sergeant Butterman, the little hand says it's time to rock and roll.","date":"Sat Aug 15 21:42:37 MDT 2009"},{"aspect":"self_created","tweet":"District 9 just rocked my socks.  the argyle smartwool ones i was saving for the rainy season.   #prawns  #fewersocksthanipreviouslyhad","date":"Sat Aug 15 00:28:43 MDT 2009"},{"aspect":"self_created","tweet":"Doing more research on SimpleDB and the architecture of non-RDBMS.  Excited to join the sdb team tomorrow at Amazon! #firstdayofwork","date":"Sun Aug 02 20:00:41 MDT 2009"},{"aspect":"self_created","tweet":"\"I bet one legend that keeps recurring throughout history, in every culture, is the story of Popeye.\"  #deepthoughts","date":"Sun Aug 02 11:46:58 MDT 2009"},{"aspect":"self_created","tweet":"Why do restaurants turn the chairs over and put them on the tables when they close?  It seems wildly counterproductive #unsolvablemysteries","date":"Tue Jul 28 02:12:21 MDT 2009"},{"aspect":"self_created","tweet":"NYT Article on advancements in AI http://bit.ly/1aa9es  Robots that can kill autonomously and create other smart robots.  Save us Will Smith","date":"Mon Jul 27 18:20:41 MDT 2009"},{"aspect":"self_created","tweet":"@fredwilson Glad you liked the case study on @etsy.  Anda was a pleasure to work with when writing it & does a great job building community","date":"Fri Jul 24 11:15:19 MDT 2009"},{"aspect":"self_created","tweet":"Excited to see project I worked on at Twitter launch http://bit.ly/sb1QK  Lot of faith in @anamitra @biz and @twitter gang. Good luck!","date":"Thu Jul 23 20:45:52 MDT 2009"},{"aspect":"self_created","tweet":"waking up to Benihana leftovers is like waking up next to Megan Fox.  If Megan were meatier, fresher, and made via Hibachi not Transformers.","date":"Wed Jul 22 13:50:04 MDT 2009"},{"aspect":"self_created","tweet":"late night *fried corn-on-the-cob + dirty martinis at Palace Kitchen. Legend has it Homer survived on this meal when composing the Iliad","date":"Tue Jul 21 02:59:26 MDT 2009"},{"aspect":"self_created","tweet":"creepy. http://bit.ly/3DE85k is a wiretap recording of one of my recent phone calls and gives Yum Brands the artistic treatment they deserve","date":"Sat Jul 18 17:45:00 MDT 2009"},{"aspect":"self_created","tweet":"Just saw a Segway scooter tricked out with Ferrari paint and a Ferrari logo.  It's not every day you see your dream ride in person","date":"Fri Jul 17 15:20:23 MDT 2009"},{"aspect":"self_created","tweet":"Upset I'm out of unseen 30 Rock episodes.  That show and I have an attraction that can only be described as wolf-like, lupine.  #untoward","date":"Thu Jul 16 23:10:37 MDT 2009"},{"aspect":"self_created","tweet":"Nelly just hit a home run in the MLB celebrity game. He dominates the NBA ones too.  Dude needs to leave sweat/suit rapping behind.","date":"Mon Jul 13 21:30:46 MDT 2009"},{"aspect":"self_created","tweet":"At Emerald Queen casino in Tacoma.  Pat Benatar comes here in concert in September, so you know it's good. Classsssy gift shop.","date":"Fri Jul 10 22:22:18 MDT 2009"},{"aspect":"self_created","tweet":"Attempting to cook my own (non-frozen) food for the first time - thai chicken curry. I bet riches I end up at Wendy's tonight.","date":"Thu Jul 02 19:38:07 MDT 2009"},{"aspect":"self_created","tweet":"Not sure which is more likely to give me a hangover tomorrow:  the pre-movie Patron, or having watched the special effects in Transformers 2","date":"Sat Jun 27 05:07:04 MDT 2009"},{"aspect":"self_created","tweet":"It takes a lot of cunning and creativity to achieve a $36.55 tab for 2 peops at Popeyes fast food, but I've got the 9 biscuit magic in me.","date":"Wed Jun 17 22:11:19 MDT 2009"},{"aspect":"self_created","tweet":"@jillyface http://bit.ly/vi8mp = sweet jam I was referring to yesterday.  syrup-y vocals and precious synth lines = electropop delightz.","date":"Sat May 30 17:14:26 MDT 2009"},{"aspect":"self_created","tweet":"Blog post I wrote on relevance within FB, Twitter, Email for Weigend.com (former Amazon Chief Scientist's blog):  http://bit.ly/qz4YJ","date":"Wed May 27 17:54:16 MDT 2009"},{"aspect":"self_created","tweet":"crushing on Annie http://bit.ly/rmMjH like I did U.S. gymnast Shannon Miller in '92 (when I wrote her a love letter on my mom's stationary)","date":"Wed May 27 12:26:20 MDT 2009"},{"aspect":"self_created","tweet":"I just went 0/3 in my attempt to order Squeeze-Its, Otter Pops, and sour Gushers on Safeway.com.  This disastrous outcome may ruin Mem. Day","date":"Mon May 25 12:19:54 MDT 2009"},{"aspect":"self_created","tweet":"Lebron James' shot saved this night from the dialogue I just suffered at Terminator Salvation.  Consensus is C. Bale = K. Reeves + roid rage","date":"Sat May 23 01:43:38 MDT 2009"},{"aspect":"self_created","tweet":"M&A financial modeling + mid-day drinking.  Goes together like skateboarding + freeway ramps.","date":"Sat May 16 18:40:24 MDT 2009"},{"aspect":"self_created","tweet":"Why are Wendys desperately sparse in NorCal?  Late night 5-pc chicken situations 2x-dipped in \"heartland\" ranch + bbq = scrumptulescent","date":"Fri May 15 04:09:40 MDT 2009"},{"aspect":"self_created","tweet":"\"My belt holds up my pants and my pants have belt loops that hold up the belt.  Wtf is really going on down there? Who is the real hero?\"","date":"Tue May 12 17:51:37 MDT 2009"},{"aspect":"self_created","tweet":"fav bands unite! the National + St.V  http://bit.ly/11Exxv - \"Give the ocean what I took from you so one day you can find it in the sand\"","date":"Sun May 10 12:47:10 MDT 2009"},{"aspect":"self_created","tweet":"Bat for Lashes deserve break, but didn't predict after last album. On Letterman with best song Kate Bush never wrote http://bit.ly/Lm0Ne","date":"Fri May 08 11:54:25 MDT 2009"},{"aspect":"self_created","tweet":"Gaslight Anthem = unholy alliance of Bruce vocals, Cure guitars, Ataris' overly bombastic lyrics. catchier than expected http://bit.ly/fyyzo","date":"Mon May 04 00:22:19 MDT 2009"},{"aspect":"self_created","tweet":"Joakim Noah looks like a clown with his lanky arms and lack of grace.  I've got to cheer for Ray-Ray Allen, aka Jesus Shuttlesworth.","date":"Sat May 02 18:55:02 MDT 2009"},{"aspect":"self_created","tweet":"i am really craving a bacone right now.   http://bit.ly/GJa7z","date":"Sat May 02 05:12:39 MDT 2009"},{"aspect":"self_created","tweet":"swine flu seems to be striking primarily young healthy men ages 20-40.  does my rickety health and frail constitution mean immunity?","date":"Sun Apr 26 17:35:11 MDT 2009"},{"aspect":"self_created","tweet":"\"I'm sick of following my dreams -  I think I'll find out where they are going and just hook up with them later\"   listening to Hedburgh.","date":"Fri Apr 24 01:27:56 MDT 2009"},{"aspect":"self_created","tweet":"Heated debate in car on way to LA. Which actor has highest paycheck-to-skill ratio? Definitely Nicolas Cage.prolific sucking","date":"Mon Apr 20 03:32:26 MDT 2009"},{"aspect":"self_created","tweet":"Still impressed by the full-on child harness (w/leash of course) I spotted on an 8yo tonight.Perfect or coachella or taking kids to Sears","date":"Mon Apr 20 03:30:06 MDT 2009"},{"aspect":"self_created","tweet":"Favorite act = Junior Boys.  \"In the Morning\" live is a religious experience.  Confetti canons included  - definitely increase religiosity","date":"Sun Apr 19 01:11:12 MDT 2009"},{"aspect":"self_created","tweet":"#Coachella results: Dr. Dog, Blitzen Trapper, TVotR, Chem Brs, DJ AM/TRVS, Glass Candy, Fleet Foxes, Jenny Lewis, Jr Boys, MIA, Killers.","date":"Sun Apr 19 01:07:40 MDT 2009"},{"aspect":"self_created","tweet":"Brandon Flowers of Killers has come a long way as a showman since Saltair 4 years ago. Utahs best export since salt water taffy #coachella","date":"Sun Apr 19 01:02:30 MDT 2009"},{"aspect":"self_created","tweet":"Seeing the most elaborate and remarkable collection of strapped burgundy dress sandals on the old men at the palm springs airport.","date":"Sat Apr 18 12:04:01 MDT 2009"},{"aspect":"self_created","tweet":"Fellow REI customer - \"do you work here?\" Me - \"absolutely not\"  Her - \"oh I thought you did\"  Triple down on that identity crisis.","date":"Fri Apr 17 19:56:04 MDT 2009"},{"aspect":"self_created","tweet":"Caught at REI buying sunhat and camelbak = fate worse than death. Damn u Coachella 100+ degree forecasts for instigating identity crises","date":"Fri Apr 17 19:46:22 MDT 2009"},{"aspect":"self_created","tweet":"song might have a legit chance at top 40 crossover.  Harlem Shakes \"Strictly Game\"  http://bit.ly/13TnqV   maybe already playing @ Old Navy?","date":"Fri Apr 17 11:29:06 MDT 2009"},{"aspect":"self_created","tweet":"RT @mm: Co's should run campaigns where if you tweet their name w/hashtag (eg. #jcrew) they'll DM you a sale promo code / agreed,  #JBox plz","date":"Thu Apr 16 18:22:39 MDT 2009"},{"aspect":"self_created","tweet":"http://bit.ly/109qfV  Am I cliche if I've been outspokenly hating on Ed Hardy since Hoobastank ruined the world with \"The Reason\"","date":"Wed Apr 15 13:03:51 MDT 2009"},{"aspect":"self_created","tweet":"@fredwilson have to love the Lou Reed.  Great use of Replacements' 'Bastards of Young' at the opening of the movie as well.","date":"Sat Apr 11 15:01:24 MDT 2009"},{"aspect":"self_created","tweet":"Now Negotiations last lecture- \"that honesty is the best policy is a myth in a lot of negotiations scenarios, including marriage\"","date":"Wed Apr 08 18:37:22 MDT 2009"},{"aspect":"self_created","tweet":"@jillyface which one?  \"If I  Ever Feel Better\" might be the best song on the planet.  Alphabetical is a good album too,","date":"Sun Apr 05 03:06:19 MDT 2009"},{"aspect":"self_created","tweet":"dj playlist for Palace party finished. reminded that Annie's \"My Heartbeat\" is the Excelsior of indie dance-pop  http://bit.ly/rE7Px.","date":"Sat Apr 04 21:18:42 MDT 2009"},{"aspect":"self_created","tweet":"http://bit.ly/zP8a4  cool twitter use case. I would pay $11.28/mo to turn my Snoopy snow cone machine on remotely via twitter. Warm it up B","date":"Fri Apr 03 00:32:24 MDT 2009"},{"aspect":"self_created","tweet":"just loaded up on a medley of fresh-to-death gingham shirts.   i'll be the guy looking like the inside of a rain coat / picnic basket.","date":"Thu Apr 02 01:41:50 MDT 2009"},{"aspect":"self_created","tweet":"@alicec47 btw everyone knows chevy makes the malibu, not ford.  and that it contains a miraculous number of drink holders.  fit for a king.","date":"Tue Mar 31 17:31:45 MDT 2009"},{"aspect":"self_created","tweet":"New Yeah Yeah Yeahs  album is strong.  I'm a Karen O sucker, and these disco beatz force me to bust out some Heart of Glass-era Blondie.","date":"Tue Mar 31 16:48:48 MDT 2009"},{"aspect":"self_created","tweet":"The apparent lack of additional Pop 5 game cards for sale is giving me a brain aneurysm.  My crack squad of playaz demand a challenge.","date":"Tue Mar 31 10:56:37 MDT 2009"},{"aspect":"self_created","tweet":"2nd thought- top Billy Bob playing country with a 7 piece band in matching clownsuits w/fog machine. From Angie to http://twitpic.com/28mzo","date":"Thu Mar 19 01:54:54 MDT 2009"},{"aspect":"self_created","tweet":"Two Lovers = brutally honest , great film. Reminder of a time before Joaquin Phoenix dropped rhymes like dimes and was actually a good actor","date":"Mon Mar 09 22:09:44 MDT 2009"},{"aspect":"self_created","tweet":"Ra Ra Riot @ SF's the Independent.  Kate Bush \"hounds of love\" covers make my heart go pitter-patter","date":"Sat Feb 28 02:27:17 MST 2009"},{"aspect":"self_created","tweet":"Coraline = worth the wait, out-of-control creative stop motion.  Best animated movie since???  Best animated entertainment since DuckTales?","date":"Mon Feb 09 01:08:11 MST 2009"},{"aspect":"self_created","tweet":"whats with the heavy selling of 3d glasses/programs during the super bowl? time to dust off the stunner shades i got in my Corn Pops in '96","date":"Sun Feb 01 18:00:30 MST 2009"}]}